{"ItemAttachments":[{"Key":"AUGSPIN","Name":"Augmented Spin Barrel","Description":"\n      [H3]Augmented Spin Barrel[h3]\n\nUsing an updated and streamlined galven pattern and heavy-duty static pulse adapters, this custom barrel increases both the damage output and armor penetration of blaster rifles and heavy blaster rifles. The trade-off for all this extra stopping power is increased wear and tear on both the frame of the blaster and the barrel, leading to an increase in maintenance and down-time. This attachment can only be used with blaster rifles and heavy blaster rifles.\n\n[P][B]Models Include:[b] Dolmax 243X \"Penetrator Augmented Spin Barrel, Arakyd HH780 HotShot Barrel, BlasTech Model 213 Perforator Barrel.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Blaster Rifle"},"Price":1750,"Rarity":4,"HP":2,"BaseMods":{"Mod":[{"Key":"DAMADD","Count":1},{"Count":1,"MiscDesc":"\n          Add [SETBACK] to all Mechanics checks when performing\n          maintenance on this weapon.\n        "}]},"AddedMods":{"Mod":[{"Key":"DAMADD","Count":2},{"Key":"ACCURATE","Count":1},{"Key":"PIERCE","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"BALHILT","Name":"Balanced Hilt","Description":"\n      [H3]Balanced Hilt[h3]\n\nBalance is key in a well-constructed melee weapon. Professional weaponsmiths can use modem ultra-light materials to create a sword or axe that is not only lighter, but also more accurate in the hands of a skilled warrior. This attachment can be used with any melee weapon. \n\n[P][B]Models Include:[b] None.","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Melee"},"Price":1500,"Rarity":5,"HP":2,"BaseMods":{"Mod":{"Key":"ACCURATE","Count":1}},"AddedMods":{"Mod":[{"Key":"ENCSUB","Count":1},{"Key":"ACCURATE","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"BLASTACT","Name":"Blaster Actuating Module","Description":"\n      [H3]Blaster Actuating Module[h3]\n\nA Blaster Actuating Module is a blaster modification popular with mercenaries, bounty hunters, and anyone needing to make the first strike count. Adaptable to nearly any blaster pistol, this attachment is a simple upgraded blaster actuating module with custom firmware and a stronger electromagnetic accelerator that provides more powerful and more penetrating blaster shots. Unfortunately, this excess power takes its toll on the weapon, and blasters so modified tend to develop reliability problems the longer they are used with this attachment. This attachment is only for use on Ranged (Light) blaster pistols. \n\n[P][B]Models Include:[b] SoroSuub X440 \"Hammer Blaster Actuating Module, Dolmax Heavy Blaster Actuator, Arakyd 97R Enhanced Blaster Actuating Module.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Blaster Pistol"},"Price":500,"Rarity":4,"HP":1,"BaseMods":{"Mod":[{"Key":"DAMADD","Count":1},{"Key":"SETBACKADD","Count":1}]},"AddedMods":{"Mod":[{"Key":"DAMADD","Count":2},{"Key":"PIERCE","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"BIPOD","Name":"Bipod Mount","Description":"\n      [H3]Bipod Mount[h3]\n\nLittle more than a pair of folding or collapsible legs mounted beneath the barrel of a long arm, bipods are used to stabilize awkward or heavy weapons to improve their firing characteristics. Especially useful when firing from behind low cover or from a prone position, bipods are typically used on squad support weapons, or by sharpshooters and snipers to better steady their weapons. This attachment can only be applied to rifles, carbines, and light repeating blasters, and takes one preparation maneuver to set up. \n\n[P][B]Models Include:[b] Galactic Arms XA Classic Bipod, Czerka M20 Marksman Bipod.","Custom":"DescOnly","Type":"Weapon","ItemLimit":{"Key":"BLASTLTREP"},"CategoryLimit":{"Category":["Rifle","Carbine"]},"Price":100,"Rarity":1,"HP":1,"BaseMods":{"Mod":{"Key":"CUMBERSOME","Count":-2}},"Thumbnail":"img\/no_image.png"},{"Key":"BOWREC","Name":"Bowcaster Re-Cocker","Description":"\n      [H3]Bowcaster Re-Cocker[h3]\n\nFew weapons in the galaxy are as indicative of their users as the Wookiee bowcaster. Bowcasters require an incredible level of raw physical strength to wield, especially when loading and cocking the weapon to fire. A time-consuming and labor-intensive process, reloading a bowcaster is made much simpler and easier by use of the automatic re-cocker. This attachment entails upgrading the basic weapon with a number of power-assist systems as well as a magazine feed system that allows the weapon to fire, re-cock, and reload all in one smooth, quick movement. These attachments are only for use on Wookiee bowcasters, and they cannot be purchased; they must be built either by the owner of the bowcaster with an [B]Average ([DI][DI]) Mechanics check[b] or the weaponsmith who built the weapon for him. \n\n[P][B]Models Include:[b] None.","Source":"Edge of the Empire Core Rulebook","Custom":"DescOnly","Type":"Weapon","ItemLimit":{"Key":"BOWCAST"},"Price":500,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"\n          Removes reloading maneuver requirement from bowcaster.\n        "}},"AddedMods":{"Mod":{"Key":"AUTOFIRE","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"BOWACC","Name":"Bowcaster Accelerator Enhancement","Description":"\n      [H3]Bowcaster Accellerator Enhancement[h3]\n\nBuilt from scavenged blaster parts and the occasional piece from a repulsorlift generator, the bowcaster accelerator enhancement is the second-most common modification to Wookiee bowcasters after the automatic re-cocker. Essentially an upgrade of the weapon's bolt accelerators, this attachment allows the bowcaster to fire its highly destructive quarrels with more force than typical in a stock weapon. These attachments are only for use on Wookiee bowcasters, and they cannot be purchased; they must be built either by the owner of the bowcaster with an [B]Average ([DI][DI]) Mechanics check[b] or the weaponsmith who built the weapon for him. \n\n[P][B]Models Include:[b] None.","Source":"Edge of the Empire Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Bowcaster"},"Price":250,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Key":"DAMADD","Count":1}},"AddedMods":{"Mod":[{"Key":"DAMADD","Count":2},{"Key":"PIERCE","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"FFS","Name":"Filed Front Sight","Description":"\n      [H3]Filed Front Sight[h3]\n\nAn old assassin's trick, this is the simple act of removing the front sight of a blaster pistol by filing it off. A common modification to holdout blasters (along with removing their serial numbers), filing down the weapon's front sight allows it to be drawn more quickly from its holster, and reduces the possibility of it becoming snared on clothing. Unfortunately, while this modification makes for easy concealment and drawing, it also reduces the weapon's accuracy, as it effectively makes it impossible to aim with any amount of precision. This modification may only be applied to pistol-sized weapons. Applying it oneself requires an [B]Average ([DI][DI]) Mechanics check[b]; the cost is paying others to perform the modification.\n\n[P][B]Models Include:[b] None.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Pistol"},"Price":25,"HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"\n          Increases the difficulty of combat checks to hit targets at\n          ranges beyond Short range by one.\n        "},{"Key":"QUICKDR"}]},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"Decreases the difficulty of checks to conceal the weapon by one."}},"Thumbnail":"img\/no_image.png"},{"Key":"FAG","Name":"Forearm Grip","Description":"\n      [H3]Forearm Grip[h3]\n\nLittle more than a vertical handgrip affixed below the barrel of a rifle-sized weapon, forearm grips are a popular modification among mercenaries, designed to give the user better control over the weapon. This Attachment can only be used on rifles (but not heavy rifles) and carbines.\n\n[P][B]Models Include:[b] Galactic Arms Model 94 Forearm Grip, Dolmax 14A Detachable Pistol Grip, Merr-Sonn AG44S Ergonomic Tactical Foregrip.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":["Non-Heavy Rifle","Carbine"]},"Price":250,"Rarity":1,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"\n          Decreases the additional difficulty of making Ranged (Heavy)\n          checks with this weapon while engaged to an\n          additional [DIFFICULTY] (rather than [DIFFICULTY][DIFFICULTY]).\n        "}},"AddedMods":{"Mod":[{"Key":"POINTBL","Count":1},{"Key":"ACCURATE","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"MB","Name":"Marksman Barrel","Description":"\n      [H3]Marksman Barrel[h3]\n\nMerr-Sonn's KX765 Marksman Barrel was designed to meet the needs of the finger for whom long-range accuracy is a necessity. Popular among bounty hunters and assassins, this barrel is nearly two meters long and made of lightweight materials. It features upgraded static pulse adapters as well as a denser galven circuitry pattern that not only increases the weapon's range, but also its accuracy. The trade-off for this increased range and accuracy is a weapon that's slightly awkward to use and nearly impossible to conceal due to the length of the barrel. This modification may only be applied to blaster rifles. \n\n[P][B]Models Include:[b] Merr-Sonn KX756 Marksman Barrel, SoroSuub WQ80 \"Long-shot\" Barrel, Arakyd 3300 Hawkeye Sharpshooter's Barrel.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Blaster Rifle"},"Price":1200,"Rarity":4,"HP":2,"BaseMods":{"Mod":[{"Key":"RANGEADD","Count":1},{"Key":"CUMBERSOME","Count":2}]},"AddedMods":{"Mod":[{"Key":"SNIPSHOT","Count":1},{"Key":"ACCURATE","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"MME","Name":"Mono-Molecular Edge","Description":"\n      [H3]Mono-Molecular Edge[h3]\n\nEven vibroweapons can benefit from an edge sharpened to molecular thickness and toughened through laser-forging techniques. This modification may be applied to melee weapons that use a cutting edge. \n\n[P][B]Models Include:[b] None listed.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Cutting Edge Melee"},"Price":1000,"Rarity":5,"HP":1,"BaseMods":{"Mod":{"Key":"CRITSUB","Count":1}},"AddedMods":{"Mod":{"Key":"PIERCE","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"MOS","Name":"Multi-Optic Sight","Description":"\n      [H3]Multi-Optic Sight[h3]\n\nA complex and sophisticated piece of equipment, the multi-optic sight is a wonder of modem sensor technology. Marketed to the discriminating professional soldier, each consists of a bulky on-weapon optic equipped with numerous sensors including low-light, thermal, ultrasound, millimeter wave emitters, video capture, and common optical enhancements. The optic is connected to a pair of goggles worn by the user by a reinforced fiber optic cable that transmits the vision enhancements directly to the user in real time. This allows the user to see around corners and over obstacles. This attachment can be fit to any ranged weapon. \n\n[P][B]Models Include:[b] Galactic Arms Model 44 Combat Optical Enhancer, SoroSuub XAD Omnisight, Merr-Sonn 480.z1 \"Beholder\" Multi-Optic Sight.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Ranged"},"Price":2000,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"\n          Removes up to [SETBACK][SETBACK]  on any checks\n          to use this weapon due to smoke, darkness, or other\n          environmental conditions that obstruct vision.\n        "}},"AddedMods":{"Mod":{"Key":"PERC","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"SB","Name":"Spread Barrel","Description":"\n      [H3]Spread Barrel[h3]\n\nCommonly applied to blaster rifles and carbines, BlasTech's \"Scattergun\" Spread Barrel is a common modification among spacers and fringers. Designed with close-quarters combat in mind, this attachment replaces a blaster's stock barrel with one shorter, bulkier, broader, and equipped with a built-in flash hider. Using a stepped array of prismatic crystals located at the end of the barrel as well as a reconfigured galven pattern, this barrel splits the blaster's beam into a number of smaller beams that exit the barrel in a spray pattern. Used in a tightly packed space, these beams can strike multiple targets with one pull of the trigger. The trade-off for this, however, is a reduction in the weapon's range. This attachment can only be applied to blaster rifles and blaster carbines. \n\n[P][B]Models Include:[b] BlasTech 8405 \"Scattergun\" Spread Barrel, SoroSuub 800 \"Blunderbuss\" barrel, Arakyd Model 70 \"Chain Lightning\" Spread Barrel.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":["Blaster Rifle","Blaster Carbine"]},"Price":1725,"Rarity":4,"HP":2,"BaseMods":{"Mod":[{"Key":"RANGESUB","Count":1},{"Key":"BLAST","Count":4}]},"AddedMods":{"Mod":{"Key":"BLAST","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"SE","Name":"Serrated Edge","Description":"\n      [H3]Serrated Edge[h3]\n\nThe simplicity of this modification belies its viciousness. Adding a serrated edge to a weapon is something almost anyone can do, and giving a bladed weapon tearing edges ensures it does terrible damage to flesh and bone. This modification may be applied to melee weapons that use a cutting edge. \n\n[P][B]Models Include:[b] None.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Cutting Edge Melee"},"Price":50,"Rarity":1,"HP":1,"BaseMods":{"Mod":{"Key":"VICIOUS","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"SWC","Name":"Superior Weapon Customization","Description":"\n      [H3]Superior Weapon Customization[h3]\n\nEven the simplest weapon can benefit from a craftsman's touch. A skilled weaponsmith can tweak a weapon to its owner's exacting specifications, turning a blunt instrument into a honed and deadly weapon of war. \n\n[P][B]Models Include:[b] None.","Custom":"DescOnly","Type":"Weapon","Price":5000,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Key":"SUPERIOR"}},"Thumbnail":"img\/no_image.png"},{"Key":"SHB","Name":"Shortened Barrel","Description":"\n      [H3]Shortened Barrel[h3]\n\nShortened barrels are a handy modification used by spies, plain-clothes law enforcement officers, and anyone needing to conceal the fact that they are carrying a weapon. Little more than a replacement barrel shorter than the standard one, this attachment makes concealing a pistol easier, and can improve the speed of a quick draw. This attachment can only be applied to Ranged (Light) pistol weapons. \n\n[P][B]Models Include:[b] Arakyd SB4 \"Stubber\", SoroSuub SBSS Reduced Length Barrel.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Pistol"},"Price":250,"Rarity":4,"HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"\n          Reduces the difficulty of checks made to conceal\n          this weapon by 1.\n        "},{"Key":"RANGESUB","Count":1}]},"AddedMods":{"Mod":{"Key":"QUICKDR"}},"Thumbnail":"img\/no_image.png"},{"Key":"UBGL","Name":"Under-Barrel Grenade Launcher","Description":"\n      [H3]Under-Barrel Grenade Launcher[h3]\n\nUnder-barrel grenade launchers are designed to give soldiers or squads heavy anti-infantry or light anti-vehicle capabilities in a small package. This attachment consists of a basic, smooth-bore barrel attached to a magazine with an automatic feed system. It carries up to six grenades and is fired by a simple press of a button. It adds extra weight to the weapon it's mounted to, however, which makes the entire assembly quite barrel heavy. This attachment can only be applied to rifle-sized weapons (Ranged (Heavy) weapons). \n\n[P][B]Models Include:[b] Czerka \"Thumper\" Under-barrel Grenade Launcher, SoroSuub XA203 Auxiliary Grenade Launcher, Zone Control \"Viper\" Under-Barrel Grenade Launcher.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":["Rifle","Carbine"]},"Price":2000,"Rarity":5,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"\n          Weapon can fire grenades using the grenade profile, Ranged (Heavy) skill, and has Medium range.\n        "},{"Key":"CUMBERSOME","Count":2},{"Key":"ENCADD","Count":2},{"Key":"LIMITEDAMMO","Count":1}]},"AddedMods":{"Mod":{"Key":"LIMITEDAMMO","Count":5}},"Thumbnail":"img\/no_image.png"},{"Key":"UBFP","Name":"Under-Barrel Flame Projector","Description":"\n      [H3]Under-Barrel Flame Projector[h3]\n\nUncommon but highly effective, the Firestorm by Czerka is a small, under-barrel flame projector designed to give an infantryman extra punch at short range. Illegal on many worlds and classified as a terror weapon, these weapons are typically used by only the most desperate or callous individuals. This attachment can only be applied to rifle-sized weapons. \n\n[P][B]Models Include:[b] Czerka \"Firestorm\" Under-barrel Flame Projector, Merr-Sonn XR14 Sunsear Flame Projector, SoroSuub \"Inferno\" Auxiliary Flamer.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":["Rifle","Carbine"]},"Price":3000,"Rarity":4,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"\n          Adds a flame projector to the weapon.\n        "},{"Key":"CUMBERSOME","Count":1}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Flame Projector","SkillKey":"RANGHVY","Damage":10,"Crit":2,"Qualities":{"Quality":[{"Key":"BURN","Count":5},{"Key":"BLAST","Count":2}]},"RangeValue":"wrShort","Range":"Short"}},"Thumbnail":"img\/no_image.png"},{"Key":"TOS","Name":"Telescopic Optical Sight","Description":"\n      [H3]Telescopic Optical Sight[h3]\n\nPopular with marksmen and snipers, this attachment consists of a long tube attached to the top of a weapon with a number of precisely ground lens elements protected by an impact-resistant housing. The resulting scope magnifies distant images for long-range shooting. This attachment can be used on any ranged weapon (with the exception of one-use weapons like grenades, or weapons like flame projectors that would not realistically benefit from a sight). \n\n[P][B]Models Include:[b] Merr-Sonn 80Z Telescopic Optical Sight, Zikon Optics Model 40 Marksman Scope.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Ranged"},"Price":250,"Rarity":1,"HP":1,"BaseMods":{"Mod":{"Key":"DIFFSUBLONGEXT","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"TRIPOD","Name":"Tripod Mount","Description":"\n      [H3]Tripod Mount[h3]\n\nDesigned for use with the heaviest man-portable weapons, tripods are a common sight among heavy weapon squads. Used in static weapon emplacements to support heavy squad support weapons such as the Imperial Army's E-Web heavy repeating blaster, tripods use a number of different technologies—from self-extending hydraulics to tiny, low-output repulsorlift generators—to stabilize heavy weapons for firing. This attachment is only for use on light repeating blasters and heavy repeating blasters, as well as any portable Gunnery weapons. Setting up a tripod takes two preparation maneuvers. \n\n[P][B]Models Include:[b] BlasTech 3R Heavy Weapon Tripod Mount.","Custom":"DescOnly","Type":"Weapon","ItemLimit":{"Key":["BLASTLTREP","BLASTHVYREP"]},"CategoryLimit":{"Category":"Portable Gunnery"},"Price":100,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Key":"CUMBERSOME","Count":-2}},"AddedMods":{"Mod":{"Key":"CUMBERSOME","Count":-2}},"Thumbnail":"img\/no_image.png"},{"Key":"WEPSLING","Name":"Weapon Sling","Description":"\n      [H3]Weapon Sling[h3]\n\nSlings are lengths of hide or synthetic fabric designed to allow easy handling of long arms like blaster rifles and slugthrower rifles. They come in a dizzying array of styles, from the simple adjustable single-strap sling for carrying a weapon off the shoulder to multi-strap slings made of specialized materials that allow for any number of custom sling configurations. These attachments can only be used with Ranged (Heavy) weapons. \n\n[P][B]Models Include:[b] Custom-tooled Bantha hide sling, Tactical three-point sling, Quick-release one-point drop sling.","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":"RANGHVY"},"Price":100,"HP":1,"BaseMods":{"Mod":{"Key":"CUMBERSOME","Count":-1}},"AddedMods":{"Mod":{"Key":"QUICKDR"}},"Thumbnail":"img\/no_image.png"},{"Key":"WEPHARN","Name":"Weapon Harness","Description":"\n      [H3]Weapon Harness[h3]\n\nDesigned to allow a single sentient to field even the heaviest man-portable weapons with no support, weapon harnesses are rare among the Outer Rim territories. Worn over the shoulders and belted around the midsection or torso, weapon harnesses consist of a series of load-bearing straps and harnesses connected to a gyro-stabilized, power-assisted boom arm attached to a heavy weapon. Powered by a tiny rechargeable power pack, the harness offers its user enhanced stability and strength when using heavy weapons. This attachment can only be used with Ranged (Heavy) and Gunnery weapons. \n\n[P][B]Models Include:[b] Arakyd WW480 \"Goliath\" Weapon Harness, Galactic Arms HR12 Power Harness, SoroSuub \"Little Giant\" Heavy Weapon Power Assist.","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":["RANGHVY","GUNN"]},"Price":500,"Rarity":2,"HP":2,"BaseMods":{"Mod":{"Key":"CUMBERSOME","Count":-2}},"AddedMods":{"Mod":{"Key":"BRA","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"WEIGHTHEAD","Name":"Weighted Head","Description":"\n      [H3]Weighted Head[h3]\n\nWeapons designed to bludgeon foes to unconsciousness or death often benefit from extra weight added to the striking surface. This can be accomplished through using heavier materials in the construction, or just by adding metal bands or studs to the business end. Reinforced \"knuckles\" can be added to some brawling weapons for similar effect. This attachment can only be added to bludgeoning Melee or Brawl weapons. \n\n[P][B]Models Include:[b] None.","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":["Bludgeoning Melee","Bludgeoning Brawl"]},"Price":250,"Rarity":3,"HP":2,"BaseMods":{"Mod":{"Key":"DAMADD","Count":1}},"AddedMods":{"Mod":[{"Key":"DAMADD","Count":1},{"Key":"CONCUSSIVE","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"CW","Name":"Cortosis Weave","Description":"\n      [H3]Cortosis Weave[h3]\n\nAlthough uncommon and even considered archaic in this day and age, some armorers specially equip protective gear with an underlying weave of rare cortosis. This does tend to make the armor more resistant to being penetrated (especially by energy weapons), but the cost is seldom worth the result. \n\n[P][B]Models Include:[b] Numerous variants.","Custom":"DescOnly","Type":"Armor","Price":10000,"Rarity":8,"HP":2,"BaseMods":{"Mod":{"Key":"CORTOSIS"}},"Thumbnail":"img\/no_image.png"},{"Key":"TSS","Name":"Thermal Shielding System","Description":"\n      [H3]Thermal Shielding System[h3]\n\nUtilizing both active and passive cooling systems, along with an insulated body glove and special coatings on the armor plates, this attachment allows a wearer to withstand dangerously high temperatures. This thermal shielding is proof against open flames, molten rock and steel, intense heat, and even some forms of radiation. This attachment can be installed on any armor that covers the entire body and can be sealed. \n\n[P][B]Models Include:[b] Atlas Corp Model 451 Heat Exchanger, Min-Dal 3100 Firebrand Suit, Kaminoan Armorsmiths Thermal Shielding System.","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":"Sealed"},"Price":1000,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"\n          Reduces the difficulty of Resilience checks made\n          to resist the effects of fire and extreme heat by one.\n          Removes up to [SETBACK][SETBACK] added to checks\n          due to extreme heat or fire.\n        "}},"Thumbnail":"img\/no_image.png"},{"Key":"HEAT","Name":"Heating System","Description":"\n      [H3]Heating System[h3]\n\nLike thermal shielding, cold shielding is installed in armor to protect the wearer against dangerously low temperatures and frigid environments. Equipped with small, efficient heating elements and double-insulated against the cold, this attachment allows a wearer to survive in places where the ambient temperature can be dozens of degrees below freezing. Perhaps the most famous type of cold shielding is that built into the custom laminate armor worn by the Imperial Army's snowtroopers. This attachment can be installed on any armor that covers the entire body and can be sealed. \n\n[P][B]Models Include:[b] Atlas Corp DL87 \"Frostback\" Armor Enhancement, Min-Dal Model 00 Heating System.","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":"Sealed"},"Price":1000,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"\n          Reduces the difficulty of Resilience checks made\n          to resist the effects extreme cold by one.\n          Removes up to [SETBACK][SETBACK] added to checks\n          due to extreme cold.\n        "}},"Thumbnail":"img\/no_image.png"},{"Key":"EOS","Name":"Enhanced Optics Suite","Description":"\n      [H3]Enhanced Optics Suite[h3]\n\nBuilt into a helmet, this system provides an individual with a host of specialized optical and audio sensors. Each system is equipped with passive light amplification, thermal signature readers, ultrasound pickups, millimeter wave emitters, video capture, and common optical enhancements. This may be installed on any armor. \n\n[P][B]Models Include:[b] BioTech MULTI Enhanced Vision System, Atlas Corp Full-Spectrum Optical Enhancer, Neuro-Saav Anq-Y Enhanced Optics Suite.","Custom":"DescOnly","Type":"Armor","Price":1000,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"\n          Removes up to [SETBACK][SETBACK] added to all Perception,\n          Vigilance, and combat skill checks\n          due to darkness, smoke, or other environmental effects\n          that obscure vision.\n        "}},"AddedMods":{"Mod":{"Key":"VIGIL","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"SES","Name":"Strength Enhancing System","Description":"\n      [H3]Strength Enhancing System[h3]\n\nStrength enhancing systems easily converts a suit of full armor into a power-assisted suit. Composed of a matrix of electrically controlled myomer synthetic muscle fibers backed up with nano-hydraulics, the MSES increases a wearer's raw physical strength, allowing him to lift more and carry more for longer periods of time. This attachment can only be used with laminate armor or similar full-body hard armor suits. \n\n[P][B]Models Include:[b] Industrial Automaton Xr5 Power Assist, BioTech \"Brute Strength Enhancer, Atlas Corp Myomer Strength Enhancing System.","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":"Sealed"},"Price":5500,"Rarity":4,"HP":2,"BaseMods":{"Mod":{"Key":"BR","Count":1}},"AddedMods":{"Mod":[{"Key":"ATHL","Count":2},{"Key":"BRA","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"OCS","Name":"Optical Camouflage System","Description":"\n      [H3]Optical Camouflage System[h3]\n\nPopular with both military scouts and assassins, optical camouflage systems are a wonder of modern stealth technology. Using a series of phased array optical projectors combined with sound baffling equipment and thermal and radiation shielding, Merr-Sonn's \"Ghost\" OCS can render a wearer nearly invisible to the naked eye. The PAO projectors allow the wearer to blend in with his surroundings by mimicking them, similar to an animal with active camouflage abilities, and the different radiation shields hide the wearers body heat as well as any electromagnetic radiation from other sensors or communications gear. For all of its utility, however, this system is incredibly fragile and is not recommended for combat. This attachment can be equipped on any type of armor, but is nearly useless on laminate and plastoid heavy armor, which is often too bulky and loud to mask properly. \n\n[P][B]Models Include:[b] BioTech \"Flicker\" Displacement Field, Atlas Corp \"Smokescreen\" Stealth System, Merr-Sonn \"Ghost\" Optical Camouflage System.","Custom":"DescOnly","Type":"Armor","Price":5500,"Rarity":6,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"\n          Upgrades the ability of all Stealth\n          checks twice while wearing this armor.\n        ","DieModifiers":{"DieModifier":{"SkillKey":"STEAL","UpgradeAbilityCount":2}}}},"AddedMods":{"Mod":[{"Key":"MASSHAD","Count":1},{"Key":"STEAL","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"SACUST","Name":"Superior Armor Customization","Description":"\n      [H3]Superior Armor Customization[h3]\n\nAny piece of armor can benefit from retooling at the hands of a superior craftsman. A skilled armorsmith can add improved plastoid or even durasteel plating to increase the protection a piece of armor offers even as he decreases its weight and bulk. Of course, such delicate and exacting work can make the armor less customizable in other respects. \n\n[P][B]Models Include:[b] Numerous Variants.","Custom":"DescOnly","Type":"Armor","Price":5000,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Key":"SUPERIOR","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"VACUUM","Name":"Vacuum Sealed","Description":"\n      [H3]Vacuum Sealed[h3]\n\nFull body armor can be designed to be sealed against a vacuum, allowing the user to operate in space. This modification provides the armor with enough air and insulation to survive for up to 10 minutes, and obviously also protects against adverse atmospheric environments. This can only be applied to laminate or battle armor. \n\n[P][B]Models Include:[b] Numerous Variants.","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":"Sealed"},"Price":1000,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"MiscDesc":"\n          Allows the user to ignore the effects of\n          vacuum or poisonous atmospheric environments\n          for up to 10 minutes.\n        "}},"Thumbnail":"img\/no_image.png"},{"Key":"ECDA","Name":"Enhanced Carbon-Durasteel Armor","Description":"\n      [H3]Enhanced Carbon-Durasteel Armor[h3]\n\nProduced by numerous starship manufacturers, these armor plates are made from a complex lattice of carbon nanotubes embedded with spun threads of durasteel. Molecularly bonded to a ship's hull, they provide extra armor protection at the cost of a ship's maneuverability. This may be applied to all starships and vehicles. \n\n[P][B]Models Include:[b] Ferro-Magnesium Armor Plate, Cerro-Ablative Sheets.","Custom":"DescOnly","Type":"Vehicle","Price":2000,"Rarity":3,"HP":2,"BaseMods":{"Mod":[{"Key":"ARMORADD","Count":1},{"Key":"HANDLINGSUB","Count":1}]},"PriceSizeMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"ECMSUITE","Name":"Electronic Countermeasures Suite","Description":"\n      [H3]Electronic Countermeasures Suite[h3]\n\nDesigned to blind and deafen enemy ships, electronic countermeasures suites such as Fabritech 995 ECM system transmits a dense stream of white noise and junk data that fogs sensors and jams comms traffic within close range of the broadcasting ship. While this makes the broadcasting ship hard to see or hit, the energy required to run the ECM suite tends to put undue strain on the ship's electrical systems. Other systems have focused modes that can target specific ships at longer ranges. This may be applied to all starships and vehicles. \n\n[P][B]Models Include:[b] Fabritech 995 \"Stormcloud\" Electronic Countermeasures Suite, Miradyne 4x_Phantom Short-Range Sensor Jammer (starfighters only), KDY 220-SIG Tactical Combat Jammer (capital ships only).","Custom":"DescOnly","Type":"Vehicle","Price":3000,"Rarity":6,"HP":1,"BaseMods":{"Mod":[{"MiscDesc":"Blocks sensors within range, counting the ship's silhouette as one smaller when being fired upon."},{"MiscDesc":"Immediately notifies all ships in a star system or within 100 kilometers if planetside to the ship or vehicle's existence."}]},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"Increase difficulty by one with Guided quality"}},"Thumbnail":"img\/no_image.png"},{"Key":"HCC","Name":"Hydraulic Control Circuits","Description":"\n      [H3]Hydraulic Control Circuits[h3]\n\nHydraulic control circuits are a throwback to an earlier era of shipbuilding. Instead of using traditional conductive material pressed into composite wafer boards to transfer electromagnetic energy, HCCs use countless, near-microscopic transparisteel tubes full of highly conductive liquid metal similar in its composition to mercury. Held under pressure and regulated by a series of valves, this metal controls the flow of energy. Bulky, antiquated, and difficult to work with, these circuits do have an incredible resistance to the effects of ion weapons, a fact that has not gone unnoticed among spacers. This may be applied to non-fighter starships. \n\n[P][B]Models Include:[b] Corellian Engineering Hydraulic Control Circuits, Santhe\/Sienar Hardened Circuitry, Fabritech Insulated Circuitry. ","Custom":"DescOnly","Type":"Vehicle","CategoryLimit":{"Category":"Non-Fighter Starship"},"Price":1000,"HP":2,"BaseMods":{"Mod":[{"MiscDesc":"Half damage from weapons with Ion quality"},{"Key":"HANDLINGSUB","Count":1},{"Key":"SSTRAINSUB","Count":1}]},"AddedMods":{"Mod":[{"Count":1,"MiscDesc":"Defender chooses ship component affected"},{"Key":"SSTRAINADD","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"RSG","Name":"Reinforced Shield Generator","Description":"\n      [H3]Reinforced Shield Generator[h3]\n\nA good defense is crucial to keeping a starship operational in the rough and tumble space of the Outer Rim. P-K's AEGIS Shield Generators and other reinforced shield generators upgrade a ship's stock particle and ray shielding so as to make it stronger and to make the shields easier to manage. While the AEGIS improves only one defense zone at a time, further tinkering with these units has resulted in improved shield strength. This may be added to any ship or vehicle. \n\n[P][B]Models indude:[b] Phoah-Kingsmeyer 721a AEGIS Shield Generator, KDY 880 Palisade Shield Generator, Sienar SH-2\/a.Z Shield Reinforcement.","Custom":"DescOnly","Type":"Vehicle","Price":3800,"Rarity":5,"HP":2,"BaseMods":{"Mod":{"Key":"DEFZONEADD","Count":1}},"AddedMods":{"Mod":{"Key":"DEFZONEADD","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"SMUG","Name":"Smuggling Compartments","Description":"\n      [H3]Smuggling Compartments[h3]\n\nThese are concealed compartments installed in starships, especially freighters and transports, for the transportation of contraband. Used to hide goods and occasionally people from prying eyes, they are incredibly hard to spot. Common places for smuggling compartments are beneath deck plates, behind heavy equipment, or in a thousand other bolt-holes throughout a vessel. This may be added to any ship or vehicle with encumbrance capacity 25 or more. \n\n[P][B]Models Include:[b] None.","Sources":{"Source":["Edge of the Empire Core Rulebook","Force and Destiny Core Rulebook"]},"Custom":"DescOnly","Type":"Vehicle","Price":1200,"Rarity":1,"Restricted":"true","HP":1,"BaseMods":{"Mod":{"Key":"SMUGENC","Count":1}},"AddedMods":{"Mod":{"Key":"SMUGENC","Count":2}},"MinEncumCap":25,"Thumbnail":"img\/no_image.png"},{"Key":"HANGAR","Name":"Retrofitted Hangar Bay","Description":"\n      [H3]Retrofitted Hangar Bay[h3]\n\nSome starships or vehicles can be converted to carry additional, smaller vehicles within retrofitted holds. May only be used by ships of silhouette 5 and larger. \n\n[P][B]Models Include:[b] None.","Custom":"DescOnly","Type":"Vehicle","Price":5000,"Rarity":3,"HP":2,"BaseMods":{"Mod":{"Key":"HANGER","Count":1}},"AddedMods":{"Mod":{"Key":"HANGERSIZE","Count":5}},"MinSize":5,"PriceSizeMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"HYPERDRIVE","Name":"Hyperdrive Generator","Description":"\n      [H3]Hyperdrive Generator[h3]\n\nUpgraded hyperdrive generators increase a vessel's speed through hyperspace, allowing it to complete journeys in a fraction of the time. May be installed on any ship with hyperdrive. \n\n[P][B]Models Include:[b] Isu-Sim SSPO5 Hyperdrive Generator, SFS S\/ig-30 Hyperdrive System, KDY JumpStar Hyperdrive Generator.","Custom":"DescOnly","Type":"Vehicle","Price":6400,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Key":"HYPERDRIVESUB","Count":1}},"AddedMods":{"Mod":{"Key":"HYPERDRIVESUB5","Count":2}},"MustHaveHyperdrive":"true","Thumbnail":"img\/no_image.png"},{"Key":"IONTURBINE","Name":"High-Output Ion Turbine","Description":"\n      [H3]High-Output Ion Turbine[h3]\n\nA fast, powerful sublight engine, high output ion turbines increase a ship's raw, straight-line speed at the cost of slightly lower reliability. May be installed on any a irspeeder or starship. \n\n[P][B]Models Include:[b] Girodyne Ter40 High-Output Ion Turbine, Sienar Fleet Systems SFS-220 Ion Drives, Koensayr Manufacturing R800 Ion Ramjet.","Custom":"DescOnly","Type":"Vehicle","Price":5300,"Rarity":5,"HP":1,"BaseMods":{"Mod":[{"Key":"SPEEDADD","Count":1},{"Key":"SSTRAINSUB","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"ATA","Name":"Advanced Targeting Array","Description":"\n      [H3]Advanced Targeting Array[h3]\n\nThe Sureshot Advanced Targeting Array by Taim Bak is a good example of a targeting computer, using sophisticated holo-imaging to present a pilot or gunner a detailed, three-dimensional view of his target. Installation of the ATA increases the accuracy of a ship's weapons, and allows gunners to get more shots on target, increasing their effectiveness in combat. This may be applied to all starships and vehicles. \n\n[P][B]Models Include:[b] Taim & Bak LR-375a \"Sureshot\" Advanced Targeting Array, Fabritech KR-770 \"Sharpshooter Targeting Computer, Koensayr Manufacturing 840.z Holo-Targeting Suite, Fabritech ANx 42.a \"Snapshot\" Targeting Computer.","Custom":"DescOnly","Type":"Vehicle","Price":4000,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Key":"UPGUNN","Count":1}},"AddedMods":{"Mod":[{"Key":"UPGUNN","Count":1},{"Key":"SNIPSHOT","Count":1},{"Key":"TRUEAIM","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"JURYRIGGEDA","Name":"Jury Rigged (Armor)","Description":"\n      [H3]Jury Rigged (Armor)[h3]\n\nThe character chooses one personal weapon or piece of armor per rank of Jury Rigged. He may increase the damage of the weapon by one; decrease the Advantage cost on its Critical, or any single other effect by one to a minimum of one; or increase armor's ranged or melee defense by one. Alternatively, he can decrease the encumbrance of the item by two to a minimum of one. The bonus only applies so long as the character is using the item. If the item is ever loss or destroyed, the character may apply Jury Rigged to a new personal weapon or piece or armor.","Custom":"DescOnly","Type":"Armor","JuryRigged":"true","AddedMods":{"Mod":[{"Key":"MELEEDEFADD","Count":1},{"Key":"RANGEDEFADD","Count":1},{"Key":"ENCSUB2","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"JURYRIGGEDW","Name":"Jury Rigged (Weapon)","Description":"\n      [H3]Jury Rigged (Weapon)[h3]\n\nThe character chooses one personal weapon or piece of armor per rank of Jury Rigged. He may increase the damage of the weapon by one; decrease the Advantage cost on its Critical, or any single other effect by one to a minimum of one; or increase armor's ranged or melee defense by one. Alternatively, he can decrease the encumbrance of the item by two to a minimum of one. The bonus only applies so long as the character is using the item. If the item is ever loss or destroyed, the character may apply Jury Rigged to a new personal weapon or piece or armor.","Custom":"DescOnly","Type":"Weapon","JuryRigged":"true","AddedMods":{"Mod":[{"Key":"DAMADD","Count":1},{"Key":"CRITSUB","Count":1},{"Key":"ENCSUB2","Count":1},{"Key":"QUALADVSUB","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"ANQ36","Name":"ANQ 3.6 Tracking Computer","Description":"\n      [H3]ANQ 3.6 Tracking Computer[h3]\n\nThe Anq 3.6 is a computer\/fire control system that allows the Pathfinder's sensor operator to coordinate fire amongst all ship weapons. The sensor operator must designate one target and make an [B]Average ([DI][DI]) Computers check[b]. If he succeeds, all combat checks made by ship weapons against his designated target upgrade the ability of their check once. If he has [SU][SU][SU] or [TR] on his check, he may designate an additional target.","Source":"Enter the Unknown","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"A36PTHFNDR"},"Price":7500,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"\n          Choose one target and make [B]Average ([DI][DI]) Computers check[b].  If successful, combat checks against target are upgraded once. [SU][SU][SU] or [TR] allows additional target.\n        "}},"Thumbnail":"img\/no_image.png"},{"Key":"MODBKACCPOUCH","Name":"Modular Backpack Accessory Pouch","Description":"\n      [H3]Modular Backpack Accessory Pouch[h3]\n\nThe Mk. IV Modular Backpack increases the user's encumbrance threshold by 3, plus an additional 1 point of encumbrance threshold for each accessory pouch to a maximum of 3.","Source":"Enter the Unknown","Custom":"DescOnly","Type":"Gear","ItemLimit":{"Key":"MODPACK"},"Price":15,"ModPrice":15,"HP":1,"BaseMods":{"Mod":{"Key":"ENCTADD","Count":1}},"AddedMods":{"Mod":{"Key":"ENCTADD","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"ENGACCESS","Name":"Engineering Access","Description":"\n      [H3]Engineering Access[h3]\n\nOne of the Explorers more intelligent design features is the network of sub-deck access passages. Granting easy access to nearly any internal system on the ship, the cramped passages allow the engineer to respond quickly to problems. Anyone working on the internal systems of the E-9 Explorer-class vessels, such as the power system, hyperdrive, computers, sensors, etcetera, gains [BO] to any Mechanics or Computers skill checks thanks to the ease of reaching systems that are typically hidden behind bulkheads and sealed beneath deck plates.","Source":"Enter the Unknown","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"LORONARE9"},"Price":7500,"Rarity":6,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"\n          Anyone working on internal systems, such as power systems, hyperdrive, computers, sensors, gain [BOOST] to Mechanics and Computer checks due to the ease of reaching such typically hidden systems.\n        "}},"Thumbnail":"img\/no_image.png"},{"Key":"M77TRANQ","Name":"SmartTranq","Description":"\n      [H3]SmartTranq[h3]\n\nDeveloped in cooperation with CorChemCo, SmartTranq is an adaptable synthetic tranquilizer designed to be used with the Model 77 Air Rifle. When the tranquilizer enters the bloodstream of a target, it immediately begins to mutate, changing constantly and reconfiguring itself to find the quickest, most efficient way to overwhelm the target's defensive systems and render it unconscious. \n\n[P]Upon a successful hit with the Model 77, the target must immediately make an [B]Average ([DI][DI]) Resilience check[b]. If the target fails, it suffers 5 strain, plus 2 additional strain per [TH] generated on the check. If the check generates [DE], the GM can spend it to make the target check against the tranquilizer again during the next round. If the GM does so, increase the difficulty of the check by one. \n\n[P]Equipping the Model 77 with SmartTranq costs 500 credits. This does not change the weapon's profile—it simply adds the above special rule to the weapon. If the weapon ever runs out of ammo, the user must purchase a reload (also costing 500 credits) before using the SmartTranq again.","Source":"Enter the Unknown","Custom":"DescOnly","Type":"Weapon","ItemLimit":{"Key":"MODEL77"},"Price":500,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Upon hit, target must make [B]Average ([DIFFICULTY][DIFFICULTY]) Resilience check[b].  If fail, target takes 5 strain, plus 2 strain per [THREAT].  GM may use [DESPAIR] to make target check again next round at increased difficulty."}},"Thumbnail":"img\/no_image.png"},{"Key":"PTA","Name":"Predictive Targeting Array","Description":"\n      [H3]Predictive Targeting Array[h3]\n\nWhen making an auto-fire attack with the ship's auto-blasters, do not increase the difficulty of the attack by one.","Source":"Suns of Fortune","Custom":"DescOnly","Type":"Vehicle","Price":2000,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"MiscDesc":"\n          When making auto-fire attack, do not increase difficulty by 1.\n        "}},"Thumbnail":"img\/no_image.png"},{"Key":"OEWM","Name":"Oversized External Weapons Mount","Description":"\n      [H3]Oversized External Weapons Mount[h3]\n\nThe search for ever-increasing firepower often leads to the installation of weapons systems larger than were intended for a given vehicle. The oversized weapons mount is a custom-built rack enabling the vehicle to carry a weapon meant for one silhouette larger than the vehicle itself. However, the CM is the final arbiter of feasibility of such designs and may impose additional penalties for the weapon's use.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","Price":3000,"Rarity":6,"HP":2,"BaseMods":{"Mod":[{"Key":"ADDSILWEAP","Count":1},{"Key":"HANDLINGSUB","Count":1},{"Key":"SSTRAINSUB","Count":4}]},"PriceSizeMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"BOARDTUBE","Name":"T9 Stinger Assault Boarding Tube","Description":"\n      [H3]T9 Stinger Assault Boarding Tube[h3]\n\nPairing a docking tube with a powerful cutting system, the assault boarding tube is an indispensable tool for armed boarding actions. Its legitimate uses include aggressive customs enforcement and naval boarding actions. However, pirates also use the technology to force their way aboard a stricken ship. Pirate mechanisms are often custom-built, as obtaining a manufactured assault boarding tube is difficult for non-governmental entities. This mechanism may be installed on a craft of silhouette 3 or larger.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","Price":1000,"Rarity":4,"Restricted":"true","HP":3,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"May cut a hole in a docked craft's hull or airlock."}},"AddedMods":{"Mod":{"Key":"BOARDTUBETIME","Count":4}},"PriceSizeMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"FOGGEN","Name":"Fogger Smoke Generator","Description":"\n      [H3]Fogger Smoke Generator[h3]\n\nA smoke generator creates thick black or grey smoke that inhibits line of sight. This may only be installed on ground vehicles, landspeeders, or airspeeders, and only works on planets with an atmosphere.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","CategoryLimit":{"Category":["Air Vehicle","Land Vehicle","Tracked Vehicle","Walker","Wheeled Vehicle"]},"Price":2750,"Rarity":2,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Provides concealment that adds [SETBACK][SETBACK][SETBACK]."}},"Thumbnail":"img\/no_image.png"},{"Key":"GENELOCK","Name":"Gene Lock","Description":"\n      [H3]Gene Lock[h3]\n\nSome sentients form a great attachment, even a bond with their weapon, and take steps to ensure that no other can use it. For this, or for more practical reasons, some individuals have their weapon modified so that it only functions in their hands. This is accomplished through a gene-lock: a system- featuring a computer that, once loaded with the user's genetic code, samples and scans the DNA of any individual who picks up the weapon. If his genetic profile does not match the weapon's designated user, the computer locks down the weapon and prevents it from firing. \n\n[P]This upgrade is most relevant for ranged weapons, but it is possible to gene-lock a vibroblade or similar weapon. In this case, an unauthorized user can still wield the weapon as a basic sword, etc., but any technological components such as a vibro-motor cease to function. This attachment can be applied to any handheld weapon.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Weapon","Price":500,"Rarity":7,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Weapon functions only in the hands of its authorized user."}},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"Self-Destruct.  Inflicts one critical hit if unauthorized user tries to use locked weapon.  Weapon is destroyed."}},"Thumbnail":"img\/no_image.png"},{"Key":"LASERSIGHT","Name":"\"Bantha's Eye\" Laser Sight","Description":"\n      [H3]\"Bantha's Eye\" Laser Sight[h3]\n\nAn extremely simple gun sight, a laser sight emits a low-power light beam to place a visible \"dot\" that marks the weapon's precise target. A laser sight can help even an amateur shooter hit a target. One drawback to this upgrade is that the laser can alert an otherwise unaware target to the shooter. For these reasons, laser sights are rarely used by sharpshooters and snipers. This attachment can be used with any Ranged (Light) or Ranged (Heavy) weapon that do not possess the Blast quality.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":["RANGHVY","RANGLT"]},"Price":500,"Rarity":5,"HP":1,"BaseMods":{"Mod":{"Key":"ADVADD","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"PISTOLGRIP","Name":"H9 Pistol Grip","Description":"\n      [H3]H9 Pistol Grip[h3]\n\nA pistol grip replaces the stock or other grip on a long arm with one like that of a pistol, allowing it to be fired one-handed. Most blaster rifles feature a pistol-like grip by default, in which case this attachment makes additional modifications to make the weapon better-suited to one-handed use. This attachment can be used with any Ranged (Heavy) blaster rifle, blaster carbine, or slugthrower that does not possess the Cumbersome quality.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Non-Heavy Rifle"},"Price":400,"Rarity":3,"HP":1,"BaseMods":{"Mod":[{"Key":"USERANGLT","Count":1},{"Count":1,"MiscDesc":"Add [SETBACK] to any combat check made when firing one-handed."},{"Key":"RANGEREDMED","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"MISSILESYS","Name":"\"Final Word\" Secondary Missile System","Description":"\n      [H3]\"Final Word\" Secondary Missile System[h3]\n\nThis uncommon attachment provides the user with the option for a single explosive attack, useful either as a last resort or as an opening salvo. The attachment holds a single rocket. This attachment can be used with any rifle that uses the Ranged (Heavy) skill.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Rifle"},"Price":3000,"Rarity":6,"HP":3,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Enables weapon to fire rockets, using missile's profile."},{"Key":"CUMBERSOME","Count":3},{"Key":"ENCADD","Count":3}]},"Thumbnail":"img\/no_image.png"},{"Key":"WRISTMOUNT","Name":"Model 2 Wrist Mount","Description":"\n      [H3]Model 2 Wrist Mount[h3]\n\nOriginally developed to allow species without opposable thumbs to use pistols, a wrist mount ensures that the user always has a weapon ready while keeping his hands free. Many users choose wrist mounts as a way to pack further firepower, while it is simply an aesthetic choice for some. Wrist-mounted weapons can be fired with a pressure-sensitive palm trigger, a particular wrist motion, or even by neural link. This attachment can be applied to any Ranged (Light) weapon.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Pistol"},"Price":275,"Rarity":5,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Weapon can be worn on the wrist, freeing user's hands."}},"Thumbnail":"img\/no_image.png"},{"Key":"INTMEDSYS","Name":"SmartMed 2000 Integrated Med-Systems","Description":"\n      [H3]SmartMed 2000 Integrated Med-Systems[h3]\n\nFor some, it is not enough for their armor to simply prevent injury—it must lessen the effects of those wounds they do suffer. Integrated med-systems range from automated stim-injectors to sophisticated medical computers and full-body bacta baths. Though they can never replace a doctor or medical droid, these med-systems can keep the user alive long enough to get proper treatment, or to continue fighting despite his wounds. This attachment can be added to any armor that covers the majority of the wearer's body, subject to the GM's discretion.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Armor","Price":2500,"Rarity":7,"HP":2,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Once per session, may apply stimpack as incidental."},{"Count":1,"MiscDesc":"All Medicine checks made to heal wearer gain [BOOST]."},{"Key":"ENCADD","Count":1}]},"AddedMods":{"Mod":{"Key":"HEALPLUSONE","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"HANDSFREEWEAP","Name":"VX Hands-Free Weapon","Description":"\n      [H3]VX Hands-Free Weapon[h3]\n\nBy modifying his armor to mount one or more weapons, a spacer can keep his hands free for whatever unexpected needs might arise in combat—or just to carry more weapons. While few weapons are intended for such use, most can be modified to mount on a properly-equipped suit of armor. The difficult part is modifying the weapon so that it can be aimed and fired hands-free. Methods range from voice-activation to a pressure-sensitive glove activated by certain hand movements to a direct neural link. Such systems almost always incorporate a sophisticated targeting computer or retinal tracking mechanism. The most common location for the weapon mount is on the shoulder, though other areas are possible. \n\n[P]A weapon must also be modified in order to be armor-mounted, requiring one hard point. This attachment can mount any Ranged (Light) or Ranged (Heavy) weapon with an Encumbrance of 4 or less, subject to the GM's discretion.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Armor","Price":1000,"Rarity":6,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Mounts single weapon on armor.  User can aim and fire without using his hands.  Use \"Notes\" feature to specify which weapon is mounted."}},"Thumbnail":"img\/no_image.png"},{"Key":"MULTICOMLINK","Name":"Multi-Band Comlink","Description":"\n      [H3]Multi-Band Comlink[h3]\n\nIt is common practice to incorporate a long-range comlink into a helmet. Many military or otherwise advanced helmets include a comlink as standard, and it is a fairly simple procedure to attach one to nearly any helmet. Some helmet comlinks are activated by tapping a button on the exterior of the helmet or somewhere else on the armor, while others are activated by voice or even a particular head motion.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Armor","Price":200,"Rarity":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"A long range comlink is integrated into helmet."}},"Thumbnail":"img\/no_image.png"},{"Key":"INTSCAN","Name":"OmniScan 3 Integrated Scanner","Description":"\n      [H3]OmniScan 3 Integrated Scanner[h3]\n\nWarriors must be aware of their surroundings at all times, and ready to respond to any threat. Because a hand-held scanner both requires the user to direct his attention to it and restricts his weapon use, it is common for military forces to integrate scanner systems into helmets. As usual, many Hired Guns follow suit, particularly those with a military background. Most integrated scanner systems utilize a heads-up display, projected on the inside of the helmet's visor. Some systems include a retractable mono-visor that extends only while the scanner is in use.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Armor","Price":1000,"Rarity":4,"HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Built-in general purpose scanner"},{"Count":1,"MiscDesc":"Adds [BOOST] to Perception checks to detect movement or hidden enemies."}]},"AddedMods":{"Mod":{"Key":"PERC","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"RANGEFIND","Name":"MB-7 \"Ranger\" Range Finder","Description":"\n      [H3]MB-7 \"Ranger\" Range Finder[h3]\n\nA system incorporating a simple computer and visual sensors, a range finder calculates the distance to any spot in the user's field of vision, feeding him precise information to a visor HUD. With this information, the wearer can push his weapon to its limits, while knowing when to hold his fire on an impossible shot. The most sophisticated systems interface directly with the user's weapon for increased effect.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Armor","Price":1500,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Key":"SNIPSHOT","Count":1}},"AddedMods":{"Mod":{"Key":"SNIPSHOT","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"TARGCOMP","Name":"\"Accu-Strike\" Integrated Targeting Computer","Description":"\n      [H3]\"Accu-Strike\" Integrated Targeting Computer[h3]\n\nComplex and sophisticated attachments, targeting systems integrate an advanced targeting computer and sensor suite, providing a constant stream of data to the user. Depending on the model, this information may be delivered by audio or on a visor HUD. Some particularly advanced systems incorporate small vibro-motors installed in the armor's gloves or gauntlets and wired to the helmet system, which subtly adjust the user's hands to enhance accuracy.","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Armor","Price":3000,"Rarity":7,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Add [BOOST] to all Ranged attacks at long or extreme range."}},"AddedMods":{"Mod":{"Key":"NATMAR"}},"Thumbnail":"img\/no_image.png"},{"Key":"REPENH","Name":"Repulsorlift Enhancement","Description":"\n      [H3]Repulsorlift Enhancement[h3]\n\nA repulsorlift enhancement increases the output of a standard airspeeder's repulsorlift engine considerably. Vehicles with this upgrade deplete their fuel cells at a dramatically increased rate. Since most races are relatively short in duration, and those that are longer have the opportunity to use a pit crew to recharge their cells, this makes them an extremely popular choice with most racing teams. Installing this attatchment requires an [B]Average ([DI][DI]) Mechanics check[b]. Repulsor enhancements may only be attatched to vehicles of silhoutte 2 or lower.\n\n[P][B]Models Include:[b] None.","Source":"Jewel of Yavin","Custom":"DescOnly","Type":"Vehicle","Price":2500,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"As a maneuver, suffer 1 system strain to add +1 maximum speed for one round."}},"MaxSize":2,"Thumbnail":"img\/no_image.png"},{"Key":"UPGFIRE","Name":"Upgraded Firepower","Description":"\n      [H3]Upgraded Firepower[h3]\n\nA very common practice on starships and in more violent, less reputable races, upgraded weapons are actually something of a liability in the Cloud City Grand Prix. Given that the destruction of enemy vessels is strictly prohibited, overly powerful weapons can result not only in disqualification but prosecution as well. Installing this attachment requires a [B]Hard ([DI][DI][DI]) Mechanics check[b]. This upgrade may only be attached to vehicles of silhouette 2 or lower.\n\n[P][B]Models Include:[b] None.","Source":"Jewel of Yavin","Custom":"DescOnly","Type":"Vehicle","Price":1000,"BaseMods":{"Mod":{"Key":"DAMWEAPSYSADD","Count":1}},"MaxSize":2,"Thumbnail":"img\/no_image.png"},{"Key":"AUGBUFF","Name":"Augmented Buffer","Description":"\n      [H3]Augmented Buffer[h3]\n\nThis uncommon upgrade installs redundant systems within the electronics of an airspeeder, allowing it to be pushed beyond standard limits without risk of overload. Most teams find it simpler to replace any damaged components between races, ensuring that a pilot has fresh equipment for each race, rather than risk over-complicating the vehicle's systems. Augmented buffer may only be attached to vehicles of silhouette 2 or lower. \n\n[P][B]Models Include:[b] None.","Source":"Jewel of Yavin","Custom":"DescOnly","Type":"Vehicle","Price":750,"Rarity":6,"BaseMods":{"Mod":{"Key":"SSTRAINADD","Count":1}},"AddedMods":{"Mod":{"Key":"SSTRAINADD","Count":2}},"MaxSize":2,"Thumbnail":"img\/no_image.png"},{"Key":"MANTHRUST","Name":"Maneuvering Thrusters","Description":"\n      [H3]Maneuvering Thrusters[h3]\n\nSmall thrusters attached to the exterior chassis of a vehicle increase how responsive it is during flight. The application of these varies considerably, from the crude strapping of rocket or jet packs to the outside of a vehicle to the careful addition of a completely separate fuel line to grant extended use. Maneuvering thrusters may only be attached to vehicles of silhouette 2 or lower. \n\n[P][B]Models Include:[b] Arakyd Aerodrive Thruster Augmentation System, SoroSuub CornerTech Maneuvering Thruster.","Source":"Jewel of Yavin","Custom":"DescOnly","Type":"Vehicle","Price":500,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Key":"HANDLINGADD","Count":1}},"MaxSize":2,"PriceSizeMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"POISONRES","Name":"Poison Reservoir","Description":"[H3]Poison Reservoir[h3]\n\nMany assassins who use melee weapons choose to improve the lethality of their blades by adding a poison reservoir that releases a toxin through a channel in the blade at the push of a button in the hilt. While dipping a weapon in poison can be somewhat effective, a reservoir is a much more efficient delivery method. This attachment can only be used with Brawl and Melee weapons. \n\n[P][B]Models Include:[b] Numerous variants.","Source":"Lords of Nal Hutta","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":["Brawling","Melee"]},"Price":400,"Rarity":5,"Restricted":"true","HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Allows user to store one dose of neurotoxin, anesthetic, neuroparalytic, or similar toxins."}},"AddedMods":{"Mod":{"Key":"RESDOSE","Count":4}},"Thumbnail":"img\/no_image.png"},{"Key":"THREATMON","Name":"Threat Monitor","Description":"\n      [H3]Threat Monitor[h3]\n\nA threat monitor is a suite of motion detectors, electroreceptors, and photoreceptors that constantly monitors the armor wearer's vicinity and, through direc-tional auditory or electrical cues, warns the wearer of imminent threats and incoming attacks. While many find threat monitors somewhat annoying to wear, they can provide a critical edge in life-or-death situations. This attachment can only be used on armor and is typically integrated into the helmet, visor, or another place where the user can easily see it at all times. \n\n[P][B]Models Include:[b] Atlas Corp Pan-directional Alert Scanner, Galactic Electronics Z-12 Threat Assessor.","Source":"Lords of Nal Hutta","Custom":"DescOnly","Type":"Armor","Price":750,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Key":"ADVADDINIT","Count":1}},"AddedMods":{"Mod":[{"Key":"QUICKST","Count":1},{"Key":"ADVADDINIT","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"BLASTSUPP","Name":"Blaster Suppressor","Description":"\n      [H3]Blaster Suppressor[h3]\n\nThough generally not as loud as slugthrowers, blasters usually emit an audible crack or zap upon being fired. While military scouts and snipers are usually more concerned that a blaster bolt flash might give away their position or disrupt their night vision, those who operate in the galactic underworld often find the report of a blaster to be more troublesome. In order to address this issue, several arms manufacturers produce sound suppressors for a blaster muzzle, making the blaster virtually silent. This attachment can only be used with blaster pistols. \n\n[P][B]Models Include:[b] Merr-Sohn DS9 Blast Suppressor, Czerka \"Whispershot\" Silencer.","Source":"Lords of Nal Hutta","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Blaster Pistol"},"Price":750,"Rarity":5,"Restricted":"true","HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Adds [SETBACK][SETBACK] to Perception or Vigilance checks made to locate a concealed shooter firing silenced blaster."}},"Thumbnail":"img\/no_image.png"},{"Key":"SWOOPSPEED","Name":"Swoop Speed Modification","Description":"\n      [H3]Swoop Speed Modification[h3]\n\nBoosts the engines of a swoop and also removes excess weight from the chassis.\n    ","Source":"Suns of Fortune","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Swoop"},"Price":1200,"Rarity":2,"HP":2,"BaseMods":{"Mod":[{"Key":"SPEEDADD","Count":1},{"Key":"HULLSUB","Count":1}]},"AddedMods":{"Mod":{"Key":"SSTRAINADD","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"OVRCHARGEV","Name":"Overcharge Valve","Description":"\n      [H3]Overcharge Valve[h3]\n\nAn overcharge valve is a simple (if dangerous) modification that allows the wielder of a blaster to discharge the entire ammunition reserve in a single, devastating shot. This attachment can be applied to any blaster or energy weapon that could logically benefit from it. \n\n[P][B]Models Include:[b] Czerka \"One-Shot\" Overcharge Valve.","Source":"Fly Casual","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Energy Weapon"},"Price":1500,"Rarity":6,"Restricted":"true","HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"As incidental, weapon gains Prepare 1 quality and +4 damage for next attack.  After firing, weapon runs out of ammo."}},"Thumbnail":"img\/no_image.png"},{"Key":"PAIREDW","Name":"Paired Weapons","Description":"\n      [H3]Paired Weapons[h3]\n\nMany Gunslingers wield a pistol in each hand, and some flashy pirates and other scoundrels even prefer to pair a blade with a pistol. This weapon modification balances a pair of weapons, allowing the wielder to use them in perfect tandem. This attachment can only be applied to one-handed weapons. \n\n[P][B]Models Include:[b] Custom variants. ","Source":"Fly Casual","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":["BRAWL","LTSABER","MELEE","RANGLT"]},"Price":300,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Reduce [AD] required to hit with second weapon when two-weapon fighting by 1."}},"Thumbnail":"img\/no_image.png"},{"Key":"SETTRIGGER","Name":"Set Trigger","Description":"\n      [H3]Set Trigger[h3]\n\nCommonly known as a \"hair-trigger,\" this weapon retooling allows a blaster or slugthrower to fire with barely a touch of the trigger. This attachment can be applied to any Ranged (Light) or Ranged (Heavy) weapon. \n\n[P][B]Models Include:[b] Custom variants.","Source":"Fly Casual","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":["RANGHVY","RANGLT"]},"Price":450,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Automatic [SU][TH] to the first combat check made with this weapon each encounter."}},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"Adds [SU] to the first combat check made with this weapon each encounter"}},"Thumbnail":"img\/no_image.png"},{"Key":"UNDERSCATTER","Name":"Underslung Scattergun","Description":"\n      [H3]Underslung Scattergun[h3]\n\nAn ungainly attachment, an underslung scattergun is a single-shot slugthrower that can be attached to another weapon. While hardly what one would call subtle, it nonetheless has found a ready market amongst some bounty hunters and gunslingers due to its low cost and impressive effect. This attachment can only applied to pistol and rifle-sized weapons. \n\n[P][B]Models Include:[b] Czerka \"Leveller\" Under-barrel Scattergun, Merr-Sonn XZ03 Scattershell Slugthrower Attachment, Goseia Heavy Industries Concern \"Troubleshooter\" Underslung Slugthrower.","Source":"Fly Casual","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":["Pistol","Rifle"]},"Price":750,"Rarity":5,"Restricted":"true","HP":3,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Adds a scattergun to the weapon."},{"Key":"CUMBERSOME","Count":1}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Scattergun","SkillKey":"RANGHVY","Damage":6,"Crit":2,"Qualities":{"Quality":[{"Key":"BLAST","Count":5},{"Key":"KNOCKDOWN"},{"Key":"LIMITEDAMMO","Count":1}]},"RangeValue":"wrShort","Range":"Short"}},"Thumbnail":"img\/no_image.png"},{"Key":"ASTROBRAIN","Name":"Astrogation Droid Brain","Description":"\n      [H3]Astrogation Droid Brain[h3]\n\nTo accompany its autopilot droid brain, Go-Corp has rolled out the CD-13z, an astrogation droid brain. Essentially an astromech installed directly into the ship's hull, the CD-13z can perform astrogation calculations on its own, but it is most useful for assisting in a pilot or navigator's own calculations. Despite their common origins, CD-13z droid brains are known to bicker with CD-12a autopilot droid brains when both are installed on the same vessel. \n\n[P][B]Models Include:[b] Go-Corp CD-13z astrogator droid brain.","Source":"Fly Casual","Custom":"DescOnly","Type":"Vehicle","CategoryLimit":{"Category":"Starship"},"Price":7500,"Rarity":6,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Adds a Droid Brain with Astrogation Skill 2 and Intellect 0","InnateSkills":{"InnateSkill":{"SkillKey":"ASTRO","SkillRank":2}}}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Increase Droid Brain's Astrogation Skill by 1","InnateSkills":{"InnateSkill":{"SkillKey":"ASTRO","SkillRank":1}}}},"Thumbnail":"img\/no_image.png"},{"Key":"PILOTBRAIN","Name":"Autopilot Droid Brain","Description":"\n      [H3]Autopilot Droid Brain[h3]\n\nMore advanced and sophisticated than standard autopilot systems, a specialized autopilot droid brain has become a popular upgrade among smugglers and others. Capable of piloting a vehicle or ship with reasonable competence, autopilot droid brains can be communicated with remotely via a beckon call, allowing the user to summon the vehicle or ship from up to several hundred kilometers away. \n\n[P][B]Models Include:[b] Go-Corp CD-12a autopilot droid brain.","Source":"Fly Casual","Custom":"DescOnly","Type":"Vehicle","Price":7500,"Rarity":6,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Adds a Droid Brain with Piloting Skills 2 and Intellect 0","InnateSkills":{"InnateSkill":[{"SkillKey":"PILOTPL","SkillRank":2},{"SkillKey":"PILOTSP","SkillRank":2}]}},{"Count":1,"MiscDesc":"May summon vehicle via a beacon call."}]},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Increase Droid Brain's Piloting Skills by 1","InnateSkills":{"InnateSkill":[{"SkillKey":"PILOTPL","SkillRank":1},{"SkillKey":"PILOTSP","SkillRank":1}]}}},"Thumbnail":"img\/no_image.png"},{"Key":"AX108BUZZER","Name":"AX-108 \"Ground Buzzer\" Surface-Defense Blaster Cannon","Description":"[H3]AX-108 \"Ground Buzzer\" Surface-Defense Blaster Cannon[h3]\n\nDesigned to provide anti-personnel defense for a starship when on the ground, BlasTech's Ax-108 \"Ground Buzzer' is a popular modification on ships whose owners expect trouble. With a powerful blast and high rate of fire, the retractable Ax-108 folds into a hidden compartment on a vessel's hull. While the weapon can be manually operated from the cockpit, it can also be remotely activated. \n\n[P][B]Models Include:[b] BlasTech Ax-108 \"Ground Buzzer\" surface-defense blaster cannon. ","Source":"Fly Casual","Custom":"DescOnly","Type":"Vehicle","Price":2000,"Rarity":5,"HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Adds one AX-108 Surface Defense Blaster Cannon weapon"},{"Count":1,"MiscDesc":"Can fire automatically with a Ranged (Heavy) skill of 2 and an Agility of 0","InnateSkills":{"InnateSkill":{"SkillKey":"RANGHVY","SkillRank":2}}}]},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Increase the weapon's automated Ranged (Heavy) skill by one","InnateSkills":{"InnateSkill":{"SkillKey":"RANGHVY","SkillRank":1}}}},"MustBeStarship":"true","MinSize":3,"MaxSize":10,"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Surface-Defense Blaster Cannon","SkillKey":"RANGHVY","Damage":12,"Crit":3,"Qualities":{"Quality":[{"Key":"AUTOFIRE"},{"Key":"PIERCE","Count":2}]},"RangeValue":"wrMedium","Range":"Medium"}},"Thumbnail":"img\/no_image.png"},{"Key":"CLOAKSMUGG","Name":"Cloaked Smuggling Compartments","Description":"\n      [H3]Cloaked Smuggling Compartments[h3]\n\nAn improvement on secret compartments used by smugglers throughout the galaxy, cloaked smuggling compartments are even more difficult to discover than more \"standard\" models. Lined with nightshadow, cloaked smuggling compartments can foil all but the most sensitive sensor scans. \n\n[P][B]Models Include:[b] Arakyd Industries Nightshadow compartment liners.","Sources":{"Source":"Fly Casual"},"Custom":"DescOnly","Type":"Vehicle","Price":2200,"Rarity":4,"Restricted":"true","HP":1,"BaseMods":{"Mod":[{"Key":"SMUGENC","Count":1},{"Count":1,"MiscDesc":"Increases difficulty of checks made to find compartment by 3."}]},"AddedMods":{"Mod":{"Key":"SMUGENC","Count":2}},"MinEnc":25,"Thumbnail":"img\/no_image.png"},{"Key":"INTBROAD","Name":"Interior Broadcast Suite","Description":"\n      [H3]Interior Broadcast Suite[h3]\n\nAs a result of their transient lifestyles, most smugglers must bring their own entertainment with them wherever they go. For many species, music is a primary form of amusement in addition to being an important cultural touchstone, and so many smugglers install systems that let them broadcast their chosen auditory entertainment across the vessel. While this can have a soothing effect if everyone aboard the ship agrees with the selection of music, it can also be a source of considerable fric-tion between crewmates, such as if one crewmember is extremely dedicated to Gammorean opera and the rest of the crew does not share that unique taste. \n\n[P][B]Models Include:[b] Celta-corp Shipboard Music Suite, TaggeCo. Interior Broadcaster System.","Source":"Fly Casual","Custom":"DescOnly","Type":"Vehicle","Price":800,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Increases the strain threshold of each crewmember by 1"}},"Thumbnail":"img\/no_image.png"},{"Key":"NIGHTCOAT","Name":"Nightshadow Coating","Description":"\n      [H3]Nightshadow Coating[h3]\n\nA special sensor-baffling coating manufactured by Arakyd Industries, nightshadow can make a vessel very difficult to detect. Highly-restricted by the Empire, nightshadow coating is much sought after by smugglers who can obtain it. \n\n[P][B]Models Include:[b] Arakyd Industries Nightshadow vehicle coating.","Source":"Fly Casual","Custom":"DescOnly","Type":"Vehicle","Price":3500,"Rarity":8,"Restricted":"true","HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Reduces range of enemy ship's passive sensors by 1 (minimum of close range) for detecting a vessel with nightshadow coating."}},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"Reduce the ship's silhouette by 1 in combat"}},"Thumbnail":"img\/no_image.png"},{"Key":"ONBOARDAMENUNIT","Name":"Onboard Amenities Unit","Description":"\n      [H3]Onboard Amenities Unit[h3]\n\nA smuggler's vessel is usually his home, and thus tends to be stocked with familiar comforts. For some, this means keeping a refrigeration unit full of some favorite food, while for others it can mean well-furnished compartment full of libations, alcoholic or otherwise. Whatever the specifics, a ship with an onboard amenities unit allows its inhabitants to offer hospitality to any guests aboard their vessel. \n\n[P][B]Models Include:[b] Gosiea Industries RefresherPlus, TaggeCo. Chill-compartment.","Source":"Fly Casual","Custom":"DescOnly","Type":"Vehicle","Price":750,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Upgrades ability of Charm, Deception, and Negotiation checks while aboard once."}},"Thumbnail":"img\/no_image.png"},{"Key":"RAPIDCARGOEVAC","Name":"Rapid Cargo Evacuation Chute","Description":"\n      [H3]Rapid Cargo Evacuation Chute[h3]\n\nThough no corporation officially acknowledges making a product with this functionality, many smugglers nonetheless rig their cargo bays to be able to rapidly dump their payloads (regardless of whether or not the vehicle is in motion, ideally). Though no smuggler ever wants to use this feature, dumping one's cargo can mean the difference between jail time and slipping past the authorities to smuggle another day. \n\n[P][B]Models Include:[b] Custom models.","Source":"Fly Casual","Custom":"DescOnly","Type":"Vehicle","Price":500,"Rarity":3,"Restricted":"true","HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Make an [B]Average ([DI][DI]) Mechanics check[b] as an action while in the cockpit or cargo bay to eject everything currently stored in the cargo hold."}},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"May instead be activated as an action without making a check Mod."}},"Thumbnail":"img\/no_image.png"},{"Key":"WHISPERTHRUST","Name":"Whisperthrust Engine","Description":"\n      [H3]Whisperthrust Engine[h3]\n\nProduced by Rendili StarDrive, the WhisperThrust Engine is a sublight drive that uses special supercooled gases and baffles to reduce a starship's sensor signature. Outlawed by the Empire, Rendili still man-ages to sell these engines through its prominent position in the Corporate Sector Authority. \n\n[P][B]Models Include:[b] Rendili StarDrive WhisperThrust engine.","Source":"Fly Casual","Custom":"DescOnly","Type":"Vehicle","Price":7500,"Rarity":7,"Restricted":"true","HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Increases the difficulty of checks to detect this vessel by two while it is traveling at speed 3 or lower."}},"Thumbnail":"img\/no_image.png"},{"Key":"STARHWKSIDECAR","Name":"Starhawk Sidecar","Description":"\n      [H3]Starhawk Sidecar[h3]\n\nThe Starhawk has an unusual feature: it can be fitted with a sidecar, allowing it to carry an additional passenger or transport extra cargo. The speeder bike also comes equipped with a rear tractor beam coupler to allow it to tow a repulsorsled for even more cargo capacity.","Source":"Fly Casual","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"STARHAWKSPEED"},"Price":500,"Rarity":3,"HP":1,"BaseMods":{"Mod":[{"Key":"ENCCADD","Count":10},{"Key":"PASSADD","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"CURVEDHILT","Name":"Curved Hilt","Description":"\n      [H3]Curved Hilt[h3]\n\nThe curved hilt is preferred by duelists and practitioners of the lightsaber combat form Makashi. This modification allows for both better control and better flexibility when handling the lightsaber. and for more force behind overhand strikes. \n\n[P][B]Models Include:[b] None. ","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":1000,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Adds automatic [ADVANTAGE] to successful Lightsaber combat checks when engaged with a single opponent."}},"AddedMods":{"Mod":{"Key":"DEFENSIVE","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"BLASTDAMP","Name":"Blaster Energy Dampener","Description":"\n      [H3]Blaster Energy Dampener[h3]\n\nA blaster, with its focused energy, is one of the most powerful ranged weapons, but those who wish to conceal their shots are often forced to resort to other weapons if they want to pass unnoticed. Some assassins and spies prefer a blaster energy dampener, an attachment that significantly reduces the visibility of a blaster bolt, at the cost of stopping power. While dampened blaster fire is still noticeable in totally dark or very dim environments, an assassin can make a shot in a well-lit environment and not worry about attracting too much attention. This attachment is only for use on Ranged (Light) and Ranged (Heavy) blaster weapons. \n\n[P][B]Models Include:[b] Czerka B78 Energy Dampener.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Blaster"},"Price":750,"Rarity":5,"Restricted":"true","HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Increases the difficulty of checks made to detect this weapon's fire by one"},{"Key":"DAMSUB","Count":2}]},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"Add 1 setback die to checks made to detect this weapon's fire"}},"Thumbnail":"img\/no_image.png"},{"Key":"NIGHTSCOPE","Name":"Night Vision Scope","Description":"\n      [H3]Night Vision Scope[h3]\n\nThis attachment uses an optical system similar to a set of electrobinoculars that shows infrared wavelengths of light, effectively allowing the shooter to track heat signatures in dark or concealed areas, or through walls. It does not differentiate between heat generated by life forms and other kinds of heat, whether from natural or manufactured phenomena. (It is blind to life forms that do not give off heat.) This attachment can be used on any ranged weapon, with the exception of single-use weapons and weapons that would not realistically benefit from a scope. \n\n[P][B]Models Include:[b] Fabritech LRS Low-Light Scope, Zikon Optics Model 45 Infrascope.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Ranged"},"Price":700,"Rarity":5,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Remove up to [SETBACK][SETBACK] on any checks to use this weapon due to darkness"}},"Thumbnail":"img\/no_image.png"},{"Key":"SHADOWSHEATH","Name":"Shadowsheath","Description":"\n      [H3]Shadowsheath[h3]\n\nBounty hunters, assassins, and other criminals often have a need to conceal weapons on their bodies to sneak them past guards or get close to a target without arousing alarm. A shadowsheath utilizes optical camouflage technology, but rather than conceal an entire body, its smaller projector is specifically designed to conceal a single weapon when kept in a holster or sheath. This attachment may be attached to any weapon with an encumbrance of 2 or less. \n\n[P][B]Models Include:[b] Merr-Sonn Shadowsheath WCS.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","Price":1500,"Rarity":5,"Restricted":"true","HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Increases the difficulty of any checks made to detect the sheath or the weapon it holds by two"}},"MaxEnc":2,"Thumbnail":"img\/no_image.png"},{"Key":"STUNPULSE","Name":"Stun Pulse","Description":"\n      [H3]Stun Pulse[h3]\n\nA stun pulse attachment deals an electric shock to the target, in addition to its weapon's normal damage. Generally attached to truncheons or bludgeoning weapons, stun pulses are often used by law enforcement to disable suspects without killing them. A stun pulse can be attached to any bludgeoning Melee or Brawl weapon. \n[P][B]Models Include:[b] CoroTech EV45 Pulse Coil, SoroSuub \"Enforcer\" Stunner.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Melee"},"Price":250,"Rarity":5,"HP":1,"BaseMods":{"Mod":{"Key":"STUN","Count":2}},"AddedMods":{"Mod":{"Key":"STUN","Count":3}},"Thumbnail":"img\/no_image.png"},{"Key":"BARABLS","Name":"Barab Ingot","Description":"[H3]Barab Ingot[h3]\n\nRare variants of kyber crystals unique to the heavily irradiated world Barab I, home of the saurian Barabel people, Barab ingots are among the various crystals used in lightsabers. Found in small clusters in mountainous regions, Barab ingots are hot to the touch and glow with a fierce inner light. When installed in a lightsaber, they create a searing, fiery blade that bums so fiercely that it nearly loses cohesion. A lightsaber with an installed Barab ingot is slightly radioactive, and with a particularly good or lucky strike can set a target alight. A Barab ingot is a lightsaber crystal.\n\n[P][B]Models Include:[b] None","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":15000,"Rarity":7,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":8},{"Key":"CRITSET","Count":3},{"Key":"BREACH","Count":1,"QualReplace":"true"},{"Key":"BURN","Count":1,"QualReplace":"true"},{"Key":"SUNDER"}]},"AddedMods":{"Mod":[{"Key":"BURN","Count":2},{"Key":"VICIOUS","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"DANTARI","Name":"Dantari Crystal","Description":"[H3]Dantari Crystal[h3]\n\nAs their name suggests, Dantari crystals are found on the Outer Rim world of Dantooine. Discovered within the eggs of the kinrath—giant, venomous, cave-dwelling arachnids—it is unknown how Dantari crystals come into existence. However, these multihued kyber crystals were once extremely popular among the Jedi. When installed in a lightsaber, a Force-reactive Dantan crystal helps the wielder maintain focus and calm. A Dantari crystal is a lightsaber crystal. \n\n[P][B]Models Include:[b] None.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":12000,"Rarity":9,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":7},{"Key":"CRITSET","Count":2},{"Key":"BREACH","Count":1,"QualReplace":"true"},{"Key":"SUNDER"},{"Count":1,"MiscDesc":"When making a Force power check as part of a combat check, may spend [FORCEPOINT] to recover 2 strain."}]},"AddedMods":{"Mod":[{"Key":"CRITSUB","Count":1},{"Key":"DAMADD","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"DRAGITE","Name":"Dragite Gem","Description":"\n      [H3]Dragite Gem[h3]\n\nSmall, dull, and brittle, Dragite gems are found in the caves and caverns of the D'olop mountain range on M'haeli, an agriworld in the Expansion Region. In their natural state, dragite crystals are one of the most brittle kyber crystals, and they produce a loud ringing when struck. Worked into a suitable lightsaber crystal, a difficult task due to the dragite gem's distressing tendency to fracture or shatter easily, it produces a blade that pulses and hums loudly. In addition to this noise, when a lightsaber equipped with a dragite gem strikes a solid target, it produces a deafening crack and a shock wave that can disorient and even cause bodily harm to its target. A dragite gem is a lightsaber crystal. \n\n[P][B]Models Include:[b] None.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":14000,"Rarity":7,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":7},{"Key":"CRITSET","Count":3},{"Key":"BREACH","Count":1,"QualReplace":"true"},{"Key":"DISORIENT","Count":1,"QualReplace":"true"},{"Key":"SUNDER"}]},"AddedMods":{"Mod":[{"Key":"DISORIENT","Count":2},{"Key":"CONCUSSIVE","Count":2},{"Key":"DAMADD","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"DUALPHASE","Name":"Dual-Phase Modification","Description":"\n      [H3]Dual-Phase Modification[h3]\n\nConsidered antiquated and outdated by the time of the Clone Wars, the dual-phase modification is an artifact of an older, more violent time. Designed to catch an opponent off guard, this modification allows the wielder to change the length of a lightsaber's blade with the push of a button. This causes an opponent's guard to falter momentarily as he adjusts to the new blade length, allowing the Jedi to press the advantage while his opponent is confused. \n\n[P][B]Models Include:[b] None.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":4500,"Rarity":6,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"May change blade length once per encounter as an incidental.  Next attack that turn ignores target's melee defense."}},"Thumbnail":"img\/no_image.png"},{"Key":"EXTHILT","Name":"Extended Hilt","Description":"\n      [H3]Extended Hilt[h3]\n\nThe idea behind the extended hilt modification is to increase the lightsaber's striking i4 and cutting power by using the leverage of the longer handle and a two-handed grip to help focus the wielder's strength into the force of the blow. The extended hilt modification is also popular among Force users of unusual height or build as a way to capitalize on their size advantage in combat. \n\n[P][B]Models Include:[b] None.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":3800,"Rarity":7,"HP":2,"BaseMods":{"Mod":{"Key":"DAMADD","Count":1}},"AddedMods":{"Mod":{"Key":"VICIOUS","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"ILUM","Name":"Ilum Crystal","Description":"\n      [H3]Ilum Crystal[h3]\n\nThe kyber crystals found deep within the caves of the icy planet Hum were prized by the Jedi as some of the best crystals for constructing a lightsaber. Ilum featured heavily in Jedi tradition, with young Padawans traveling there as part of their training to commune with the Force and use its guidance to seek out the crystal that would go into the construction of their first lightsaber. \n\n[P][B]Models Include:[b] None.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":9000,"Rarity":10,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":6},{"Key":"CRITSET","Count":2},{"Key":"BREACH","Count":1,"QualReplace":"true"},{"Key":"SUNDER"}]},"AddedMods":{"Mod":[{"Key":"VICIOUS","Count":2},{"Key":"DAMADD","Count":4},{"Key":"CRITSUB","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"KRAYT","Name":"Krayt Dragon Pearl","Description":"\n      [H3]Krayt Dragon Pearl[h3]\n\nHighly sought after by jewelers, artisans, and wealthy collectors for their luster, color, and refractive properties, krayt dragon pearls are perhaps the rarest of the crystals used in the construction of lightsabers. The terrible krayt dragons of Tatooine tend to live for an incredibly long time, and over the course of their lives will ingest stones to aid with digestion. While the caustic digestive juices of the krayt dragon can even break down stone over time, every once in a while these stones contain some form of kyber crystal. Incredibly resilient, they remain in the creatures' guts for the entirety of the dragons' lives, slowly being polished and smoothed into small, dense spheres of crystal. The resulting \"krayt dragon pearls\" are vanishingly rare, hard to acquire, and demand exorbitant prices. Since they are a type of kyber crystal, they can be worked into powerful lightsaber crystals—ones which produce an exceptionally savage and destructive blade that makes an unsettling howling noise when swung about. A krayt dragon pearl is a lightsaber crystal. \n[P][B]Models Include:[b] None.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":15000,"Rarity":10,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":9},{"Key":"CRITSET","Count":1},{"Key":"BREACH","Count":1,"QualReplace":"true"},{"Key":"SUNDER"},{"Key":"VICIOUS","Count":1}]},"AddedMods":{"Mod":[{"Key":"VICIOUS","Count":3},{"Key":"DAMADD","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"LORRDIAN","Name":"Lorrdian Gemstone","Description":"\n      [H3]Lorrdian Gemstone[h3]\n\nLorrdian gemstones arc kyber crystals mined millen nia ago by enslaved Lorrdians during the Kanz Disorders. Created by Force-sensitive Lorrdians to supplement the intricate kinetic communication developed among the slave populace, these gemstones were imbued with Force energies that allowed their possessors to read the emotions and actions of others. When installed in a lightsaber, a Lorrdian gemstone allows the wielder to predict the actions of an opponent, giving the wielder a decided edge in melee combat. A Lorrdian gemstone is a lightsaber crystal. \n\n[P][B]Models Include:[b] None.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":9600,"Rarity":8,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":7},{"Key":"CRITSET","Count":2},{"Key":"BREACH","Count":1,"QualReplace":"true"},{"Key":"DEFENSIVE","Count":1,"QualReplace":"true"},{"Key":"SUNDER"}]},"AddedMods":{"Mod":[{"Key":"DEFENSIVE","Count":1},{"Key":"DEFLECTION","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"MEPHITE","Name":"Mephite Crystal","Description":"\n      [H3]Mephite Crystal[h3]\n\nMephite crystals are rare, lustrous kyber crystals found in a handful of places in and around the Adega system. One of five types of crystal known collectively as \"Adegan crystals,\" mephite crystals are well-suited for use in lightsabers due to their internal structure and light-modulating capabilities. Like all Adegan crystals. mephite crystals are Force-reactive and can be infused with a small amount of a Force user's power. When installed in a lightsaber and infused with the Force, mephite crystals give off a small but steady Force signature that can be sensed by any nearby Force user A mephite crystal is a lightsaber crystal. \n\n[P][B]Models Include:[b] None.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":10000,"Rarity":10,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":8},{"Key":"CRITSET","Count":2},{"Key":"BREACH","Count":1,"QualReplace":"true"},{"Key":"SUNDER"},{"Count":1,"MiscDesc":"Force-sensitive characters using Force powers to sense their surroundings automatically detect a lightsaber using a mephite crystal if it is within the range of the power."}]},"AddedMods":{"Mod":[{"Key":"DAMADD","Count":3},{"Key":"CRITSUB","Count":1},{"Key":"VICIOUS","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"SAPITH","Name":"Sapith Gem","Description":"\n      [H3]Sapith Gem[h3]\n\nSaid to originate from a strange and mysterious world called Lwhekk in the Unknown Regions, sapith gems are similar to krayt dragon pearls in that they were formed when rocks containing a kyber crystal were consumed by a great beast. In this case, the beast was a massive volice worm, which died out long before the present day. Thus, the only way to find these vanishingly rare crystals is to dig them out from the fossilized remains of a volice worm. Shaped like serpent scales, these smooth, lustrous crystals have an incredibly complex internal structure, which magnifies the intensity of any light that passes through them. When installed in a lightsaber, a sapith gem creates a powerful, intense beam that can pierce nearly anything with ease. A sapith gem is a lightsaber crystal. \n\n[P][B]Models Include:[b] None.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":18000,"Rarity":10,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":7},{"Key":"CRITSET","Count":2},{"Key":"BREACH","Count":1,"QualReplace":"true"},{"Key":"SUNDER"}]},"AddedMods":{"Mod":[{"Key":"BREACH","Count":1},{"Key":"DAMADD","Count":2},{"Key":"CRITSUB","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"SUPHILT","Name":"Superior Hilt Personalization","Description":"\n      [H3]Superior Hilt Personalization[h3]\n\nWhile most lightsabers are austere and utilitarian, some Jedi have been known to personalize their weapons to better suit their tastes and styles. Numerous cosmetic or practical enhancements can be applied to a lightsaber, from rare metals and precious gemstones to customized grips and locking activating switches. \n\n[P][B]Models Include:[b] None.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":5000,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Key":"SUPERIOR"}},"Thumbnail":"img\/no_image.png"},{"Key":"TRAINEMIT","Name":"Training Lightsaber Emitter","Description":"\n      [H3]Training Lightsaber Emitter[h3]\n\nIn the days of the Republic, the Jedi allowed their younglings to train with \"training sabers,\" non-lethal versions of their famous energy blades. A training lightsaber is almost the same as a standard lightsaber; however, the crystal is replaced with a training emitter. The training emitter creates a blade that is completely non-lethal, and at most can generate a stun shock. A training emitter is a lightsaber crystal. \n\n[P][B]Models Include:[b] None.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":100,"Rarity":6,"HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":6},{"Key":"CRITSET"},{"Key":"STUNDAMAGE"}]},"Thumbnail":"img\/no_image.png"},{"Key":"BIOFEED","Name":"Biofeedback System","Description":"\n      [H3]Biofeedback System[h3]\n\nThis system closely monitors the vital signs of the person wearing the armor. It can immediately identify when the user is hurt or experiencing elevated levels of adrenaline and administer minor sedatives, healing chemicals, and other drugs as needed. This attachment can be installed on any full-body armor suit. \n\n[P][B]Models Include:[b] BioTech \"Autodoc\" Monitoring Network, Atlas Corp NG-7 Vital System.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":"Sealed"},"Price":3300,"Rarity":5,"HP":2,"BaseMods":{"Mod":{"Key":"STRAINADD","Count":4}},"AddedMods":{"Mod":{"Key":"RAPREC","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"ENERDISP","Name":"Energy Dispersion System","Description":"\n      [H3]Energy Dispersion System[h3]\n\nThis minute metallic wiring is designed to distribute electrical shocks across the armor while grounding the user against the energy, reducing the potency of such attacks. It protects against electricity as well as weapons' Stun settings, although it does not effectively disperse blaster fire. This attachment can be installed on any armor. \n[P][B]Models Include:[b] Atlas Corp Model 88 Electric Shield, Merr-Sonn AEGIS Nanoarray.","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":"Sealed"},"Price":500,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"When reducing strain damage by soak, count soak as two higher"}},"Thumbnail":"img\/no_image.png"},{"Key":"HELMETSCAN","Name":"In-Helmet Scanner","Description":"\n      [H3]In-Helmet Scanner[h3]\n\nAn in-helmet scanner provides the usefulness of a general purpose scanner in a heads-up display splashed across the inside of the users helmet. This feeds the user a constant stream of information about the surrounding environment. Depending on the specific model, an in-helmet scanner can indicate the presence of life forms or droids and display heat signatures, radiation sources, acoustic emissions, and more. Many can also scan and listen to nearby comlink frequencies. In-helmet scanners can be added to any helmet. \n\n[P][B]Models Include:[b] CryonCorp GoScan, CUE Optical Information System (Mobile), Chedak Mk. 7 HUD-INFO. ","Source":"Force and Destiny Core Rulebook","Custom":"DescOnly","Type":"Armor","Price":750,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"\n          Adds a general purpose scanner\n          to the user’s helmet. The scanner allows the user to\n          remove [SETBACK] imposed on any checks due to darkness\n          or environmental conditions such as smoke or fog. It\n          also allows the user to detect heat sources and motion\n          within medium range.\n        "}},"Thumbnail":"img\/no_image.png"},{"Key":"HELMETCOM","Name":"Helmet Comlink","Description":"\n      [H3]Helmet Comlink[h3]\n\nRather than rely on a separate piece of equipment that can be broken, lost, or stolen, some mercenaries and bounty hunters prefer to install a micro comlink directly into their armor. A micro-comlink can comprise anything from a complete in-helmet system to a simple small microphone and speaker attached to a wristplate or near the shoulder. A micro-comlink can be installed in any armor.","Source":"Force and Destiny Beta Rulebook","Custom":"DescOnly","Type":"Armor","Price":200,"Rarity":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"A long-range comlink is integrated into the helmet"}},"Thumbnail":"img\/no_image.png"},{"Key":"UCA","Name":"Upgraded Comms Array","Description":"\n      [H3]Upgraded Comms Array[h3]\n\nThis upgrade reflects the simple act of mounting more or heavier weapons on a starship or vehicle. When replacing an existing weapon on the ship, the new weapon has the same firing arc as the original. When adding a weapon to a new location on the ship, the GM must decide what firing arc makes the most sense. \n\n[P][B]Models Include:[b] Arakyd Flex Tube Proton Torpedo Launcher, ArMek SW-6 Heavy Ion Cannon.","Sources":{"Source":["Age of Rebellion Core Rulebook","Force and Destiny Core Rulebook"]},"Custom":"DescOnly","Type":"Vehicle","Price":4800,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Key":"CRANGEADD","Count":1}},"AddedMods":{"Mod":{"Key":"CRANGEADD","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"PHYSCOUNT","Name":"Physical Countermeasures","Description":"\n      [H3]Physical Countermeasures[h3]\n\nLike electronic countermeasures, physical counter-measures are designed to fool scanners and make a ship or vehicle harder to hit. Whereas electronic countermeasures affect an opposing ship or vehicle's sensors, physical countermeasures are specifically designed to help a ship or vehicle evade incoming missiles or torpedoes. Countermeasures come in three basic varieties—chaff, flares, and anti-warhead missile pods. Chaff is a collection of small, highly reflective alloy streamers packed into a tube with a small explosive charge. When detonated, the chaff tube creates a cloud of glittering shrapnel that clouds detection systems and confuses most basic missile guidance systems. Flares are deployed in groups from special launchers, and consist of small incendiary devices that mimic the heat produced by a ship or vehicle's engines, fooling incoming missiles into following the super-hot flare instead of the vehicle. Anti-warhead missile pods are similar to flares, but they fire a cluster of small, low-yield missiles designed to intercept and destroy incoming ordnance. \n\n[P]While any ship equipped with physical counter-measures carries enough to get them through most encounters, engaging in a long, drawn-out fight can quickly deplete a launcher's store of countermeasures. Game Masters may spend [AD][AD] or [TR] on Gunnery checks made using missiles, rockets, or torpedoes targeting the starship to cause a countermeasure launcher to run out of its load of flares, chaff, or anti-warhead missiles, effectively disabling it until the end of the encounter. \n\n[P][B]Models Include:[b] Loronar Defense Industries A4M \"Pepperbox\" anti-warhead micro-missile pack, Oriolanis Defense Systems XM-130 chaff dispenser, Conner Ship Systems MJU-9G \"Phoenix\" Flare Dispenser.","Source":"Stay on Target","Custom":"DescOnly","Type":"Vehicle","Price":2200,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Adds [SETBACK] to all Gunnery checks made using misiles, rockets, or torpedoes targeting the starship."}},"AddedMods":{"Mod":[{"Count":1,"MiscDesc":"Adds [SETBACK] to all Gunnery checks made using misiles, rockets, or torpedoes targeting the starship."},{"Count":1,"MiscDesc":"Increase difficulty by 1 when making checks triggered by the Guided quality."}]},"MaxSize":10,"Thumbnail":"img\/no_image.png"},{"Key":"GRAVMINE","Name":"Gravity Mine Launcher","Description":"\n      [H3]Gravity Mine Launcher[h3]\n\nGravity mine launchers, and their accompanying gravity mines, are small anti-vehicle mines produced by a number of arms manufacturers. While each brand uses its own patented gravitic technology, gravity mines and their launchers share a number of common traits. The mines range anywhere from the size of a slim datapad to a meter across, depending on their intended use, and are packed with advanced gravity well generation systems. When deployed, gravity mines create a localized area of intense gravity that can reduce the output of repulsorlift drives or even shut them down completely, stopping a speeder in its tracks. While they are often used in military installations to restrict ship or vehicle access to sensitive areas or to create firing lanes for weapon emplacements, they can also be used in sabotage or to lay traps for incoming ships or airspeeders. Gravity mine launchers are simple box-type launchers mounted on landspeeders that allow a vehicle crew to lay a minefield with relative ease. \n\n[P]The character piloting or operating the weapons on a vehicle equipped with a gravity mine launcher can deploy a single gravity mine anywhere on the ground within close range by spending an action. Once the mine is deployed, it automatically attaches to any other starship or vehicle using repulsorlifts that comes within close range of it. For every 1 mine attached to a vehicle that uses the Piloting (Planetary) skill, that vehicle reduces its speed by 1. For every 2 mines attached to a starship that uses the Piloting (Space) skill, that starship reduces its speed by 1. An attached mine can be removed with an [B]Average ([DI][DI]) Mechanics check[b]. \n\n[P][B]Models Include:[b] SoroSuub X80a UltraMass Gravity Pulse Generator, Taim & Bak Model 19 micro-gravity well mines.","Source":"Stay on Target","Custom":"DescOnly","Type":"Vehicle","Price":3500,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Allows vehicle to deploy gravity mines within close range"}},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"Increase deployable range to short"}},"MaxSize":10,"Thumbnail":"img\/no_image.png"},{"Key":"ASTROMECH","Name":"Astromech Droid Socket","Description":"\n      [H3]Astromech Droid Socket[h3]\n\nAstromech sockets are typically found in starfighters, shuttles, and the occasional airspeeder. Installed during construction and fully integrated into a vehicle's systems, an astromech droid socket allows an astromech droid, typically one of Industrial Automaton's R-series droids, to access the ship's various systems through its SCOMP interface. A droid installed in an astromech socket acts as co-pilot, engineer, and radio\/weapons systems operator, assisting the pilot during combat, monitoring onboard systems, performing astrogation calculations, and repairing damage on the fly. Most ships or vehicles can benefit from the inclusion of an astromech droid, especially those not equipped with an astromech socket. For these ships, Industrial Automaton sells a standalone astromech socket ready for installation in ships not already equipped. \n\n[P]Aftermarket astromech sockets can only be installed on ships or vehicles of silhouette 3 or higher. After a lengthy and involved installation process requiring heavy modifications to both the ship's hull and its onboard systems, the ship and pilot gain all the benefits of an astromech droid when one is installed in the socket. These benefits range from enhanced damage control to the ability to make hyperspace jump calculations. When installed on larger starships, this attachment represents can represent more than a single socket. These ships often employ an entire bay capable of housing multiple astromechs and deploying them to the outer surface of the ship to aid in repairs. \n\n[P][B]Models Include:[b] Industrial Automaton Mk. I Astromech Socket.","Source":"Stay on Target","Custom":"DescOnly","Type":"Vehicle","Price":3000,"Rarity":5,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Allows starship to link to an astromech droid via SCOMP"}},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"Automated droid ejection system"}},"MaxSize":10,"Thumbnail":"img\/no_image.png"},{"Key":"HARDCIRC","Name":"Hardened Circuits","Description":"\n      [H3]Hardened Circuits[h3]\n\nThe demands put on a ship or vehicle's electrical system, both by the systems connected to it and by daily wear-and-tear, are enormous. Anything that draws power from a ship or vehicle's reactor, from the pilot's datapad charger to the onboard weapon systems, puts strain on every cable, every breaker, every bus plate between the system and the power source. Hardened circuits covers a variety of electrical transmission gear that, when installed, improve a vehicle or ship's power system and allow it to handle heavier-than-normal power loads. \n\n[P][B]Models Include:[b] Santhe\/Sienar Model 30 Heavy-Duty Dielectric Power Bus, Fabritech Triple-Phase Thermal-Magnetic Circuit Breakers, Corellian Engineering Corporation SF\/6 Hybrid Switchgear Module.","Source":"Stay on Target","Custom":"DescOnly","Type":"Vehicle","Price":4500,"Rarity":5,"HP":2,"BaseMods":{"Mod":{"Key":"SSTRAINADD","Count":2}},"AddedMods":{"Mod":{"Key":"SSTRAINADD","Count":2}},"MaxSize":10,"Thumbnail":"img\/no_image.png"},{"Key":"HULLREINF","Name":"Hull\/Keel Reinforcement","Description":"\n      [H3]Hull\/Keel Reinforcement[h3]\n\nEven the cheapest, most unreliable starships are durable items built to withstand the incredible amounts of abuse heaped on them by decades in space. Hull or keel reinforcement is an easy way to improve a vehicle or vessel's durability. Extremely old vessels, such as most of those fielded by the Rebel Alliance, can also benefit from a hull or keel reinforcement by shoring up damaged or fatigued hull members and adding support bracing at strategic locations. \n\n[P][B]Models Include:[b] Various models.","Source":"Stay on Target","Custom":"DescOnly","Type":"Vehicle","Price":2500,"Rarity":4,"HP":2,"BaseMods":{"Mod":{"Key":"HULLADD","Count":2}},"AddedMods":{"Mod":{"Key":"HULLADD","Count":2}},"MaxSize":10,"PriceSizeMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"RAM","Name":"Ram Attachment","Description":"\n      [H3]Ram Attachment[h3]\n\nFor the most part, collisions with other ships, vehicles, or obstacles are to be avoided at all costs. There are times, however, when a desperate situation calls for a desperate measure and a pilot or driver must use his vehicle as a weapon. A number of bolt-on accessories for ships and vehicles are produced by major vehicle manufacturers that protect and reinforce prows or forward sections against collision. Items such as bantha bars, sloped fenders known colloquially as \"nerfcatchers,\" and custom-fit reinforced hull plating are all examples of the rich after market dedicated to protecting a vehicle in case of collision. \n\n[P][B]Models Include:[b] Various models.","Source":"Stay on Target","Custom":"DescOnly","Type":"Vehicle","Price":6500,"Rarity":3,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Treats the starship or vehicle's defense as 2 higher when instigating a collision."}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Add 1 more defense when instigating a collision."}},"MaxSize":10,"Thumbnail":"img\/no_image.png"},{"Key":"SLAVECIRC","Name":"Slave Circuit","Description":"\n      [H3]Slave Circuit[h3]\n\nAn old shipbuilding technology perfected millennia ago, slave circuits allow ship owners to operate their ships, or various systems within their ships, via remote control. Occasionally referred to as the \"Electronic Co-Pilot\" or \"Instant Backseater,\" slave circuits run all of a ship's systems through a central system bus that can be activated and deactivated via voice command through a comlink-like device called a \"beckon call.\" Basic slave rigs allow a user to remotely activate a ship's systems and bring it to complete operational readiness, or to shut those systems down and lock out all users until a security code is entered. More advanced models allow the user to call the ship to his present location, and even allow it to fight its way there with moderate success. While popular in many circles, slave circuits are often mistrusted by ship owners. \n\n[P][B]Models Include:[b] Corellian Engineering Corporation \"Savant\" Ship Slave Rig, Incom ST-9x.4 \"Backseater\" Starfighter Slave System.","Source":"Stay on Target","Custom":"DescOnly","Type":"Vehicle","Price":10000,"Rarity":2,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Allows a ship or vehicle to be activated or deactivated by remote control."}},"AddedMods":{"Mod":[{"Count":1,"MiscDesc":"Allows ship or vehicle to move to the owner's location using owner's Piloting skill."},{"Count":1,"MiscDesc":"Allows ship or vehicle to autonomously use its weapon systems using owner's appropriate skill."}]},"MaxSize":10,"Thumbnail":"img\/no_image.png"},{"Key":"HNPA","Name":"Holonet Pirate Array","Description":"\n      [H3]Holonet Pirate Array[h3]\n\nLife in the galaxy has arisen in all manner of biomes, from the deep seas of Mon Cala to the Ithorian jungles, and every possible climate in between. Most starship life-support systems create an environment in the median range, neither too hot nor too cold, neither too humid nor too dry. When members of a particular species need unique accommodations, they must turn to their own shipwrights, or modify acquired ships appropriately. Diplomats often take the additional step of adapting their ships to be capable of replicating a wide range of environments, the better to make passengers and guests feel at home.","Source":"Desperate Allies","Custom":"DescOnly","Type":"Vehicle","Price":25000,"Rarity":8,"Restricted":"true","HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Transmissions sent with this attachment can reach any facility that has access to interstellar communications.  Transmissions can be intercepted with a [B]Hard ([DI][DI][DI]) Computers check[b], provided someone is aware of the transmission."}},"AddedMods":{"Mod":[{"Count":3,"MiscDesc":"Add setback to enemy checks to intercept outgoing transmissions."},{"Count":2,"MiscDesc":"Add boost to intercept HoloNet traffic"}]},"Thumbnail":"img\/no_image.png"},{"Key":"LUXPASSCOMP","Name":"Luxury Passenger Compartments","Description":"\n      [H3]Luxury Passenger Compartments[h3]\n\nCorrupt Imperial officials and powerful crime lords are more likely than Rebels to enjoy opulent living standards. However, Rebels who have regular contact with the rich and powerful sometimes find a little extravagance to be a purely practical investment. While scented air recyclers, a galley stocked with Corellian brandy, and other luxuries have little measurable effect on the Rebel war effort, the intangible benefits offered by a display of confidence and power should not be underestimated.","Source":"Desperate Allies","Custom":"DescOnly","Type":"Vehicle","Price":2000,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Add [BO] to all Charm, Deception, and Negotiation checks made against passengers within the vehicle.  Checks made against passengers who are accustomed to opulence and luxury have up to [SE][SE] removed instead."}},"PricePassMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"ASEA","Name":"Advanced Subspace Encryption Array","Description":"\n      [H3]Advanced Subspace Encryption Array[h3]\n\nThe Empire's tight grip on the HoloNet forces the Rebellion to rely primarily on subspace transceivers for communications. However. subspace transceivers have a much more limited range than HoloNet transmissions, requiring frequent relays across additional networks before reaching the intended recipient. Risk of interception of a relayed transmission limits Rebel operations, forcing them to rely on courier ships and secret comm stations for long-range communication. However, ships with advanced encryption algorithms can send coded transmissions that blend with normal traffic, rendering them nearly undetectable and all but indecipherable even if they are intercepted.","Source":"Desperate Allies","Custom":"DescOnly","Type":"Vehicle","Price":6000,"Rarity":7,"Restricted":"true","HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Only the intended recipient can detect a transmission  sent with this attachment without a [B]Hard ([DI][DI][DI]) Computers check[b]."},{"Count":1,"MiscDesc":"Upgrade the difficulty of any checks to intercept or decipher transmissions made from this attachment once."}]},"AddedMods":{"Mod":[{"Count":2,"MiscDesc":"Add setback to enemy detection check"},{"Count":2,"MiscDesc":"Add setback to enemy interception or deciphering check"}]},"Thumbnail":"img\/no_image.png"},{"Key":"ENVSIM","Name":"Environmental Simulators","Description":"\n      [H3]Environmental Simulators[h3]\nLife in the galaxy has arisen in all manner of biomes,\nfrom the deep seas of Mon Cala to the Ithorian jungles, and every possible climate in between. Most\nstarship life-support systems create an environment\nin the median range, neither too hot nor too cold, neither too humid nor too dry. When members of\na particular species need unique accommodations,\nthey must turn to their own shipwrights, or modify\nacquired ships appropriately. Diplomats often take\nthe additional step of adapting their ships to be capable of replicating a wide range of environments, the\nbetter to make passengers and guests feel at home.","Source":"Desperate Allies","Custom":"DescOnly","Type":"Vehicle","Price":7500,"Rarity":6,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Can replicate up to three different planetary environments, one at a time.  When making Charm or Negotiation checks against members of species native to replicated environment, add an automatic [AD][AD] to pool."}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Additional planetary environment"}},"Thumbnail":"img\/no_image.png"},{"Key":"ECMSUITETALLANX","Name":"Electronic Countermeasures Suite (Custom)","Description":"\n      [H3]Electronic Countermeasures Suite (Custom)[h3]\n      [P]Blocks sensors within range when active, counting the Tallanx’s silhouette as 2. Immediately notifies all ships in a star system, or within 100 kilometers if planetside, to the Tollonx’s existence.\n      [P][I]This is an optional no-cost attachment for the Tallanx-Class Stealth Fighter and the Darvro-Class Light Freighter.[i]\n    ","Source":"Strongholds of Resistance","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":["TALLANX","DARVROLTFR"]},"Rarity":6,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Blocks sensors within range, counting the ship's silhouette as one smaller when being fired upon."},{"Count":1,"MiscDesc":"Immediately notifies all ships in a star system or within 100 kilometers if planetside to the ship or vehicle's existence."}]},"Thumbnail":"img\/no_image.png"},{"Key":"GIMMELSTEALTH","Name":"Gimmellian Stealth Device","Description":"\n      [H3]Gimmellian Stealth Device[h3]\n[P]Reduces the range band of enemy ships’ passive sensors by 1 (to a minimum of close range) for detecting the Tallanx. In order to function, all power from shields and weapons must be channeled into the cloaking device. Rerouting power takes one action.    \n      [P][I]This is an optional no-cost attachment for the Tallanx-Class Stealth Fighter and the Darvro-Class Light Freighter.[i]\n    ","Source":"Strongholds of Resistance","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":["TALLANX","DARVROLTFR"]},"Rarity":9,"Restricted":"true","BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Reduces range band of enemy ships' passive sensors by 1 (to a minimum of close range) for detecting the Tallanx."},{"Count":1,"MiscDesc":"All power for shields and weapons must be rerouted to device for it to work.  Rerouting takes one action."}]},"Thumbnail":"img\/no_image.png"},{"Key":"ELECSIGHTSYS","Name":"Electronic Sighting System","Description":"\n      [H3]Electronic Sighting System[h3]\n[P]By adding a small electronic device to the top of a blaster or other ranged weapon, a small holographic crosshair is projected a meter out from the weapon’s barrel. This increases accuracy by reducing the time it takes for the user to aim. Unfortunately, the holographic crosshair is readily visible to anyone on the weapon’s receiving end, especially in conditions of darkness or low light. This attachment can be used on any ranged weapon that could logically benefit from the addition of a sight.    \n    ","Source":"Strongholds of Resistance","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Ranged"},"Price":500,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Allows shooter to aim as an incidental once per round at short range.  Decreases the difficulty of Perception checks to locate the shooter in low light conditions by 1."}},"AddedMods":{"Mod":{"Key":"ACCURATE","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"SIGRED","Name":"Weapon Signature Reduction","Description":"\n      [H3]Weapon Signature Reduction[h3]\n[P]Both the Empire and the galactic security industry use weapon scanners that are capable of detecting a wide variety of weapon components. Even when broken down into several pieces, blasters and other ranged weapons are still liable to be detected, due to the specific technologies and substances that allow them to function as lethal weapons.\n[P]In order to skirt such inspection and ensure that hidden weapons remain obscured from prying eyes, covert agents have devised modifications that mask or otherwise diminish such signatures in a weapon’s components. Though physical searches still pose some risk of discovery, weapon signature reduction guarantees that scanning equipment used to detect weapons is rendered less effective. Unfortunately, weapon signature reduction is only effective on weapons with an encumbrance rating of 5 or less. ","Source":"Strongholds of Resistance","Custom":"DescOnly","Type":"Weapon","Price":1000,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Increase the difficulty checks using scanners to search for this weapon by 2.  Add [SE] to all Mechanics checks to perform maintenance on this weapon."}},"MaxEnc":3,"Thumbnail":"img\/no_image.png"},{"Key":"CCARRAY","Name":"Cyclic Crystal Array","Description":"\n      [H3]Cyclic Crystal Array[h3]\n[P]Lightsabers rely on kyber crystals attuned to the wielder to create energy blades of different types. Under normal circumstances, swapping out one crystal for another is an arduous process requiring the lightsaver to be disassembled first. Unsatisfied with this situation, a handful of enterprising (if unorthodox) Force users have created attachments that allow for two (or more) crystals to be installed in a single lightsaber. With the press of a button, one crystal is swapped for another, granting unprecendented versatility to lightsaber wielders looking for additional functionality from their otherwise traditional weapon. This attahment can only be applied to lightsabers.","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":1500,"Rarity":8,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"ADDCRYSTNC","Count":1},{"Count":1,"MiscDesc":"When lightsaber is ignited, may choose which active crystal to use.  If already ignited, activating another crystal requires a maneuver."}]},"AddedMods":{"Mod":{"Key":"ADDCRYSTNC","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"EOVERSET","Name":"Energy Overclock Setting","Description":"\n      [H3]Energy Overclock Setting[h3]\n[P]As deadly and dangerous as they are, vibroweapons can be even deadlier with the cinclusion of an overclock setting. By replacing several internal components with precision analogs, a qualified technician can exponentially increase the speed and frequency of a vibroblade's blade action. The result is a vibroweapon that can be charged for amplified cutting power, but at the expenseof causing unpredictable power fluctuations. This attachment can be applied to any vibroweaponand any other powered Melee or Brawl weapon. ","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":["Powered Brawl","Powered Melee"]},"Price":500,"Rarity":5,"HP":3,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Once per turn, spend a maneuver to add Vicious +3 to weapon until end of round.  [TH][TH][TH] or [DE] causes weapon to cease functioning until end of encounter."}},"AddedMods":{"Mod":[{"Count":1,"MiscDesc":"Add automatic Advantage to combat checks with this weapon"},{"Count":1,"MiscDesc":"Activate as an incidental instead of a maneuver"}]},"Thumbnail":"img\/no_image.png"},{"Key":"FORRESON","Name":"Force-Attuned Resonator","Description":"\n      [H3]Force-Attuned Resonator[h3]\n[P]When the Jedi artificer Sokiro Terebin set about reproducing the crystalline, force-attuned resonaters from the blasters she had unearthed at Site-145 on Filata, she first had to solve some numerious technical challenges. During this time, she created a number of internal resonaters that could be housed within a weapon the effectiveness of differnt technologies the ancients might have used. Though she meticulously recorded all of her efforts to create resonators that could be activated only by Force sensitives, the Empire's tumultuous rise to power led the destruction of many repositiories of Jedi lore. During Terebin's lifetime, few Jedi considered these weapons to be serious armaments, but in the dark times of Imperial rule, some Force sensitives might find having a blaster that most people can't operate to be practical. The blueprints persist in certain scholastic records, and the aspiring Force sensitives might be able  to make a use of them. This attachment can be applied to any Ranged (Light) or Ranged (Heavy) weapon that has a trigger.","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":["Pistol","Rifle","Carbine","Heavy Rifle","Heavy Carbine"]},"Price":1000,"Rarity":8,"Restricted":"true","HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Must possess Force Rating 1+ to operate this weapon."}},"AddedMods":{"Mod":{"Key":"PRESSHOT","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"INTILL","Name":"Integrated Illuminator","Description":"\n      [H3]Integrated Illuminator[h3]\n[P]Operating in darkness is never ideal, but there are several ways to compensate for one's lack of night vision. The simplest, perhaps, is to integrate a simple spotlight, similar in most respects to a high-power glow rod, along the length of a ranged weapon's barrel. In addition to providing illumination in dark conditions, high-powered spotlights have the potential to blind enemies. This attachment can be applied to any ranged weapon that could logically benefit from a spotlight.","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Ranged"},"Price":200,"Rarity":4,"HP":1,"Encumbrance":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Removes up to [SE][SE] due to darkness on targets within short range."}},"AddedMods":{"Mod":[{"Count":1,"MiscDesc":"Increase spotlight range to medium"},{"Key":"DISORIENT","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"MAGTETH","Name":"Magnetic Weapon Tether","Description":"\n      [H3]Magnetic Weapon Tether[h3]\n[P]A magnetic weapon tether is a reelatively simple modification that consists of a small magnetic device built into the weapon. The magnetic weapon tether allows the wielder to snap the weapon back to a readied position with a press of a button, rather than havin gto scramble to retrieve it. While many Force users might scoff at this ability - after all, why use a device for what they can do with the force anyway - others prefer to have the exra layer or safety, or wish to avoid using their Force powers openly in places where the Empire's presence is strong. This attachment can be applied to any weapon wielded in one hand that could logically benefit from a weapon tether.","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Weapon","Price":250,"Rarity":2,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Wielder may recover engaged weapon as incidental."}},"AddedMods":{"Mod":{"Key":"QUICKDR","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"KIMBER","Name":"Kimber Stone","Description":"\n      [H3]Kimber Stone[h3]\n[P]Kimber stones are a type of kyber crystal produced by violent volcanic activity on the moon of Y'ness in the N'zoth system. They were once considered unsuitable for use in lightsabers due to the non-lethal nature of the blades they create. Certain Jedi Knights saw potential in kimber stones, and so a number were acquired from Y'ness prior to the destruction of the Jedi Order. Today, kimber stones are occassionally sold at auction on the black market, usually as mere trinkets by those who do not understand their true value as kyber kristals. A kimber stone is a lightsaber crysal. ","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":6500,"Rarity":8,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":9},{"Key":"CRITSET"},{"Key":"STUNDAMAGE"}]},"AddedMods":{"Mod":[{"Key":"DAMADD","Count":2},{"Key":"CONCUSSIVE","Count":1},{"Key":"DISORIENT","Count":2}]},"IsCrystal":"true","Thumbnail":"img\/no_image.png"},{"Key":"SORIAN","Name":"Sorian Crystal","Description":"\n      [H3]Sorian Crystal[h3]\n[P]Though none can confirm accurately from which planet these mysterious stones originate, many traders recognize these gems byy their radiance. Sorian crystals are said to reflect light in swirling, intricate patterns reminiscent of dancing flames. Because of these gems' relative scarcity, few realize that they are in fact kyber cystals. The energy blade formed by a sorian crystal surges briefly with teh power whenever it comes into contact with another object moving at high speed - such as another lightsaber. The slight but sudden jolt  that emanates from the blade is often enough to throw an attacker off balance, giving the wielder a chance for a counterstrike. While this dded resistance also makes it harder to slice apart an opponent in a single stroke over the course of a long duel between skilled fighters, the unique edge it provides can make the difference between life and death. A sorian crystal is a lightsaber crystal. ","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":16000,"Rarity":9,"Restricted":"true","HP":4,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":6},{"Key":"CRITSET","Count":3},{"Key":"BREACH","Count":1},{"Key":"SUNDER"},{"Count":1,"MiscDesc":"When used with the Parry talent, add [BO] to next combat check made against attacker before the end of the next round."}]},"AddedMods":{"Mod":[{"Key":"DAMADD","Count":3},{"Key":"PARRY","Count":1},{"Key":"DISORIENT","Count":1}]},"IsCrystal":"true","Thumbnail":"img\/no_image.png"},{"Key":"SHDISCH","Name":"Shield Discharge Pack","Description":"\n      [H3]Shield Discharge Pack[h3]\n[P]Despite being nearly as ancient as warfare, shields continue to be popular weapons, serving as trusted defenders of warriors on low-tech planets and protecting life and limb of security forces in densely populated areas. While shields are useful weapons already, adding discharge packs to them can allow the wielder to deliver a debilitating shock when delecting a hit. Further, just the sight of a crackling arc of energy wreathing a shield can disturb many would-be attackers, making their strikes far more timid - and far less lethal - than they would have been otherwise. This attachment can only be applied to a shield or buckler.","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Shield"},"Price":800,"Rarity":5,"HP":1,"Encumbrance":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"When wielder suffers hit from Melee, Brawl, or Lightsaber combat check, may spend [TH][TH] or [DE] to cause attacker to suffer 3 strain, ignoring soak."}},"AddedMods":{"Mod":[{"Key":"DISORIENT","Count":2},{"Key":"DEFSTA"}]},"Thumbnail":"img\/no_image.png"},{"Key":"ARMSPIKE","Name":"Armor Spikes","Description":"\n      [H3]Armor Spikes[h3]\n[P]While armor serces a largely defensive role for its wearers, that needn't be the rule. With the addition of spikes, blades, and other protrusions on areas covering shoulders, knuckles, feet, knees or elbows, armor can be turned ino a deadly weapon of last resort. The majority of such modifications are scratch-built, though a handful o f armor manufacturers mass-produce kits for the armor sets they sell. Largely popular with criminals, mercenaries, and bounty hunters, armor spikes lend an intimidating mien to anyone equipped with them. Some professionals prefer to keep such deadl modofications concealed and retractable, and these are perhaps the most dangerous of them all. This attachment can be attached to any armor that covers the arms or legs.      \n    ","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":["Full Body","Half Body"]},"Price":500,"Rarity":2,"HP":3,"BaseMods":{"Mod":[{"Key":"ENCADD","Count":2},{"Count":1,"MiscDesc":"When wearer suffers a hit from a Melee, Brawl, or Lightsaber combat check, may spend [TH][TH][TH] or [DE] to inflict one hit for 6 damage on attacker."}]},"AddedMods":{"Mod":[{"Count":3,"MiscDesc":"Increase damage to attacker by +1"},{"Key":"INTIM"}]},"Thumbnail":"img\/no_image.png"},{"Key":"QUICKSHED","Name":"Quick Shed","Description":"\n      [H3]Quick Shed[h3]\n[P]Armor, especially heavy armor, takes time to put on and take off. though putting armor on remains a chore, taking it off - especially in an emergency situation - is expedited with the quick shed attachment. By installing several quick-release latches at strategic locations, suits of armor can be quickly removed by the wearer. This attachment can only be applied to armor with an encumberance of 3 or higher.","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":"Heavy"},"Price":750,"Rarity":5,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"As a maneuver, wearer by shed the armor.  Armor must be reassembled before donning again, requiring several minutes and an [B]Average ([DI][DI]) Mechanics check[b]."}},"Thumbnail":"img\/no_image.png"},{"Key":"LOWFRIC","Name":"Low-Friction Coating","Description":"\n      [H3]Low-Friction Coating[h3]\nLow-friction coatings work by lowering the coefficient of friction against solid armor plates. With the addition of such a coating, the surface of armor becomes almost impossible to grip or seize. In addition, glancing blows frommelee weapons are often unable to find purchase, which diminishes the damage they cause as they slide off. The only downside to the coating is that is can make working on the armor more difficult, as tools must scramble for a grip on its slick surface. This attachment can only be applied to armor with hard surfaces such as heavy battle armor, powered armor.","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":["Hard","Hard Full Body"]},"Price":2500,"Rarity":7,"HP":2,"Encumbrance":1,"BaseMods":{"Mod":[{"Key":"MELEEDEFADD","Count":1},{"Count":1,"MiscDesc":"Add [SE][SE] to Mechanics checks to modify of maintain armor."}]},"AddedMods":{"Mod":{"Key":"COORD","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"KIIRCOAT","Name":"Kiirium Coating","Description":"\n      [H3]Kiirium Coating[h3]\n      [P] An obselte shielding material once processedin abundance in the Si'klaata Cluster, kiirium was at one time vital to the manufacture of heavy weapons and starships. While largely supplanted by cheaper, more durable alloys, kiirium has properties that make it useful to armorsmiths, who can apply a coating of kiirium to armored plating as a relatively effective thermal shielding. This attachment can only be applied to armor that has hard or solid parts around which the allow can be coated, such as with laminate armor, heavy battle armor, and similar types of armor at the GM's discretion.","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":["Hard","Hard Full Body"]},"Price":2500,"Rarity":7,"HP":2,"Encumbrance":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"+1 soak vs. blaster and flame attacks"}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Decrease the difficulty of Resilience checks made to resist the effects of fire and extreme heat by 1"}},"Thumbnail":"img\/no_image.png"},{"Key":"HARDENED","Name":"Hardened","Description":"\n      [H3]Hardened[h3]\n[P]Power armor relies on its energy source to maintain functionality. If this flow of energy is interrupted by a powerful electromagnetic burst or exposure to ion weapons, the armor losesboth its mobility and its ability to enhance the wearer.  With the armor's vital systems \"hardened\" against such effects, power armor becomes immune to these attacks. Such hardening modifications are weighty, however. Adjustments must be made to nearly every subsystem to prevent even partial shutdowns from taking place. This attachment can only be applied to power armor.     ","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":"Powered"},"Price":900,"Rarity":4,"HP":2,"Encumbrance":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Prevents deactivation of power armor by electromagnetic or ion weapons."}},"Thumbnail":"img\/no_image.png"},{"Key":"REFSHAD","Name":"Reflec Shadowskin","Description":"\n      [H3]Reflec Shadowskin[h3]\n[P]An advanced, light-absorbing polymer that can be applied to armor, refec shadowskin coating can enhance the stealth abilities of its wearer - anyone wearing armor covered in this substance can easily blend into the shadows. While this coating does not make the wearer invisible, it does mean that observers who only catch a glimpse are far less likely to register what they saw or believe it to be anything more than a trick of the light. This attachment can only be applied to armor with a soak of 2 or lower. ","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":"Resistant"},"Price":1200,"Rarity":6,"Restricted":"true","HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Add automatic [AD] to Stealth checks","DieModifiers":{"DieModifier":{"SkillKey":"STEAL","AdvantageCount":1}}}},"AddedMods":{"Mod":[{"Key":"STALK","Count":1},{"Count":2,"MiscDesc":"Add setback to Perception checks to see wearer"}]},"Thumbnail":"img\/no_image.png"},{"Key":"STUNMAT","Name":"Stun Matrix","Description":"\n      [H3]Stun Matrix[h3]\n[P]A stun matrix is an additional defensive option for armor. Instead of enhancing the wearer's defenses directly, it unleashes a punishing pulse of energy that weakens the attacker in the hope of preventing a second strike. Installing this attachment requires the addition of insulation to protect the wearer form the effects of the stun matrix on top of the setup of the self charging battery and of the stun matrix itself. While the device is relatively bulky, it can be concealed if integrated subtly into a heavy armor frame, the better to surprise would-be attackers. This attachment can be applied to any armor that could logically benefit from having a stun matrix added. ","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Armor","Price":1750,"Rarity":3,"HP":3,"BaseMods":{"Mod":[{"Key":"ENCADD","Count":1},{"Count":1,"MiscDesc":"When suffering hit from Melee, Brawl, or Lightsaber combat check, may spend [TH][TH] or [DE] to disorient attacker for 2 rounds."}]},"AddedMods":{"Mod":[{"Count":1,"MiscDesc":"May spend three Threat or Despair to immobilize attacker for 1 rounds"},{"Count":1,"MiscDesc":"May spend Despair to stagger attacker for 1 rounds"}]},"Thumbnail":"img\/no_image.png"},{"Key":"REACPLAT","Name":"Reactive Plating","Description":"\n      [H3]Reactive Plating[h3]\n[P]Reactive plating is a modification that attaches small explosive panels to the armors exterior plates. When hit by an attack, the explosives are designed to detonate outward, absorbing some of the attacks kinetic energy with the counter-explosion. It is not typically used on a personal scale, but microrepulsors and other, similar technologies allow it to be integrated into certain heavier varieties of personal armor and to function at considerable effectiveness without harming the wearer in the process. Employed properly, reactive armor can even deflect or dampen blows from weapons that would cleave through other defenses, like lightsabers. Besides the considerable weight it adds to any set of armor, an unfortunate side-effect of reactive armor is that it destroys itself as it protects the individual inside. It causes the armor to degrade far more rapidly than it would have otherwise would, which means that the wearer must repair it far more often. This attachment can only be applied to armor with a soak of 2 or higher.  ","Source":"Keeping the Peace","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":"Resistant"},"Price":2000,"Rarity":6,"HP":4,"BaseMods":{"Mod":[{"Key":"ENCADD","Count":4},{"Count":1,"MiscDesc":"First time wearer is hit each encounter, reduce damage by 10.  After, armor suffers minor damage and must be repaired to function again."}]},"AddedMods":{"Mod":{"Key":"ENCSUB","Count":3}},"Thumbnail":"img\/no_image.png"},{"Key":"LTSABERCONST","Name":"Lightsaber Hilt Construction Modifications","Description":"\n      [H3]Lightsaber Hilt Construction Modifications[h3]\n      Use this attachment to reflect the results of a lightsaber hilt construction check, as required.","Source":"Force and Destiny Game Master's Kit","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber Hilt"},"AddedMods":{"Mod":[{"Key":"HPADD","Count":4},{"Key":"HPSUB","Count":4},{"Key":"ENCSUB","Count":4},{"Key":"ENCADD","Count":4}]},"Thumbnail":"img\/no_image.png"},{"Key":"ENGINERING","Name":"Engine Ring Stabilizer","Description":"\n      [H3]Engine Ring Stabilizer[h3]","Source":"Mask of the Pirate Queen","Custom":"DescOnly","Type":"Vehicle","Price":1200,"Rarity":5,"HP":1,"BaseMods":{"Mod":{"Key":"HANDLINGADD","Count":2}},"MustBeStarship":"true","MinSize":3,"PriceSizeMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"SLICCOMP","Name":"Slicing Computer","Description":"[H3]Slicing Computer[h3]\nAlthough most starships include sophisticated computers and comm equipment capable of slicing into the systems of enemy vessels, such electronic warfar tactics are usually overlooked in favour of more  conventional attacks. However, some crews undertake efforts to upfrade their on-board systems for precisely the kind of work. With the right equipment  and software, a skilled computer expert can cecome one of the most vaulable crew members in a space battle. Many Technicians continue to tinker with and add to the ship's computer systems over time, sometimes to the confusion and frustration of other crew. This attachment can be applied to any starship.\n[P][B]Models Include:[b] Various Custome Models","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","Price":5000,"Rarity":6,"HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Counts as slicer gear that can be used by one passenger."},{"Count":1,"MiscDesc":"Add automatic [AD] to Computers checks made to slice enemy ships' systems."}]},"AddedMods":{"Mod":[{"Key":"COD","Count":1},{"Key":"DEFSLI","Count":1}]},"MustBeStarship":"true","Thumbnail":"img\/no_image.png"},{"Key":"SECTRANSP","Name":"Secondary Transponder","Description":"[H3]Secondary Transponder[h3]\nAlthough it is possible to modify a ship's transponder signal, doing so is either easily detected or risks damaging the engines, depending on the method used. Mounting a secondary transponder to the engine is a one-time modification that allows the ship's crew to thereafter switch between two identities. When activated the secondary transponder overrides the data signal from the ship's primary transponder, while also generating an energy signature that disguises the activity of the ship's engine (these are the twp parts of a transponder signal). The cost of this attachment includes a false or stolen identity in Bureau of Ships and Services (BoSS) records. This attachment can be applied to any starship.\n[P][B]Models include:[b] Various Illicit Models","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","Price":20000,"Rarity":7,"Restricted":"true","HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Crew can switch to the secondary transponder as an action, making an [B]Average ([DI][DI]) Computers check[b]."},{"Count":1,"MiscDesc":"An observer who scans the ship can detect discrepancies indicating the presence of a secondary transponder with a [B]Daunting ([DI][DI][DI][DI]) Computers check[b]."}]},"AddedMods":{"Mod":[{"Count":1,"MiscDesc":"Activate secondary transponder as a maneuver"},{"Count":3,"MiscDesc":"Add one additional ship identity"}]},"MustBeStarship":"true","Thumbnail":"img\/no_image.png"},{"Key":"SECMEAS","Name":"Security Measures","Description":"[H3]Security Measures[h3]\nThere are few things to befall a ship owner more dreaded than to have a craft disappear from an unsecured landing pad. Even aside from the threat of theft, there are many reasons why a crew might want to keep uninvited guests off their ship while it's unattended - especially for any crew engaged in less-than-legal pursuits. Upgraded mag-locks, decoy control panels, reinforced hatches and enhanced security protocols can ensure that a ship goes undisturbed while at port. This attachment can be applied to any vehicle or starship.\n[P][B]Models Include:[b] Corellian Engineering Corporation SecurePro, Kuat Drive Yards LockDown Plus","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","Price":500,"Rarity":4,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Upgrade the difficulty Computers and Skulduggery checks made to gain unauthorized access to the ship twice."}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Add setback to Computers and Skulduggery checks made to gain unauthorized access to thei ship"}},"PriceSizeMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"OVERCHIONENG","Name":"Overcharged Ion Engines","Description":"[H3]Overcharged Ion Engines[h3]\nPeople living on the fringes of galactic society - and those involved in criminal pursuits, in particular - often need to move more quickly when things turn bad. Overcharged ion engines allow a ship to accelerate more quickly, but tend to be damaging to ship systems over time. Many shipwrights view the use of such modifications as mistreatment of their works, but some pilots swear by the edge it gives them. This attachment acan be applied to any starship of silhouette 3 or smaller.\n[P][B]Models Include:[b] Gallofree Yards Option-3 Acceleration Optimizer, Various Custom Models.","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","Price":9500,"Rarity":4,"HP":3,"BaseMods":{"Mod":[{"Key":"SPEEDADD","Count":1},{"Key":"HANDLINGSUB","Count":1}]},"AddedMods":{"Mod":[{"Key":"SHORTCUT","Count":1},{"Key":"TRICK"}]},"MustBeStarship":"true","MaxSize":3,"Thumbnail":"img\/no_image.png"},{"Key":"PSEUDCLOAK","Name":"Pseudo-Cloaking Device","Description":"[H3]Pseudo-Cloaking Device[h3]\nWhile true cloaking devices are all but unhead of and limited to capital ships, so-called \"pseudo-cloaks\" incorporate an array of electronic masking devices and countermeasures to render a ship almost invisible to sensors. However, such devices have no visual effect, limiting their usefulness in close-range engagements. This attachment can be applied to any vehicle or starship.\n[P][B]Models Include:[b] Fabritech Gx-3 Sensor Screen, Sienar Intelligence Systems Electronic Masking System","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","Price":12000,"Rarity":8,"Restricted":"true","HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Increase the difficulty of checks to detect the ship with sensors by two."},{"Count":1,"MiscDesc":"Upgrade the difficulty of all combat checks once against the ship at Short range or further."}]},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Add setback to combat checks targetting ship at Short range or further"}},"Thumbnail":"img\/no_image.png"},{"Key":"GUNNBRAIN","Name":"Gunnery Droid Brain","Description":"[H3]Gunnery Droid Brain[h3]\nMuch more than a simiple targeting computer, a specialized droid brain can be installed on a ship to operate its weapons indepedantly or assist a sentient gunner. Although GoCorp's CD-14c model continues to prove popular with Technicians who want their ship to defend itself when necessary, some users complain of the droid's overly hostile antagonistic behaviour. GoCorp continues to deny rumours of so-called \"unanticipated activations\". This attachment can be applied to any vehicle or starship.\n[P][B]Models Include:[b] GoCorp's CD-14c","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","Price":7000,"Rarity":6,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Add a droid brain with Gunnery 2 and Agility 0.","InnateSkills":{"InnateSkill":{"SkillKey":"GUNN","SkillRank":2}}}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Increase the droid brain's Gunnery skill by 1","InnateSkills":{"InnateSkill":{"SkillKey":"GUNN","SkillRank":1}}}},"Thumbnail":"img\/no_image.png"},{"Key":"LASFOCUS","Name":"Laser Focusing Array","Description":"[H3]Laser Focusing Array[h3]\nLaser cannons are the mainstay weapons of many ships, and manufacturers constantly compete to outdo each other in their products' power, accuracy, and rate of fire. As well as consistently bringing new models to market, some manufacturers produce aftermarket upgrades to improve performance. Of course, many Technicians find their own ways to improve weapons systems through - often dangerous - tinkering, This attachment can be applied to any starship.\n[P][B]Models Include:[b] Taim & BAck G-1 Enchanced Laser Focusing Array, Loronar Corporations Mk III Optimized Galven Coils","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","Price":3000,"Rarity":6,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Add automatic [AD] to combat checks made with the ship's laser cannons and turbolasers."}},"MustBeStarship":"true","PriceWeponCatMult":"Laser","Thumbnail":"img\/no_image.png"},{"Key":"ENCRYCOMP","Name":"Encrypted Computer","Description":"[H3]Encrypted Computer[h3]\nA skilled Slicer knows how to protect a computer system from others skilled in electronic skulduggery, and is likeley to take steps to do just that. Whether consisting of modifications and programming by a crew member or of specialized softwar purchased on teh black market, encrypted systems can protect a ship agains slicing attacks at port and during battle. In addition to preventing catastrophes during skirmishes, the extra security is of great use to any group that wants to keep its data private. This attachment can be applied to any vehicle or starship.\n[B][P]Models Include:[b] Numerous Custom Variants","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","Price":1000,"Rarity":6,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Upgrade difficulty of all Computers checks made to slice the ship's computer system once."}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Add setback to Computers checks made to slice the ship's computer systems"}},"Thumbnail":"img\/no_image.png"},{"Key":"ENHREPULS","Name":"Enhanced Repulsorlift","Description":"[H3]Enhanced Repulsorlift[h3]\nAs one might well guess from their name, speeders are swift craft by nature. For some pilots, however, there is no such thing as a enough speed. Enhancements and modifications to repulsorlift systems can often coax extra acceleration out of factory-standard models, despite the fact that manufacturers caution against making such dangerous customizations to their vehivles. The attachment can be applied to any airspeeder or landspeeder.\n[P][B]Models Include:[b] Ubikkian Transports Ultralift 2000","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":["Airspeeder","Landspeeder"]},"Price":1000,"Rarity":3,"HP":1,"BaseMods":{"Mod":[{"Key":"SPEEDADD","Count":1},{"Key":"HANDLINGSUB","Count":1}]},"AddedMods":{"Mod":{"Key":"DEFDRI","Count":1}},"PriceSizeMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"AMPHIBMOD","Name":"Amphibious Modification","Description":"[H3]Amphibious Modification[h3]\nMost starships, speeders and other vehicles not specifically designed for it are unfit for usage underwater. Starships are typically not hydrodynamic, and hills designed for zero gravity and atmospheric use can suffer damage from deep-sea pressure. However, with the addition of turbines, moidifications to the engines and reinforcement of the structure  almost any vehicle can be made seaworthy. This attachment can be applied to any vehicle or starship that can enter an atmosphere.\n[P][B]Models Include:[b] Various Custom Models","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","CategoryLimit":{"Category":["Air Vehicle","Starship"]},"Price":1000,"Rarity":5,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Vehicle can operate underwater without penalty."}},"MaxSize":6,"PriceSizeMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"DECOYBUOY","Name":"Decoy Buoy","Description":"[H3]Decoy Buoy[h3]\nA favourite of scoundrels and pirates, decoy buoys are oftern devices cobbled together from salvaged parts, including transponders and comm systems. Although it might visually resemble nothing so much as a cylinder - or amalgamation of scrap parts - a meter or so across, a well constructed decoy buot transmits a transponder signal, emits ion streams and outputs other data and signals associated with starships. This attachment can be applied to any starship.\n[P][B]Models Include:[b] Numerous custom variants","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","Price":5000,"Rarity":5,"Restricted":"true","BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Buoy may be jettisoned as an action."},{"Count":1,"MiscDesc":" Buoy can be programmed with a specific transponder code with a [B]Hard ([DI][DI][DI]) Computers check[b]."},{"Count":1,"MiscDesc":"Buoy can be set to transmit a distress signal or other data."},{"Count":1,"MiscDesc":"A character operating ship sensors must make a [B]Hard ([DI][DI][DI]) Computers check[b] to identify that the buoy is not an actual ship."},{"Count":1,"MiscDesc":"After being jettisoned, buoy no longer counts as being attached to the ship until it is reattached."}]},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Add setback to Computers checks to identify the buoy"}},"Thumbnail":"img\/no_image.png"},{"Key":"AD15BOOSTTHRUST","Name":"(AD-15) Sublight Boost Thrusters","Description":"[H3]Sublight Boost Thrusters for AD-15[h3]\nThe craft's engines can be equipped with sublight boosters which considerably increase their output. Flying at higher speeds also makes the vehicle harder to handle in rough conditions such as asteroid fields, but when outrunning a patrol boat or pirate vessel, it can be the difference between life and death.\n[P][H4]<font size=1>Please see page 63 of the Special Modifications Sourcebook for details.<\/font>[h4]","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD15MOD"},"Price":9000,"Rarity":7,"HP":2,"BaseMods":{"Mod":[{"Key":"SPEEDADD","Count":1},{"Key":"HANDLINGSUB","Count":1}]},"AddedMods":{"Mod":{"Key":"SPEEDADD","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"USERATTACH3","Name":"(AD-15) Hyperdrive Class 4 Module","Description":"[H3]Hyperdrive Class 4 Module for AD-15[h3]\nInstalling a hyperdrive, even a relatively low-grade one, in an AD-15 takes up a good deal of space inside of the craft, but also allows it to operate independently. Fo many mercenaries, bounty hunters and other frequent travelers, such an upgrade is well worth the cost.\n[P][H4]<font size=1>Please see page 63 of the Special Modifications Sourcebook for details.<\/font>[h4]","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD15MOD"},"Price":5000,"Rarity":9,"HP":4,"BaseMods":{"Mod":[{"Key":"HYPERDRIVEADD4"},{"Count":1,"MiscDesc":"Add astromech droid socket."}]},"AddedMods":{"Mod":{"Key":"HYPERDRIVESUB5","Count":4}},"Thumbnail":"img\/no_image.png"},{"Key":"AD15SHIELD","Name":"(AD-15) Shield Generator Module","Description":"[H3]Shield Generator Module  forAD-15[h3]\nMany fightercradt lack shields, including most of the Galactic Empire's TIE Series. Of course, many pilots view going into battle without shields as a sure sign of a death wish, Soldiers of fortune and others who fight for credits rather than ideology tend to prefer the thought of living to get paid to the prospect of dying gloriously for some intagible ideal, and so the highly customizable AD-15 can be fitted with shield generators to improve its durability.\n[P][H4]<font size=1>Please see page 63 of the Special Modifications Sourcebook for details.<\/font>[h4]","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD15MOD"},"Price":8000,"Rarity":6,"HP":3,"BaseMods":{"Mod":{"Key":"DEFZONEADD","Count":1}},"AddedMods":{"Mod":{"Key":"DEFZONEADD","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"AD15MICROTHRUST","Name":"(AD-15) Fine-Tuned Microthrusters","Description":"[H3]Fine-Tuned Microthrusters for AD-15[h3]\nThe AD-15 is already a relatively maneuverable craft, but installing and personalizing an array of small vectors adjustments thrusters allows it to complete with many of the galaxy's nimblest starfighters.\n[P][H4]<font size=1>Please see page 63 of the Special Modifications Sourcebook for details.<\/font>[h4]","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD15MOD"},"Price":3000,"Rarity":6,"HP":2,"BaseMods":{"Mod":{"Key":"HANDLINGADD","Count":1}},"AddedMods":{"Mod":{"Key":"HANDLINGADD","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"AD15HYPER","Name":"(AD-15) Hyperdrive Class 8 Module","Description":"[H3]Hyperdrive Class 8 Module for AD-15[h3]\nInstalling a hyperdrive, even a relatively low-grade one, in an AD-15 takes up a good deal of space inside of the craft, but also allows it to operate independently. Fo many mercenaries, bounty hunters and other frequent travelers, such an upgrade is well worth the cost.\n[P][H4]<font size=1>Please see page 63 of the Special Modifications Sourcebook for details.<\/font>[h4]","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD15MOD"},"Price":3000,"Rarity":6,"HP":4,"BaseMods":{"Mod":[{"Key":"HYPERDRIVEADD8"},{"Count":1,"MiscDesc":"Add astromech droid socket."}]},"AddedMods":{"Mod":{"Key":"HYPERDRIVESUB5","Count":4}},"Thumbnail":"img\/no_image.png"},{"Key":"AD15CARGOPOS","Name":"(AD-15) Cargo Pod","Description":"[H3]Cargo Pod for AD-15[h3]\nThe cargo pods for this cradt are large, cylindrical affairs, designed for efficiency, not aesthetics. These pods can even be retrofitted to carry passengers, though they do not make for comfortable quarters.\n[P][H4]<font size=1>Please see page 62 of the Special Modifications Sourcebook for details.<\/font>[h4]","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD15MOD"},"Price":1400,"Rarity":2,"HP":2,"BaseMods":{"Mod":{"Key":"ENCCADD","Count":50}},"AddedMods":{"Mod":{"Key":"PASSADD2","Count":3}},"Thumbnail":"img\/no_image.png"},{"Key":"ALLTERLEGS","Name":"All-Terrain Legs","Description":"[H3]All-Terrain Legs[h3]\nAlthough ion drives and repulsorlifts dominate the galaxy, the continued use of walkers by the Empire and certain planetary militias is testament tot eh advantages of such craft. Walkers are stable, implacable and usually intimidating. For those who want true versatility from their craft, speeders and eve starships can be modified with the addition of a number, depending on the size and shape of the vehicle, of sturdy mechanical legs. In some cases, these might be mistaken for simple landing gear - until the vehivle begins to stomp forward. This attachment can be applied to any airspeeder or starship that can land on a planet.\n[P][B]Models Include:[b] Kuat Drive Yards KR-2 \"Crab\" Auxiliary Locomotion Unit, Alto Industries Variable Combat Kit","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","CategoryLimit":{"Category":["Air Vehicle","Starship"]},"Price":3000,"Rarity":5,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"As a maneuver, pilot may shift in or out of walker mode.  In walker mode, pilot uses Piloting (Planetary) and speed is reduced to 2."}},"AddedMods":{"Mod":[{"Count":2,"MiscDesc":"Remove setback from Piloting (Planetary) checks due to difficult terrain"},{"Count":2,"MiscDesc":"Remove setback from Gunnery checks due to cover or terrain"}]},"MaxSize":6,"PriceSizeMult":"true","Thumbnail":"img\/no_image.png"},{"Key":"RADSHIELD","Name":"Radiation Shielding","Description":"[H3]Radiation Shielding[h3]\nThe galaxy contains many perils, but one of the most common is radiation. From the depths of space to polluted industrial zones, radiation hazards both natural and artificial are a frequent threat to spacers. Although spacesuits provide a degree of protection and specialiszed hazard suits are available, some individuals prefer to also be protected from blaster bolts and blades. A variety of polymers, reflective coatings, and energy dampeners can be fitted or applied to armour to provide protection from radiation. This attachment can only be applied to laminate armor, heavy battle armor, and any other armor that can be fully sealed.\n[P][B]Models Include:[b] Loronar Model 4 Hostile Environment Treatment, Neuro-Saav Radiological Hazard Shielding.","Source":"Special Modifications","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":["Sealable","Sealed"]},"Price":500,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Add [BO][BO] to Resilience checks to resist radiation."}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Increase armor's soak by 1 against damage caused by radiation"}},"Thumbnail":"img\/no_image.png"},{"Key":"REINFGAUNT","Name":"Reinforced Gauntlets","Description":"[H3]Reinforced Gauntlets[h3]\nAdditional armor plating on the hands is a valuable upgrade for those who gavour heavier armor, as well as those who do welding jobs on starships and desire to keep all of their fingers. Not only does such extra plating provide additional protection, but it ensures that the wearer is never unarmed; after all, the guantles are heavy enough to shatter bones when used to deliver a punch. It also helps protect the user's hands in case they are ever stuck closing a blast door or shocked by a loose wireing while performing battlefield repairs. This attachment can be applied to any  armor with soak 2 or higher.\n[P][B]Models Include:[b] Various models","Source":"Special Modifications","Custom":"DescOnly","Type":"Armor","Price":250,"Rarity":2,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"May use gauntlets as a melee weapon."}},"AddedMods":{"Mod":{"Key":"DURA","Count":1}},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Reinforced Gauntlets","SkillKey":"MELEE","DamageAdd":1,"Crit":4,"Qualities":{"Quality":{"Key":"DISORIENT","Count":3}},"Range":"Engaged"}},"MinSoak":2,"Thumbnail":"img\/no_image.png"},{"Key":"INTSLICGEAR","Name":"Integrated Slicer Gear","Description":"[H3]Integrated Slicer Gear[h3]\nSlicers must often conduct their work under strict time constraints and less than ideal conditions. By integrating a customized computer, dataports and gesture interface circuitry into worn armour, a slicer can ensure that the tools of the trade are always at hand and almost impossible to lose. A visor-mounted heads-up display or holographic image streams the data the slicer needs, while specially designed gloves or guantlets allow the slicer to manipulate code using nothing more than gestures and brief voice commands. This attachment can be applied to any armor.\n[P][B]Models Include:[b] MerenData Mobile XR-1, numerous custom variants","Source":"Special Modifications","Custom":"DescOnly","Type":"Armor","Price":750,"Rarity":6,"HP":3,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Counts as having Slicer Gear.  Can be controlled by gesture or voice."}},"AddedMods":{"Mod":{"Key":"TECHAPT","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"IONSHIELD","Name":"Ion Shielding","Description":"[H3]Ion Shielding[h3]\nRarely encountered in doby armor and more commonly (and usually illegally) applied directly to droid shssis, ion shielding provides protection agains ionization blasters. Although the mitigation it grants is far from complete, the energy-dampening effects can keep a droid operational where it would otherwise be shutdown. This attachment can be applied to any armor with soak 2 or higher.\n[P][B]Models Include:[b] Outlaw Tech Ion Shielding, Industrial Automaton Mk. III Ion Guard","Source":"Special Modifications","Custom":"DescOnly","Type":"Armor","Price":2000,"Rarity":7,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Increase soak by 3 against weapons with Ion quality."}},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"Increase ranged and melee defense by 1 against weapons with Ion quality"}},"MinSoak":2,"Thumbnail":"img\/no_image.png"},{"Key":"CUSTOMFIT","Name":"Custom Fit","Description":"[H3]Custom Fit[h3]\nAlthough standard \"off-the-shelf\" armor can provide invaluable protection, it can also prove bulky or awkward, even adter adjustments. For those who require their armor to feel like a second skin, personalized customization can make a drastic difference. Such  work requires a skilled armorer, but it can make body armor a much more enticing option for some. This attachment can be applied to any armor.\n[P][B]Models Include:[b] Numerous variants","Source":"Special Modifications","Custom":"DescOnly","Type":"Armor","Price":400,"Rarity":3,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Removes [SE] from Athletics and Stealth checks."}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Remove an additional setback from Athletics and Stealth checks"}},"Thumbnail":"img\/no_image.png"},{"Key":"INTASCGEAR","Name":"Integrated Ascension Gear","Description":"[H3]Integrated Ascension Gear[h3]\nIncorporating a grapnel launcer, line, clips and other climbing and rappelling equipment directly into a set of armor ensures that the user is always prepared to ascend or descend sheer surfaces in a hurry. Whether to escape from pursuers, follow a target, infiltrate a secure building or exfiltrate from a dangerous situation, ascension gear  can prove invaluable in a variety of situations. In addition, having the grapnel and line integrated directly into one's armor provides a high degree of safety and security. This attachment can be applied to any armor.\n[P][B]Models Include:[b] TaggeCo Integrated Ascension Unit, VargeCorp ClimbAll Armor.","Source":"Special Modifications","Custom":"DescOnly","Type":"Armor","Price":350,"Rarity":3,"HP":2,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"As an action, may make an [B]Average ([DI][DI]) Ranged (Light) check[b] to secure grappling hook to an object within medium range and reel in cord."},{"Count":1,"MiscDesc":"May pull another character aloft by making an [B]Easy ([DI]) Athletics check[b]."}]},"Thumbnail":"img\/no_image.png"},{"Key":"VIBBAY","Name":"Vibro-Bayonet","Description":"[H3]Vibro-Bayonet[h3]\nAlthough most fights are resolved with exchanges of blaster fire, a close-range firefight can quickly turn into a melee. When this happens, it pays to be prepared. Because the time it takes to draw a blade can mean the difference between life and death, some spacers equip their blasters with vibro-bayonets, essentially vibroblades mounted on the barrel of a gun. While a vibro-spear is not many Technicians' weapon of choice, having one at hand is considerably better than being effectively unarmed when combat takes place in such cramped quarters as teh belly of a starship. This attachment can be applied to any Ranged (Heavy) weapon that could be logically mount a bayonet.\n[P][B]Models Include:[b] Czerka Arms \"Last Resort\" Vibro-Bayonet, Merr-Sonn Model 3 Combat Attachment","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":"RANGHVY"},"Price":500,"Rarity":3,"HP":1,"Encumbrance":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Adds a vibro-bayonet to the weapon"}},"AddedMods":{"Mod":{"Key":"DAMADD","Count":2}},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Vibro-Bayonet","SkillKey":"MELEE","DamageAdd":1,"Crit":2,"Qualities":{"Quality":[{"Key":"INACCURATE","Count":1},{"Key":"PIERCE","Count":2},{"Key":"VICIOUS","Count":1}]},"Range":"Engaged"}},"Thumbnail":"img\/no_image.png"},{"Key":"AMPHMOD","Name":"Amphibious Modification","Description":"[H3]Amphibious Modification[h3]\nMany worlds are covered in cast oceans and no few species have evolved in aquatic environments. Forthose sentients without the evolutionary adaptation of gills, specialized equipment is necessary. With the addition of a sealed helmet and oxygen (or other appropriate gas) supply, nearly any suit of armor can be converted into an amphibious suit. Retractable flippers provide humanoids with improved mobility in water and other liquids. This attachment can be applied to any armor that could logically have an air tank attached.\n[P][B]Models Include:[b]Gandorthal Atmospherics Submerible 9, BioTech Mk. II Air Supply","Source":"Special Modifications","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":["Sealable","Sealed"]},"Price":500,"Rarity":4,"HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Provides up to five hours of oxegen in submersive or airless environments.  Does not protect against vacuum."},{"Count":1,"MiscDesc":"Removes [SE] from physical checks due to underwater conditions."}]},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Increase oxegen supply by two hours"}},"Thumbnail":"img\/no_image.png"},{"Key":"STRIPDOWN","Name":"Stripped Down","Description":"[H3]Stripped Down[h3]\nBy removing redundant components and stripping down the body, it is possible to significantly reduce the weight and profile of a blaster or other weapon. A weapon modified this way is more easily carried and transtported and can be better hidden under a coat or among other equipment. THe attachment can be used with any Ranged (Light) or Ranged (Heavy) weapon.\n[P][B]Models Include:[b] None","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":["RANGHVY","RANGLT"]},"Price":250,"Rarity":4,"HP":3,"BaseMods":{"Mod":[{"Key":"ENCSUB","Count":1},{"Count":1,"MiscDesc":"Add [SE] to Perception checks to find the weapon when hidden."}]},"AddedMods":{"Mod":{"Key":"ENCSUB","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"GRAPNEL","Name":"Under-Barrel Grapnel Launcher","Description":"[H3]Under-Barrel Grapnel Launcher[h3]\nOften seen among mercenary and special operations forces, an under-barrel grapnel launcher provides a quick way to scale sheer surfaces in the midst of a combat situation or during a covert infiltration. A durasteel hook, possibly with a mono-molecular point, can find purchase on nearly any surface, while a spool of synthrope or liquid cable provides up to 100 meters of length. A powerful motor automatically retracts the cable, pulling the user up - though holding onto any passengers who are along for the ride is a more difficult matter, and requires some effort on part of the user. This attachment can be used with any Ranged (Light) or Ranged (Heavy) weapons that could logically have a grapnel launcher mounted on it.\n[P][B]Models Include:[b] Merr-Sonn KR-2 Auxiliary Grapnel, TaggeCo \"Skysailer\" Grapnel Launcher","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":["RANGHVY","RANGLT"]},"Price":500,"Rarity":3,"HP":2,"Encumbrance":2,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"As an action, may make an [B]Average ([DI][DI]) Ranged (Light) check[b] to secure grappling hook to an object within medium range and reel in cord."},{"Count":1,"MiscDesc":"May pull another character aloft by making an [B]Average ([DI][DI]) Athletics check[b]."}]},"Thumbnail":"img\/no_image.png"},{"Key":"IONBLAST","Name":"Secondary Ion Blaster","Description":"[H3]Secondary Ion Blaster[h3]\nA secondary ion blaster provides an extra level of offense for those expecting run-ins with droids. Many Technicians prefer to take enemy droids intact, the better to \"recruite\" them or even scavenge for parts later. An ion blaster mounted alongside another weapon provides just that option. This attachment can be used with any Ranged (Heavy) weapon.\n[P][B]Models Include:[b] SoroSuub Droid Defender, BlasTech Model 9 Under-Barrel Ion Blaster","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":"RANGHVY"},"Price":400,"Rarity":6,"HP":2,"Encumbrance":2,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Adds an ion blaster to the weapon."},{"Key":"CUMBERSOME","Count":1}]},"AddedMods":{"Mod":{"Key":"DAMADD","Count":2,"WeaponModifierIndex":0}},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Secondary Ion Blaster","SkillKey":"RANGHVY","Damage":10,"Crit":5,"Qualities":{"Quality":[{"Key":"DISORIENT","Count":5},{"Key":"ION"}]},"RangeValue":"wrShort","Range":"Short"}},"Thumbnail":"img\/no_image.png"},{"Key":"SONICSCOPE","Name":"Sonic Scope","Description":"[H3]Sonic Scope[h3]\nOriginally developed to overcome personal cloaking devices and other sensor-baffling defences, a sonic scope uses ultrasonic sound waves to detect a target and generate a visual representation. With proper calibration, the sonar waves can be set to pass through even duracrete and other solid surfaces. This attachment can be used with any Ranged (Heavy) weapon.\n[P][B]Models Include:[b] CryonCorp PL-1 \"Second Sight\" Scope, SoroSuub Model Z Integrated Sonar System","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":"RANGHVY"},"Price":1500,"Rarity":8,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"May observe and target enemies who are completely hidden by solid objects."}},"AddedMods":{"Mod":[{"Key":"COOL","Count":1},{"Key":"VIGIL","Count":1},{"Key":"PRECAIM","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"RAPRECXC","Name":"Rapid-Recharge XCiter","Description":"[H3]Rapid-Recharge XCiter[h3]\nSpeciffically modified gas conversion enablers can allow a blaster pistol or rifle to achieve much higher rates of fire than those of a true repeating blaster. Along with modifying or replacing the XCiter, and potentially the blaster actuating module. Technicians making heavy modifications to a blaster also often modify the trigger to allow for fully automatic fire when the user keeps it depressed. Such high rates of fire mean a considerable loss in accuracy. Nevertheless, the advantages offered by a rapid-fire weapon outweigh these drawbacks for some users. This attachment can be applied to any blaster.\n[P][B]Models Include:[b] BlasTech XCelerator, SoroSuub M-3 Recycling Module, various custom models.","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Blaster"},"Price":750,"Rarity":7,"HP":1,"BaseMods":{"Mod":[{"Key":"AUTOFIRE"},{"Key":"INACCURATE","Count":3}]},"AddedMods":{"Mod":{"Key":"SUBQUALINACCURATE","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"REMSAFFEAT","Name":"Removed Safety Features","Description":"[H3]Removed Safety Features[h3]\nBy removing or deactivating weapon safeties and other features a gun can more easily be drawn and readied for combat. Of course, these safety features are in place for a reason, and weaponsn modified in such a way tend to be more accident prone. This attachment can be applied to any Ranged (Light) or Ranged (Heavy) weapon that could logically have such elements to remove.\n[P][B]Models Include:[b] None","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":["RANGHVY","RANGLT"]},"Price":250,"Rarity":2,"Restricted":"true","BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Adds [BO] to first combat check during an encounter."},{"Count":1,"MiscDesc":"GM may spend [TH][TH] to cause misfire.  Weapon runs out of ammo and inflicts 4 strain on wielder."}]},"Thumbnail":"img\/no_image.png"},{"Key":"OPTENERGCELL","Name":"Optimized Energy Cell","Description":"[H3]Optimized Energy Cell[h3]\nAn optimized energy cell or expanded gas reserve allows a blaster to achieve a much higher number of shots before needing to reload, thanks to more efficent use of resources. Such modifications are often the result of excessive tinkering, rather than off-the-shelf models. This attachmentcan be applied to any energy weapon.\n[P][B]Models Include:[p] Czerka Arms Model 4 Expanded Gas Reservoir, Blastech X-3 Extended Energy Cell","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Energy Weapon"},"Price":100,"Rarity":5,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"When GM spends [DE] or [TH] to cause the weapon to run out of ammo, it requires an additional [TH]."}},"Thumbnail":"img\/no_image.png"},{"Key":"OVERACTMOD","Name":"Overcharged Actuating Module","Description":"[H3]Overcharged Actuating Module[h3]\nAn overcharged blaster actuating module provies for a more powerful shot at the cost of a greater use of gas as well as increased wear and tear on the weapon. For some spacers, these drawbacks are woth the extra firepower. Although some kits are available for purchase many Technicians achieve the same result by scavenging parts from higher yield blaster. This attachment can be applied to any blaster pistol or carbine.\n[P][B]Models Include:[b] BlasTech Mk. II Actuating Module, SoroSuub BlastPro","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":["Blaster Pistol","Carbine"]},"Price":650,"Rarity":7,"HP":1,"BaseMods":{"Mod":[{"Key":"DAMADD","Count":1},{"Count":1,"MiscDesc":"GM may spend [TH][TH] to damage weapon by one step."}]},"AddedMods":{"Mod":{"Key":"DAMADD","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"GYROSTAB","Name":"Gyrostabilizer","Description":"[H3]Gyrostabilizer[h3]\nA gyrostabilizer, or repulsorlift harness, artificially reduces the weight of  the weapon, allowing a user to heft and aim a heavy weapon with decreased difficulty. With such a modification, a single combatant can operate a weapon that normally requires a team of two. These sophisticated devices are comparatively expensive and rare, and thus are seldom seen outside of elite forces. This attachment can be applied to any Ranged (Heavy) or Gunnery Weapon.\n[P][B]Models Include:[b] TaggeCo Type 2 Repulsorlift Harness, BlasTech Mk. IV Gyrostabilization Unit","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":["RANGHVY","GUNN"]},"Price":1000,"Rarity":6,"HP":2,"BaseMods":{"Mod":{"Key":"SUBQUALCUMBERSOME","Count":1}},"AddedMods":{"Mod":[{"Key":"SUBQUALCUMBERSOME","Count":3},{"Key":"BAR","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"INTSCAN2","Name":"Integrated Scanner","Description":"[H3]Integrated Scanner[h3]\nA scanner incorporated into a weapon allows the user to keep a rifle readied while constantly monitoring the surrounding area for danger. Specialized units might detect life signs, movement, or the energy cells of weapons. The battlefield awareness added by such a device can make the difference between victory and defeat. This attachment can be applied to any Ranged (Heavy) weapon.\n[P][B]Models Include:[b] Carbanti United Electronics Mk. II Omni-Scope, CryonCorp \"Heads-Up\" Scanner Suite","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":"RANGHVY"},"Price":675,"Rarity":5,"HP":2,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Weapon incorporates a general-purpose scanner."},{"Count":1,"MiscDesc":"Wielder adds automatic [AD][AD] to Initiative checks while weapon is drawn."}]},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Remove 1 setback die from Initiative checks"}},"Thumbnail":"img\/no_image.png"},{"Key":"CUSTGRIP","Name":"Custom Grip","Description":"[H3]Custom Grip[h3]\nA skilled tinkerer can tailor a weapon to perfectly fit its weilder's hand. A custom grip is cradted to uniquely match its owner, allowing the weapon to act as an extension of the wielder's body. While the weapon fits perfectly in the hands of its owner, others who try to use it find the grip uncomfortable or the weapon off-balance. A finely customized frip is the hallmark of a master weaponsmith. This attachment can be applied to any weapon with a handle.\n[P][B]Models Include:[b] None","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":["Pistol","Rifle","Carbine","Bowcaster","Lightsaber","Lightsaber Hilt","Cutting Edge Melee","Bludgeoning Melee","Shield","Portable Gunnery"]},"Price":500,"Rarity":6,"HP":1,"BaseMods":{"Mod":[{"Key":"SETBACKSUB","Count":1},{"Count":1,"MiscDesc":"Anyone other than owner adds [SE][SE] to combat checks using this weapon."}]},"AddedMods":{"Mod":{"Key":"ACCURATE","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"USERATTACH2","Name":"Enhanced XCiter","Description":"[H3]Enhanced XCiter[h3]\nOutlaw Techs have long known how to modify the gas conversion enabler in a blaster to yield a more highly energetic - correspondingly more destructive - payload. Such modified XCiter modules are highly unstable, however, and are sometimes disparaged as being just as dengerous to the wielder and anyone else nearby as to the enemy. Despite the risk and the illegality of the modification, many outlaws seek out such customizations to gain the edge in a firefight. This attachment can be applied to any blaster.\n[P][B]Models Include:[b] Outlaw Tech Custom XCiter\n[P][H4]<font size=1>Please see page 54 of the Special Modifications Sourcebook for details.<\/font>[h4].","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Blaster"},"Price":1500,"Rarity":6,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"CRITSUB","Count":1},{"Count":1,"MiscDesc":"GM may spend [DE][DE] to cause blaster to explode, destroying blaster and inflicting automatic Critical Injury on wielder."}]},"AddedMods":{"Mod":{"Key":"PIERCE","Count":3}},"Thumbnail":"img\/no_image.png"},{"Key":"RIVETGUNTOPLOAD","Name":"Top-Loading Magazine","Description":"[H3]Top-Loading Magazine[h3]\nBy switching out the standard single-bolt loading system for a cobbled-together \"magazine\" containing numerous bolts, a skilled craftsmperson can increase the number of rivets the gun can place per minute dramatically. Some use this to apply rivets more rapidly to other sentient beings, though all manufacturers consider this to be \"user error\".","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","ItemLimit":{"Key":"RIVETGUN"},"Price":50,"Rarity":1,"HP":1,"BaseMods":{"Mod":{"Key":"REMQUALLIMITEDAMMO","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"IONTHRUSTSHAPEDNOZ","Name":"Shaped Nozzle","Description":"[H3]Shaped Nozzle[h3]\nBy adding a metal cone to an ion thruster, a Technician can dramatically increase its potency as a weapon, focusing the energy into a sharp beam rather than letting it disperse in a wide arc.","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","Price":75,"Rarity":1,"BaseMods":{"Mod":{"Key":"REMQUALION","Count":1}},"AddedMods":{"Mod":{"Key":"PIERCE","Count":5}},"Thumbnail":"img\/no_image.png"},{"Key":"MULTIGOOGASCART","Name":"Pressurized Gas Cartridge","Description":"[H3]Pressurized Gas Cartridge[h3]\nWhile a spray injector does not typically expel its contents with sufficient force to inflict serious harm, there is no particular reason it cannot do so if a tinkerer is willing to change out the factory-standard gas cartridge for one with a bit more kick. Needless to say, making such an alteration voids the multi-goo gun's warranty.","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","ItemLimit":{"Key":"MULTIGOO"},"Price":100,"Rarity":2,"HP":1,"BaseMods":{"Mod":{"Key":"DAMSET","Count":5}},"AddedMods":{"Mod":[{"Key":"BURN","Count":2},{"Key":"DISORIENT","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"RIVETGUNBALBAR","Name":"Balanced Barrel","Description":"[H3]Balanced Barrel[h3]\nAdding a functional barrel to a rivet gun can give it dramatically more range and accuracy as a shooting weapon. Of course, such an addition also makes it obvious that the device is liable to be fired at range, as few Technicians can make a coherent case that they legitimately need to be able to bolt hull plates onto a ship with pinpoint accuracy at a distance of severy meters.","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","ItemLimit":{"Key":"RIVETGUN"},"Price":150,"Rarity":3,"HP":1,"Encumbrance":1,"BaseMods":{"Mod":{"Key":"RANGEADD","Count":1}},"AddedMods":{"Mod":{"Key":"SUBQUALINACCURATE","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"SELFREPSYS","Name":"Self-Repair Systems","Description":"[H3]Self-Repair Systems[h3]\nSome sentients on the fringes of galactic civilization live a life of near-sonstant battle. For such individuals, a good suit of armor is vital, and keeping it in top condition is nearly as important. Some suits of armor include sophisticated self-repair suites, not dissimilar to the systems found in some droids. Smart materials, laminate extruders, electromagnetic assemblers and other systems work to keep the armor in one piece even under the greatest duress. This attachment can be applied to any armor with melee or ranged defense 1 or higher.\n[P][B]Models Include:[b] INdustrial Automato Model 3 Autorepair Suite, AccuTronics Advanced Repair Unit","Source":"Special Modifications","Custom":"DescOnly","Type":"Armor","Price":3000,"Rarity":6,"HP":2,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Once per encounter as a maneuver, can have armor attempt to repair itself or assist in a repair.  Counts as Intellect 2 and Mechanics 2 ([PR][PR])."},{"Count":1,"MiscDesc":"There is no cost to repair armor, whether using the automatic feature, or personally repairing."}]},"MinDefense":1,"Thumbnail":"img\/no_image.png"},{"Key":"HOLOTANK","Name":"Holo-Tank","Description":"\n      [H3]Holo-Tank[h3]\n“Holo-tank” is a catchall term for a type of holoprojection\nsystem used aboard starships and in military facilities.\nProduced by a number of technology firms, holotanks\nare large, circular holoprojectors mounted in\ndecks or floors, typically in the center of large command\ncenters. Real-time tactical data from friendly forces is\nfed directly to the holo-tank, where it creates a threedimensional\nmodel of a battle that can be observed\nat various magnifications. Holo-tanks are instrumental\nin planning and executing large-scale military actions.\nWhen paired with proper tactical data networks, they\nprovide unparalleled battlespace awareness.\n[P][B]Models Include:[b] Imlok Technologies ARENA-2500,\nBrosso Mk. IX Tactical holoprojector, Chedak Communications\n“Omni-View\" LS-220 holo-tank.","Source":"Lead by Example","Custom":"DescOnly","Type":"Vehicle","Price":5000,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Characters utilizing a holo-tank may always use Cool or Knowledge (Warfare)  when making Initiative checks."}},"AddedMods":{"Mod":[{"Count":2,"MiscDesc":"Add one advantage to Mass Combat checks when acting force commander is on board this ship"},{"Count":1,"MiscDesc":"Upgrade the ability of checks when determining Initiative once"}]},"Thumbnail":"img\/no_image.png"},{"Key":"TACCOMM","Name":"Tactical Command, Control, and Communications Suite","Description":"\n      [H3]Tactical Command, Control, and Communications Suite[h3]\nMounted to ships and vehicles piloted by designated\nsquadron leaders, the TC3 suite allows the sharing\nof data and sensor telemetry between networked\nships or vehicles. Built for use mainly in tanks, walkers,\nairspeeders, and starfighters, TC3 suites facilitate\nmore efficient communications between members of\na squadron, and they provide the squadron leader\nwith a number of command and control options to\nenhance the squadron’s performance.\n[P][B]Models Include:[b] Various models.","Source":"Lead by Example","Custom":"DescOnly","Type":"Vehicle","Price":4200,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"While active, a force commander in the vehicle upgrades the ability of all Mass Combat checks once"}},"AddedMods":{"Mod":[{"Key":"SITAWARE","Count":1},{"Count":1,"MiscDesc":"Allies benefiting from Situational Awareness remove one Setback on Perception and Vigilance checks"}]},"Thumbnail":"img\/no_image.png"},{"Key":"BRAUD","Name":"Briefing Auditorium","Description":"\n      [H3]Briefing Auditorium[h3]\nMost dedicated warships, especially those in service\nwith the Imperial Navy, have special compartments set\naside for the briefing and debriefing of fighter, gunboat,\nand shuttle pilots, ground vehicle drivers, and ground\ncombat forces. Before and after missions, pilots, soldiers,\nand support staff gather in these large, well-lit\ncompartments to be briefed on their missions by a\nsenior officer, or to report on their missions and learn\nhow their success or failure affected the larger strategic\nsituation. Typically located close to hangars, barracks,\nor berth decks, a standard briefing auditorium features\nplenty of seating, access to power and shipboard networks\nfor datapads, a lectern or speaking platform, and\naudio\/video\/holo equipment. These rooms and equipment\nallow senior officers to issue orders en masse and\nto make sure that all of their subordinates are properly\nprepared for the mission at hand.\n[P]While the Alliance to Restore the Republic fields some\ndedicated warships, either decommissioned vessels\nfrom the Clone Wars or stolen Imperial Navy vessels,\nmost Alliance ships began life as civilian vessels and\nwere militarized in an ad hoc fashion to fit the needs\nof specific Rebel cells or fleets. Ships of silhouette 5 or\nlarger can be fitted with a briefing auditorium, giving\nCommanders a venue in which to issue orders personally\nand en masse to the troops and pilots under their\ncommand.\n[P][B]Models Include:[b] None.","Source":"Lead by Example","Custom":"DescOnly","Type":"Vehicle","Price":2500,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Characters briefed in this auditorium prior to a mission remove [SE] due to known mission conditions from skill checks for the duration of the mission."}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Add one Advantage to Leadership checks made by characters within the briefing auditorium"}},"MinSize":5,"Thumbnail":"img\/no_image.png"},{"Key":"ELCOUNTCOUNT","Name":"Electronic Counter-Countermeasures Suite","Description":"      [H3]Theater Command and Control System[h3]\n“Electronic counter-countermeasures” (ECCM) is\na catchall term for a number of techniques, such as\nFAST ECM detection, frequency hopping, pulse compression,\nand polarization filtering, used to prevent or\nbreak comms and sensor jamming caused by enemy\nelectronic countermeasures. ECCM suites require large\namounts of energy and often reduce the effectiveness\nof a ship or vehicle’s sensors. On smaller ships like\nfighters and shuttles, as well as in ground vehicles and\nairspeeders, ECCM suites are installed in line with the\nvehicle’s active sensors, and they can be activated or\ndeactivated quickly by the pilot or electronic systems\noperator. On larger ships of gunship size or bigger,\nECCM suites are complex affairs composed of numerous\ncompartments and staffed by a dedicated crew.\n[P][B]Models Include:[b] Fabritech 830 “Stutterer” ECCM system,\nMiradyne A5x.4 “Oracle” ECCM suite (starfighters\nand shuttles only), KDY Advanced Capital ECCM suite\n(gunships, cruisers, and battleships only).","Source":"Lead by Example","Custom":"DescOnly","Type":"Vehicle","Price":3500,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Make a [B]Hard ([DI][DI][DI]) Computers check[b] to cancel all effects of an electronic countermeasures suite."}},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"Decrease difficulty of the Computers check by 1"}},"Thumbnail":"img\/no_image.png"},{"Key":"THEATCOMM","Name":"Theater Command and Control System","Description":"\n      [H3]Theater Command and Control System[h3]\nFitted to ships or vehicles of silhouette 4 or larger, a\ntheater command and control system (TCCS) grants a\ncommanding officer and staff incredible control over\nlarge-scale conflicts. Using a combination of sensor\ntelemetry, tactical data links, and banks of powerful\nprocessors, a TCCS takes in and analyzes battlespace\ndata to provide Alliance commanders with all of the\ndata needed to make good strategic decisions in battle.\n[P][B]Models Include:[b] Various models.","Source":"Lead by Example","Custom":"DescOnly","Type":"Vehicle","Price":8500,"Rarity":6,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"While active, force commander on the bridge upgrades the ability of all Mass Combat checks twice"}},"AddedMods":{"Mod":[{"Count":2,"MiscDesc":"Gain an additional Advantage on Mass Combat checks"},{"Count":1,"MiscDesc":"Remove one Setback from Mass Combat checks"}]},"Thumbnail":"img\/no_image.png"},{"Key":"MILMODBACKSTO","Name":"Storage Unit","Description":"\n      [H3]Storage Unit[h3]\nThis empty module has a variety of\npockets and pouches designed to store survival gear,\nspare blaster gas canisters, power packs, field rations,\nand a variety of other pieces of equipm ent used by\nthe Rebel Alliance. This unit increases the wearer’s\nencumbrance capacity by 3.","Source":"Forged in Battle","Custom":"DescOnly","Type":"Gear","ItemLimit":{"Key":"MILMODBACK"},"Price":25,"Rarity":2,"HP":1,"BaseMods":{"Mod":{"Key":"ENCTADD","Count":3}},"Thumbnail":"img\/no_image.png"},{"Key":"MILMODBACKSEN","Name":"Sensor Unit","Description":"\n      [H3]Sensor Unit[h3]\nThis unit features a raised, rotating\ndish not unlike the similar, smaller unit common to\nastromech droids. The sensor feeds a wrist-mounted\ntouchscreen and can be set to alert a soldier to movement nearby, or scan the area in general up to long\nrange. In addition to receiving narrative benefits such\nas advance warning of movement, the wearer adds automatic [AD] to Vigilance checks.","Source":"Forged in Battle","Custom":"DescOnly","Type":"Gear","ItemLimit":{"Key":"MILMODBACK"},"Price":3000,"Rarity":3,"HP":1,"Encumbrance":2,"BaseMods":{"Mod":{"MiscDesc":"Adds [AD] to Vigilance checks.","DieModifiers":{"DieModifier":{"SkillKey":"VIGIL","AdvantageCount":1}}}},"Thumbnail":"img\/no_image.png"},{"Key":"MILMODBACKOXY","Name":"Oxygen Unit","Description":"\n      [H3]Oxygen Unit[h3]\nThis unit can provide an additional\ntwelve hours of oxygen when connected to any\nrebreather, breath mask, or environmentally sealed suit","Source":"Forged in Battle","Custom":"DescOnly","Type":"Gear","ItemLimit":{"Key":"MILMODBACK"},"Price":300,"Rarity":3,"HP":1,"Encumbrance":3,"BaseMods":{"Mod":{"MiscDesc":"Adds additional twelve hours of oxygen when connected to any rebreather, breath mask, or sealed suit."}},"Thumbnail":"img\/no_image.png"},{"Key":"MILMODBACKPOW","Name":"Power Unit","Description":"\n      [H3]Power Unit[h3]\nThis portable power can recharge a\ndepleted piece of equipment as an action, or a droid\nor larger piece of machinery in two hours. Once per encounter, it can allow the wearer of the backpack to\nignore an “out of ammo\" [DE] result in the same manner\nas an extra reload (see page 197 of the [B]Age of Rebellion[b] Core Rulebook).","Source":"Forged in Battle","Custom":"DescOnly","Type":"Gear","ItemLimit":{"Key":"MILMODBACK"},"Price":250,"Rarity":3,"HP":1,"Encumbrance":3,"BaseMods":{"Mod":[{"MiscDesc":"May recharge a depleted piece of equipment as an action, or a droid or larger piece of machinery in two hours."},{"MiscDesc":"Once per encounter, wearer may ignore an \"out of ammo\" [DE] result in the same manner as an Extra Reload."}]},"Thumbnail":"img\/no_image.png"},{"Key":"MILMODBACKCOM","Name":"Comms Unit","Description":"\n      [H3]Comms Unit[h3]\n This pack functions as a comms hub,\nrouting Alliance communications up to long range\non the planetary scale. Its encryption adds [SE][SE] to\nchecks made to unscramble the signal.","Source":"Forged in Battle","Custom":"DescOnly","Type":"Gear","ItemLimit":{"Key":"MILMODBACK"},"Price":500,"Rarity":4,"HP":1,"Encumbrance":2,"BaseMods":{"Mod":[{"MiscDesc":"May route communications up to long range on the planetary scale."},{"MiscDesc":"Adds [SE][SE] to checks made to unscramble the unit's signal."}]},"Thumbnail":"img\/no_image.png"},{"Key":"GALPATRES","Name":"Galven Pattern Resequencing","Description":"\n      [H3]Galven Pattern Resequencing[h3]\nSome Alliance operatives would gladly trade a little\nreliability in exchange for the stopping power necessary to penetrate Imperial armor. This makes the Galven pattern resequencing a popular upgrade among\ntroops in service of the Rebellion. By focusing the Galven pattern into a tighter wavelength, more energy is\npacked into each blaster bolt, which increases damage output. Unfortunately, the added workload on\nthe blaster’s tiny circuitry makes the weapon much\nmore prone to failure. This attachment can only be\nused with blaster pistols and heavy blaster pistols.","Source":"Forged in Battle","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":["Blaster Pistol","Heavy Blaster Pistol"]},"Price":1000,"Rarity":5,"HP":2,"BaseMods":{"Mod":[{"Key":"DAMADD","Count":1},{"MiscDesc":"Adds automatic [TH][TH] to all combat checks made using this weapon."}]},"AddedMods":{"Mod":[{"Key":"DAMADD","Count":2},{"Key":"PIERCE","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"MILMODBACKTEMP","Name":"Temperature Control Unit","Description":"\n      [H3]Temperature Control Unit[h3]\nThis unit comes with\na specialized bodysuit that attaches to the module’s\ncooling or heating system, removing up to [SE][SE] from\nthe user’s checks to resist extreme heat or cold.","Source":"Forged in Battle","Custom":"DescOnly","Type":"Gear","ItemLimit":{"Key":"MILMODBACK"},"Price":500,"Rarity":3,"HP":1,"Encumbrance":2,"BaseMods":{"Mod":{"MiscDesc":"Removes up to [SE][SE] from checks to resist extreme heat or cold."}},"Thumbnail":"img\/no_image.png"},{"Key":"BEAMSPLIT","Name":"Beam Splitter","Description":"\n      [H3]Beam Splitter[h3]\nAlliance troopers typically apply this upgrade to\nblaster pistols and other sidearms to achieve results\nsimilar to that of the spread barrel used on larger,\nmore powerful blasters. Beam splitters function by\nmodifying the Galven pattern and carefully mounting\nthree or more em itters into a honeycomb configuration inside a stock blaster barrel. Shots fired from a\nweapon with this modification diffuse into a weaker,\nspread shot rather than the typical blaster bolt, giving a single shot the potential to connect with multiple targets. Rebel troops often use this upgrade to\ntransform weaponry into effective standoff weapons\nused to pin down enemy troops and hold chokepoints\nin narrow starship corridors. This attachment can be\napplied to any blaster or suitable energy weapon that\ndoes not have the Blast quality.","Source":"Forged in Battle","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Energy Weapon"},"Price":1250,"Rarity":5,"Restricted":"true","HP":3,"BaseMods":{"Mod":[{"Key":"BLAST","Count":1,"QualReplace":"true","WeaponCountDamageMult":0.5},{"Key":"RANGESUB","Count":1}]},"AddedMods":{"Mod":{"Key":"DISORIENT","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"BLASTSIGHT","Name":"Built-In Blaster Sight","Description":"\n      [H3]Built-In Blaster Sight[h3]\nA typical modification used by the Rebellion’s SpecForce troops, this attachment allows a harmless beam\nof energy to trickle out of the barrel on a half-trigger pull to \"paint” the target, letting the wielder see\nexactly where she is aiming Most models illuminate\nbeams in the human visual spectrum, but some use\nlight wavelengths invisible to the naked eye, which\nrequire special goggles to spot, to ensure the agent's\nposition remains uncompromised. This attachment\ncan only be applied to energy ranged weapons.","Source":"Forged in Battle","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Energy Weapon"},"Price":150,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"MiscDesc":"Remove [SE] added by the Called Shot use of the Aim maneuver from Ranged Light and Ranged Heavy checks."}},"Thumbnail":"img\/no_image.png"},{"Key":"XV09","Name":"XV-09 Chemical Restraint Harness","Description":"\n      [H3]XV-09 Chemical Restraint Harness[h3]\nThe XV-09 Pacifier is one of the more uncommon products sold by Xenovet. Roundly derided by those who\nmake their living with animals as a cheap shortcut used\nby quacks and animal haters, the Pacifier is designed\nto control a wild or otherwise uncontrollable animal\nthrough chems rather than training. Similar to a typical\nriding or restraining harness, the Pacifier is made of a\nsturdy and flexible synthetic weave that loops around\na creature's ribs, chest, and shoulders with a heavy\nbrace that sits at its withers. Built into the back brace is\na refillable auto-hypo typically filled with a cocktail of\nbehavior-controlling drugs. The auto-hypo is connected to a remote that can trigger the pump at up to close\nrange, and is used in much the same way as a remote\nfor a droid restraining bolt. While the drugs tend to\nmake even the most cross-grained creature docile and\nbiddable, they can also have a number of unforeseen\nside effects ranging from dulling a creature's intellect or\nsenses to killing it with an overdose.\n[P]Using a Pacifier on a wild animal is a temporary fix at\nbest, and should only be done in emergencies. Mounting the harness on a creature requires a [B]Hard ([DI][DI][DI]) Survival check[b] to ensure the harness is fitted properly\nand the auto-hypo is situated correctly. The difficulty\nof this check can be reduced by 1 with a successful\n[B]Knowledge (Xenology) check[b]. If successful, the XV-09\ngrants [BO][BO] to any Survival checks made to control\nthe beast wearing the harness. In addition, creatures\nthat are successfully pacified gain [BO] to any Discipline\nchecks. Game Masters can spend any [TH] generated by\nthe initial Survival check to reflect one or more negative side effects caused by the drugs. The exact nature\nof these side effects is left to the Game Master's discretion. In addition, the Game Master can spend [TH][TH][TH]\nor [DE] to reflect a catastrophic reaction to the drugs,\nsuch as a heart attack or brain aneurysm, which results\nin the animal's death. While safe for use on animals, the\npowerful mixture of chemicals in the harness can be\ndangerous to the minds of sentient beings. Attaching\nthe harness to a sentient being can result in permanent\nbrain damage and even death.","Source":"Stay on Target","Custom":"DescOnly","Type":"Mount","TypeLimit":{"Type":"Riding Mount"},"Price":1200,"Rarity":5,"Encumbrance":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Pacified beasts gain [BOOST] to any [B]Displine Checks[b]."}},"Thumbnail":"img\/no_image.png"},{"Key":"ENHHYPSH","Name":"Enhanced Hyperspace Shields","Description":"\n      [H3]Enhanced Hyperspace Shields[h3]\nFew things are more dangerous to a ship than colliding with a mass shadow in hyperspace. Although all ships are equipped with sensors intended to detect a mass shadow and automatically drop the ship out of hyperspace, such systems are not infallible. As an added level of protection, some engineers modify a vessel with  enhanced particle shielfs designed to potentially save a ship from complete desctruction in a case of a hyperspace collision. Many captains consider the drain on ship resources and the cost to be too great for additional protection agains such a rare event, but these systems save lives. This attachment can be applied to any ship with a hyperdrive.\n    ","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","Price":4000,"Rarity":5,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Downgrade difficulty of Astrogation checks made to navigate the ship through hyperspace once."}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Remove [SE] from Astrogation checks made to navigate the ship through hyperspace"}},"Thumbnail":"img\/no_image.png"},{"Key":"PODENGINE","Name":"Podracer Engine","Description":"\n      [H3]Podracer Engine[h3]\nPodracer engines come in three varieties rocket motors, turbine engines, and high-performance ion engines. In the early days of Podracing, engines were salvaged and reuilt by talented amateurs. Single-stage heavy lift rockets, ion engines from crashed starfighters, air breathign turbojets from performance irspeeders, and even more exotic engine types were hauled out of scrapyards or dug out of old military depots and put to use on the racing circuits. Today most Podracer engines are either hand-built custom jobs built by big racing teams to their own exact specifications or mass produced engines from one of the major manufacturers. No matter their provenance, they are all too big, too fast and too loud for civilized racing, which is what makes them so appealing for Podracers.\n[P]Podracer engines must be installed in matched sets usually in multiples of two. Doing otherwise makes for a poorly balanced, finicky, unreliable Podracer that is  by its mismatched nature, even more dangerous than usual.\n[P][B]Models Include:[b] TurboDyne 99-U, Manta RamAir Mk. IV Flat Twin Turbojet, JAK Racing J930 Dash-8, Radon-Ulzer 620C S&K JZ-5 Fusial Thrust Engine, Incom 2a Fission Engine.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"PODCOCK"},"Price":4000,"Rarity":5,"HP":2,"BaseMods":{"Mod":{"Key":"SETSPEED4","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"PODSHIELD","Name":"Podracer Shield Generator","Description":"\n      [H3]Podracer Shield Generator[h3]\nMost Podracers, whether custom-built raceers or one of the many factory customs, mount a small, low-output shield generator in the cockpit. These shield generators are thin and cover primarily the very front. They only protect the driver, and only from exhaust wash from the engines and from debris kicked up from the track surface or flung at the racer by spectators (or other racers). They provide no protection to to the vehicle itself and are generally worthless in the event of a crash or other catastrophic event.\n[P]Some racers, though, value personal safety over tradition, running powerful, full-spectrum shield generators that protect the entire vehicel. These are usually built specifically for Podracing and are tuned for the kinds of environments typically found on Podrace courses. Racing teams that are too poor or too old-fasioned to use factory-built generators still use salvaged units pulled from wrecked starfighters or emplacement shield generators.\n[P][B]Models Include:[b] Novaldex GA21 Shield Generator, Chempat CED8089Y Shields, Keizar-Volvec Mk VIII Safety Shield, BGRE \"Bug Smasher\" Shield.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Podracer"},"Price":4200,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Key":"SETDEFFORE","Count":1}},"AddedMods":{"Mod":{"Key":"DEFZONEADD","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"PODCONTCAB","Name":"Podracer Control Cables","Description":"\n      [H3]Podracer Control Cables[h3]\nIf Podracing evolved from ancient beast-drawn chariot and cart racing, as many historians suppose, then control cables are analogous to a set of reins. These long, flexible durasteel cables tether a Podracer's powerful engines to its cockpit. Along with keeping the engines and the cockpit connected, they also house the wiring that connects the controls to the engines. Steelton produces most Podracer control cables, but smaller companies have cropped up lately in an attempt to take away some of its market share.\n[P]Nearly all Podracers use control cables, only a few small-production outliers, such as FG 8T8-T and a handful of one-offs and prototypes, mount the engines directly to the cockpit via spars. Control cables are the most fragile part of a Podracer, as even the stoutest set can be snapped or sliced through. A Podracer who loses her control cables through accident or sabotage loses control over her vehicle and must either eject or ride the cockpit to a stop and hope she survives.\n[P][B]Models Include:[b] Steelton Perfect-Series control cables, Moriales Systems SC-4.x control tether.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"PODCOCK"},"Price":1000,"Rarity":2,"HP":1,"BaseMods":{"Mod":{"Key":"SETHANDM1","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"PODCOILS","Name":"High-Output Repulsor Coils","Description":"\n      [H3]High-Output Repulsor Coils[h3]\nBasic Podracer cockpits come equipped with low-output repulsor coils of the kind typically found on repulsorsleds and speeder trucks. Considered a secondary system at best, and really only equipped to keep the Podracer at altitude when standing still or at low speeds, a racer's repulsor coils are rarely given a second thought. Savvy racers, or veterans with years of racing and building experience under their belts, know that a good repulsorlift engine can often mean the difference between first and last place, or finishing or crashing. Upgraded repulsor coils increase a Podracer's maximum altitude, allowing it to clear obstacles more easily and even hop over lower flying opponents.\n[BR][B]Models Include:[b] Incom TX-2, Bespin Motors Ponrez\/Arc Repulsorlift, Karydee KD49 Drive Unit.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Podracer"},"Price":4500,"Rarity":3,"HP":2,"BaseMods":{"Mod":{"Key":"ADDALT50","Count":1}},"AddedMods":{"Mod":{"Key":"ADDALT50","Count":3}},"Thumbnail":"img\/no_image.png"},{"Key":"PODREICOWL","Name":"Reinforced Engine Cowlings","Description":"\n      [H3]Reinforced Engine Cowlings[h3]\nPart of the thrill of Podracing is the near certainty of collisions, for many enthusiasts, a good race is measured by how many crashes occurred, not how fast the winner ran the circuit. Given the nature of these races, many pilots view it as foregone that they will be involved in collisions, no matter what effort they might take to avoid them. This leads to some adopting reinforced plating for their engines, the better to withstand \"accidental\" impacts as they occur during a race.\n[P]More tactically-minded pilots take this even further adding ridges, struts, and vanes designed to appear ornamental or to a aid in aerodynamics, but instead intended to cushion impacts when their vehicle rams into another. That those pilots who are frequently involved in collisions and still manage to cheat death race after race, garner large amounts of fame (and credits) certainly has a strong bearing on other pilots decision to adopt such modifications and alter their racing tactics accordingly.\n[P][B]Models Include:[b] Various Models.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Vehicle","Price":2500,"Rarity":3,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Reduce Critical Hit result from collision by 20"}},"AddedMods":{"Mod":{"Count":1,"MiscDesc":"Reduce Critical Hit result from collision by 20"}},"Thumbnail":"img\/no_image.png"},{"Key":"POSFORDEB","Name":"Foreign Debris Ejector","Description":"\n      [H3]Foreign Debris Ejector[h3]\nPodracing attracts a wide range of pilots, from those who delight in testing their skill against fellow speed enthusists to those who are only interested in winning, no matter what it takes. For the latter, one method is not to boost their own vehicles performance but to instead hamper their opponants Podracers. Using concealed compartments (known more informally as \"dirty trick kits\"), pilots can release small nails, reactive chemicals or other debris-designed to foul the engines of a training vehicle, slowing it down or even knocking it out of the running. Though illegal, when used out of the sight of officials these compartments can decide the fate of many a race.\n[P][B]Models Include:[b] Various (pilots and their crew typically craft them secretly).","Source":"Endless Vigil","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Podracer"},"Price":900,"Rarity":3,"HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Ejects debris into the air behind podracer.  Any racer within close range and behind must make a [B]Hard ([DI][DI][DI]) Piloting (Planetary) check[b] to avoid debris.  Failure reduces speed by 1 for 2 rounds, plus 1 round per [TH].  [TH][TH][TH] or [DE] can inflict Critical Hit on target vehicle."},{"Count":1,"MiscDesc":"May only be used once per race."}]},"Thumbnail":"img\/no_image.png"},{"Key":"PODHAND","Name":"Handling Upgrades","Description":"\n      [H3]Handling Upgrades[h3]\nPodracer handling upgrades encompass a wide array of systems and technologies designed to make Podracers easier to pilot. These upgrades can be tiny, variable pitch jets and movable repulsor fields to brute force counterweights that slide into special compartments to counteract intertia. While such upgrades do increase a Podracer's handling capabilities, no amount of modification is likely to likely to make the exceedingly fast and fragile race vehicle easy enough to handle for a human pilot.\n[BR][B]Models Include:[b] Incom ETX Mk. I Etheric Rudder, Slayn & Korpil Vitus-Series Attitude Thrusters, Bespid Motors PinPoint II Targeted Repulsor Generator.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Podracer"},"Price":4000,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Key":"HANDLINGADD","Count":1}},"AddedMods":{"Mod":{"Key":"HANDLINGADD","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"PODEJECT","Name":"Podracer Ejection System","Description":"\n      [H3]Podracer Ejection System[h3]\nThis is a simple pilot's ejection seat, commonly found in starfighters and combat airspeeders. When activated, either by the pilot or by a dead man's switch, should the pilot become incapacitated, the seat and pilot are launched from the Podracer's cockpit by small, high-output, single-use ion engines. Once the seat reaches a pre-set altitude, it deploys a parachute or activates a small repulsorlift generator, which returns the pilot swiftly and generally, safely to the ground. Few Podracer pilots equip their vehicles with ejection systems, however, as most consider the added weight and complexity of the system no worth the small gain in safety.\n[P][B]Models Include:[b] Income ACE Ejection Seat, Koensayr Np-K36 Ejection Seat, Sienar Fleet Systems Mk GT8 Deluxe Ejection Pod.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Podracer"},"Price":400,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"To eject, make an [B]Average ([DI][DI]) Piloting (Planetary) check[b] as an out-of-turn incidental.  On success, pilot is ejected unharmed.  On failure, pilot suffers vehicle speed in strain, plus one Critical Injury.  GM can spend [TH][TH] or [DE] to cause wounds to be suffered instead."}},"Thumbnail":"img\/no_image.png"},{"Key":"COLLAVOID","Name":"Collision Avoidance System","Description":"\n      [H3]Collision Avoidance System[h3]\nDue to their speed and the primative nature of their handling systems, Podracers are notoriously difficult to control. While a Podracer is blindingly fast in a straight line, getting one around corners with any accuracy or reliability is almost impossible, making crashes a common sight at races. As a result, many pilots equip their Podracers with collision avoidance systems to reduce the risk of crashes. While common collision avoidance systems are often barred from use in race series and are frowned upon by veteran racers, who consider them \"electronic nannies\".\n[BR][B]Models Include:[b] Aratech 8pz-X Constant Active Array, Fabritech \"Co-Pilot\" Adaptave Anti-Collision System, SoroSuub LX-19 Automatic Spot Thrusters.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Podracer"},"Price":2200,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Reduce silhouette by 1 for purposes of determining difficulty of Piloting checks."}},"Thumbnail":"img\/no_image.png"},{"Key":"PARACLOUD","Name":"Paramilitary Cloud Car","Description":"\n      [H3]Paramilitary Cloud Car[h3]\nConverts a cloud car to a paramilitary vehicle.  ","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Cloud Car"},"BaseMods":{"Mod":[{"Key":"HANDLINGSUB","Count":1},{"Key":"ARMORADD","Count":1},{"Key":"HULLADD","Count":1},{"Count":1,"MiscDesc":"Adds a forward light auto-blaster"}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Light Auto-Blaster","SkillKey":"GUNN","Damage":3,"Crit":5,"Qualities":{"Quality":{"Key":"AUTOFIRE"}},"VehicleWeaponProperties":{"Location":"Forward","FiringArcs":{"Fore":"true"}},"VehicleWeaponCount":1,"RangeValue":"wrClose","Range":"Close"}},"Thumbnail":"img\/no_image.png"},{"Key":"PARAAIR","Name":"Paramilitary Airspeeder","Description":"\n      [H3]Paramilitary Airspeeder[h3]\n      Converts an airspeeder to a paramilitary vehicle. ","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Airspeeder"},"BaseMods":{"Mod":[{"Key":"HANDLINGSUB","Count":1},{"Key":"ARMORADD","Count":2},{"Key":"HULLADD","Count":2},{"Key":"SSTRAINSUB","Count":1},{"Count":1,"MiscDesc":"Adds a forward light blaster cannon"}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Light Blaster Cannon","SkillKey":"GUNN","Damage":4,"Crit":4,"VehicleWeaponProperties":{"Location":"Forward","FiringArcs":{"Fore":"true"}},"VehicleWeaponCount":1,"RangeValue":"wrClose","Range":"Close"}},"Thumbnail":"img\/no_image.png"},{"Key":"PARABIKE","Name":"Paramilitary Speeder Bike\/Swoop","Description":"\n      [H3]Paramilitary Speeder Bike\/Swoop[h3]\n      Converts a speeder bike or swoop to a paramilitary vehicle. \n    ","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":["Speeder Bike","Swoop"]},"BaseMods":{"Mod":[{"Key":"HANDLINGSUB","Count":1},{"Key":"HULLADD","Count":1},{"Key":"SSTRAINSUB","Count":1},{"Count":1,"MiscDesc":"Adds a forward light repeating blaster"}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Light Repeating Blaster","SkillKey":"RANGHVY","Damage":11,"Crit":3,"Qualities":{"Quality":[{"Key":"AUTOFIRE"},{"Key":"CUMBERSOME","Count":4},{"Key":"PIERCE","Count":1}]},"VehicleWeaponProperties":{"Location":"Forward","FiringArcs":{"Fore":"true"}},"VehicleWeaponCount":1,"RangeValue":"wrLong","Range":"Long"}},"Thumbnail":"img\/no_image.png"},{"Key":"PARAWHEEL","Name":"Paramilitary Wheeled\/Tracked","Description":"\n      [H3]Paramilitary Wheeled\/Tracked[h3]\n      Converts a wheeled or tracked vehicle to a paramilitary vehicle. \n    ","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","CategoryLimit":{"Category":["Tracked Vehicle","Wheeled Vehicle"]},"BaseMods":{"Mod":[{"Key":"HANDLINGSUB","Count":1},{"Key":"ARMORADD","Count":3},{"Key":"HULLADD","Count":2},{"Key":"SSTRAINSUB","Count":1},{"Count":1,"MiscDesc":"Adds a medium laser cannon turret"}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Medium Laser Cannon","SkillKey":"GUNN","Damage":6,"Crit":3,"VehicleWeaponProperties":{"Turret":"true","FiringArcs":{"Fore":"true","Aft":"true","Port":"true","Starboard":"true"}},"VehicleWeaponCount":1,"RangeValue":"wrClose","Range":"Close"}},"Thumbnail":"img\/no_image.png"},{"Key":"PARAMEDTRANS","Name":"Paramilitary Medium Transport","Description":"\n      [H3]Paramilitary Medium Transport[h3]\n      Converts a medium transport to a paramilitary vehicle.  \n\n    ","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","CategoryLimit":{"Category":"Medium Transport"},"BaseMods":{"Mod":[{"Key":"DEFZONEADD","Count":1},{"Key":"ARMORADD","Count":2},{"Key":"HULLADD","Count":3},{"Key":"SSTRAINSUB","Count":2},{"Count":1,"MiscDesc":"Adds two medium laser cannon turrets"}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Medium Laser Cannon","SkillKey":"GUNN","Damage":6,"Crit":3,"VehicleWeaponProperties":{"Turret":"true","FiringArcs":{"Fore":"true","Aft":"true","Port":"true","Starboard":"true"}},"VehicleWeaponCount":2,"RangeValue":"wrClose","Range":"Close"}},"Thumbnail":"img\/no_image.png"},{"Key":"PARALTFREIGHT","Name":"Paramilitary Light Freighter","Description":"\n      [H3]Paramilitary Light Freighter[h3]\n      Converts a light freighter to a paramilitary vehicle. \n    ","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Light Freighter"},"BaseMods":{"Mod":[{"Key":"HANDLINGSUB","Count":1},{"Key":"DEFZONEADD","Count":1},{"Key":"ARMORADD","Count":1},{"Key":"HULLADD","Count":2},{"Key":"SSTRAINSUB","Count":2},{"Count":1,"MiscDesc":"Adds two quad laser cannon turrets"}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Quad Laser Cannon","SkillKey":"GUNN","Damage":5,"Crit":3,"Qualities":{"Quality":[{"Key":"ACCURATE","Count":1},{"Key":"LINKED","Count":3}]},"VehicleWeaponProperties":{"Turret":"true","FiringArcs":{"Fore":"true","Aft":"true","Port":"true","Starboard":"true"}},"VehicleWeaponCount":2,"RangeValue":"wrClose","Range":"Close"}},"Thumbnail":"img\/no_image.png"},{"Key":"PARASHUTTLE","Name":"Paramilitary Shuttle","Description":"\n      [H3]Paramilitary Shuttle[h3]\n      Converts a shuttle to a paramilitary vehicle.  \n    ","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Shuttle"},"BaseMods":{"Mod":[{"Key":"HANDLINGSUB","Count":1},{"Key":"DEFZONEADD","Count":2},{"Key":"HULLADD","Count":2},{"Key":"SSTRAINSUB","Count":3},{"Count":1,"MiscDesc":"Adds two twin light laser cannon turrets"}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Light Laser Cannon","SkillKey":"GUNN","Damage":5,"Crit":3,"Qualities":{"Quality":{"Key":"LIMITEDAMMO","Count":1}},"VehicleWeaponProperties":{"Location":"Forward","FiringArcs":{"Fore":"true"}},"VehicleWeaponCount":2,"RangeValue":"wrClose","Range":"Close"}},"Thumbnail":"img\/no_image.png"},{"Key":"PARABULK","Name":"Paramilitary Bulk Transport","Description":"\n      [H3]Paramilitary Bulk Transport[h3]\n      Converts a bulk transport to a paramilitary vehicle.  ","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","CategoryLimit":{"Category":"Bulk Transport"},"BaseMods":{"Mod":[{"Key":"HANDLINGSUB","Count":1},{"Key":"DEFZONEADD","Count":2},{"Key":"ARMORADD","Count":2},{"Key":"HULLADD","Count":5},{"Key":"SSTRAINSUB","Count":5},{"Count":1,"MiscDesc":"Adds two heavy laser cannon turrets"}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Heavy Laser Cannon","SkillKey":"GUNN","Damage":6,"Crit":3,"VehicleWeaponProperties":{"Turret":"true","FiringArcs":{"Fore":"true","Aft":"true","Port":"true","Starboard":"true"}},"VehicleWeaponCount":2,"RangeValue":"wrShort","Range":"Short"}},"Thumbnail":"img\/no_image.png"},{"Key":"PARAYACHT","Name":"Paramilitary Yacht","Description":"\n      [H3]Paramilitary Yacht[h3]\n      Converts a yacht to a paramilitary vehicle.  \n    ","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Yacht"},"BaseMods":{"Mod":[{"Key":"DEFZONEADD","Count":1},{"Key":"HULLADD","Count":2},{"Key":"SSTRAINSUB","Count":5},{"Count":1,"MiscDesc":"Adds two forward light laser cannons and one aft light laser cannon"}]},"WeaponModifiers":{"WeaponModifier":[{"UnarmedName":"Light Laser Cannon","SkillKey":"GUNN","Damage":5,"Crit":3,"VehicleWeaponProperties":{"Location":"Forward","FiringArcs":{"Fore":"true"}},"VehicleWeaponCount":2,"RangeValue":"wrClose","Range":"Close"},{"UnarmedName":"Light Laser Cannon","SkillKey":"GUNN","Damage":5,"Crit":3,"VehicleWeaponProperties":{"Location":"Aft","FiringArcs":{"Aft":"true"}},"VehicleWeaponCount":1,"RangeValue":"wrClose","Range":"Close"}]},"Thumbnail":"img\/no_image.png"},{"Key":"ETAAN","Name":"Etaan Crystal","Description":"\n      [H3]Etaan Crystal[h3]\nThese unusual kyber crystals from in the deep caverns of the Mid Rim world of Etai. Given that the crystals rarely form fewer than five hundred meters below the surface and usually at over twice the depth, the formation can be extremely difficult to locate. However, the raw crystals echo any nearby sound with a humming resonance, guiding searchers who draw near.\n[P]Harvested etaan crystals retain this resonant property causing the activated blades of lightsabers using them to thrum in harmony with the motion of the blade, and to chime at nearby sounds. The blades resond especially spectacularly to a clash with another lightsaber or blaster bolt, emitting a near-deafening crack and a bright flare of energies. A clash of blades involving etaan crystals usually results in the lightsabers being forced apart, but reflected blasted bolts draw in the resonant energies from the reaction and intensify on their new trajectory.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Weapon","Price":12000,"Rarity":9,"Restricted":"true","HP":1,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":6},{"Key":"CRITSET","Count":2},{"Key":"BREACH","Count":1},{"Key":"SUNDER"},{"Count":1,"MiscDesc":"If wielder uses the Improved Reflect talent to inflict an automatic hit, increase damage by 2."}]},"AddedMods":{"Mod":[{"Key":"VICIOUS","Count":1},{"Key":"DAMADD","Count":2},{"Key":"CRITSUB","Count":1},{"Key":"PARRY","Count":1},{"Key":"REFLECT","Count":1}]},"IsCrystal":"true","Thumbnail":"img\/no_image.png"},{"Key":"GHOSTFIRE","Name":"Ghostfire Crystal","Description":"\n      [H3]Ghostfire Crystal[h3]\nThese kyber crystals grow in nearly invisible formations on a handful of far flung Outer Rim worlds. Their precarious spires of entirely tansparent stones rise from rocky foundations. They are typically found at the peaks of mountains, when they can be located at all. Finders can use ghostfire crystals to constuct a lightsaber with a blade as difficult to detect as the spire from which they harvested the crystal. Lightsabers with ghostfire crystals at their core produce no sound whatsoever, and the blades are dim and translucent compared to the incandescent fire of the other lightsabers. most curious of all are the illusory afterimages of the blades that follow the wielders' motions, disorienting foes and disguising the true position of their blades.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Weapon","Price":14000,"Rarity":9,"Restricted":"true","HP":1,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":6},{"Key":"CRITSET","Count":2},{"Key":"BREACH","Count":1},{"Key":"SUNDER"},{"Count":1,"MiscDesc":"Wielder may spend [AD][AD][AD][AD] or [TR] to prevent the target from using the Parry talent to reduce damage from this attack."}]},"AddedMods":{"Mod":[{"Key":"DEFENSIVE","Count":2},{"Key":"DAMADD","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"REFLEXGRIP","Name":"Reflex Grip","Description":"\n      [H3]Reflex Grip[h3]\nThrough a delicate system of motion sensors and miniaturized motors built into a lightsaber hilt, a craftsperson can alter the lightsaber to respond to adjustments in grip and postion with greater responsiveness. The split-second edge granted by this sytem allows a combatant to more easily parry an opponent's decisive stroke or block each of a hail of blaster bolts. Controlling the system and keeping it from overreacting to minute or inadvertent motions can be difficult to master, but the defensive advantage of a reflex grip can be worth the extra practice.\n[BR][B]Models Include:[b] None; users must custom make each lightsaber attachment.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Lightsaber"},"Price":4000,"Rarity":8,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"When lightsaber is used to Parry or Reflect, suffer 1 additional strain, but count Parry and Reflect ranks as 1 higher."}},"AddedMods":{"Mod":[{"Key":"DEFENSIVE","Count":1},{"Key":"DEFLECTION","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"SHIENREVGRIP","Name":"Shien Reverse Grip Customization","Description":"\n      [H3]Shien Reverse Grip Customization[h3]\nPractitioners of Form V sometimes use a reverse grip on their lightsabers to assist in many of the techniques common to that form. Through a few careful adjustments to the grip and balance of their lightsabers, these practictioners can make the weapons more suited to wielding in this manner although the modifications make using a traditional grip somewhat unwieldly in the process.\n[P][B]Models Include:[b] None; users must custom make each lightsaber attachment.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Lightsaber"},"Price":100,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"MiscDesc":"\n          Wielder adds [AD] to all Lightsaber (Cunning) checks, but adds [TH] to all other Lightsaber checks.\n        ","DieModifiers":{"DieModifier":[{"SkillKey":"LTSABER","SkillChar":"CUN","AdvantageCount":1},{"SkillKey":"LTSABER","SkillChar":"BR","ThreatCount":1},{"SkillKey":"LTSABER","SkillChar":"AG","ThreatCount":1},{"SkillKey":"LTSABER","SkillChar":"INT","ThreatCount":1},{"SkillKey":"LTSABER","SkillChar":"PR","ThreatCount":1},{"SkillKey":"LTSABER","SkillChar":"WIL","ThreatCount":1}]}}},"Thumbnail":"img\/no_image.png"},{"Key":"OVERPOWERCELL","Name":"Overcharged Power Cell","Description":"\n      [H3]Overcharged Power Cell[h3]\nLightsabers are exceptionally efficient weapons, able to run nearly forever off a single basic power cell, thanks to the remarkable focus of the kyber crystal installed within and the contained energy loop of the blade. As such, tampering with a lightsaber's power cell and adjusting its output usually does more harm than good, as it upsets the balance of a near-perfect system. Those who know what they are doing can sometimes overcharge the power cell of a lightsaber to increase the power fo teh blade, but these changes make the power cell volatile, prone to causing unpredictable fluctuations in the lightsaber's effects. When installed correctly, the effect of an overcharged power cell is more often beneficial than it is a hindrance, but the mere possibility of the blade dimming at the wrong moment dissuades some tinkerers from taking the risk.\n[BR][B]Models Include:[b] None; users must custom make each lightsaber attachment.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Lightsaber"},"Price":500,"Rarity":6,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Wielder can spend [AD] from combat checks to increase damage by 1.  GM can spend [TH][TH] to decrease damage by 1."}},"Thumbnail":"img\/no_image.png"},{"Key":"PISTOLHILT","Name":"Pistol Hilt","Description":"\n      [H3]Pistol Hilt[h3]\nWhile the Jedi of old disdained blasters, modern Force users often need every advantage they can get. By adding a customized secondary emitter to a lightsaber hilt, the wielder can release the energies of her weapon at a distance in a manner similar to that of a blaster bolt. Without the focused field produced by a regular lightsaber emitter, the beam repidly loses coherency and stopping power, producing only a short-range stun bolt. A lightsaber used in this manner, though might not even be recognized for what it is, appearing to be an unusal or custom model of pistol instead of one of the legendary weapons of the Jedi. This additional layer of cover could mean as much protection as the new capabilities of the weapon.\n[P]The user must spend a maneuver to switch from one weapon mode to the other lightsaber function to pistol function, for exmple.\n[P][B]Models Include:[b] None; users must custom make each lightsaber attachment.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Lightsaber"},"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Includes a built-in blaster pistol."}},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Built-In Blaster Pistol","SkillKey":"RANGLT","Damage":6,"Crit":3,"Qualities":{"Quality":{"Key":"STUNDAMAGE"}},"RangeValue":"wrShort","Range":"Short"}},"Thumbnail":"img\/no_image.png"},{"Key":"RIDINGTACK","Name":"Riding Tack","Description":"\n      [H3]Riding Tack[h3]\nRiding tack is a catchall term for the assorted bits of equipment needed to ride or control a beast. Produced by comopanies like Piccatech Ltd. and VeTech, tack comes in a variety of styles tailored to the physiology of nearly every known domesicable beast in the galaxy. Riding tack includes a sturdy comfortable saddle designed for a specific beast and riding style, stirrups, headgear (bridle, halter, bit, reins, etc,), and a breastplate. Tack made for working animals replaces the saddle with a heavy duty harness that allows a creature to pull cargo sleds or implements such as plows.\n[P]Tack can only be worn by riding or working animals. Using tack allows a character to ride the beast without suffering the bareback riding penalties detailed on page 73.","Source":"Savage Spirits","Custom":"DescOnly","Type":"Mount","TypeLimit":{"Type":"Riding Mount"},"Price":100,"Rarity":4,"Encumbrance":3,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Characters may ride beast without suffering bareback riding penalties."}},"Thumbnail":"img\/no_image.png"},{"Key":"AD1SSHIELD","Name":"(AD-1S) Shield Generator Module","Description":"[H3]Shield Generator Module  forAD-1S[h3]\nMany fightercraft lack\nshields, including most of the Galactic Empire's TIE\nseries. Of course, many pilots view going into battle\nwithout shields as a sure sign of a death wish. Soldiers\nof fortune and others who fight for credits rather than\nideology tend to prefer the thought of living to get paid\nto the prospect of dying gloriously for some intangible\nideal, and so the highly customizable AD-1 S can be\nfitted with shield generators to improve its durability.\n","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD1SMOD"},"Price":8000,"Rarity":6,"HP":3,"BaseMods":{"Mod":{"Key":"DEFZONEADD","Count":1}},"AddedMods":{"Mod":{"Key":"DEFZONEADD","Count":2}},"Thumbnail":"img\/no_image.png"},{"Key":"AD1SHYPER8","Name":"(AD-1S) Hyperdrive Class 8 Module","Description":"[H3]Hyperdrive Class 8 Module for AD-1S[h3]\nInstalling a hyperdrive, even\na relatively low-grade one, in an AD-IS takes up a\ngood deal of space inside of the craft, but also allows\nit to operate independently. For many mercenaries,\nbounty hunters, and other frequent travelers, such an\nupgrade is well worth the cost.\n","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD1SMOD"},"Price":3000,"Rarity":6,"HP":4,"BaseMods":{"Mod":[{"Key":"HYPERDRIVEADD8"},{"Count":1,"MiscDesc":"Add astromech droid socket."}]},"AddedMods":{"Mod":{"Key":"HYPERDRIVESUB5","Count":4}},"Thumbnail":"img\/no_image.png"},{"Key":"AD1SCARGOPOD","Name":"(AD-1S) Cargo Pod","Description":"[H3]Cargo Pod for AD-1S[h3]\nThe cargo pods for this craft are large, cylindrical affairs, designed for efficiency, not aesthetics. These pods can even be retrofitted to carry passengers, though they do not make for comfortable quarters.\n","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD1SMOD"},"Price":1400,"Rarity":2,"HP":2,"BaseMods":{"Mod":{"Key":"ENCCADD","Count":50}},"AddedMods":{"Mod":{"Key":"PASSADD2","Count":3}},"Thumbnail":"img\/no_image.png"},{"Key":"AD1SMICROTHRUST","Name":"(AD-1S) Fine-Tuned Microthrusters","Description":"[H3]Fine-Tuned Microthrusters for AD-1S[h3]\nThe AD-1 S is already a relatively maneuverable craft, but installing and personalizing an array of small vector adjustment thrusters allows it to compete with many of the galaxy's nimblest starfighters.\n","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD1SMOD"},"Price":3000,"Rarity":6,"HP":2,"BaseMods":{"Mod":{"Key":"HANDLINGADD","Count":1}},"AddedMods":{"Mod":{"Key":"HANDLINGADD","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"SLUGSUPP","Name":"Slugthrower Suppressor","Description":"\n      [H3]Slugthrower Suppressor[h3]\nSuppressors are used by assassins and sharpshooters to make their weapons queiter and more difficult to detect when firing. Similar to energy dampers used to silence blasters, suppressors clip or screw onto the end of a weapon's barrel, redirecting sound and escaping gases to reduce the noise and muzzle flash a slugthrower produces when fired. While they don't make the weapon completely silent they do dramatically reduce its report, making a shooter more difficult to detect. The major downside of using a suppressor is that in reducing the weapon's report it also lowers the speed at which a round travels, diminishing the weapon's damage in the process. Suppressors can only be used on Ranged (Light) and Ranged (Heavy) slugthrower weapons.\n[P][B]Models Include:[b] Czerka Mk. I Suppressor, SoroSuub \"Whisperflite\" Slugthrower Silencer.\n","Source":"Savage Spirits","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Slugthrower"},"Price":100,"Rarity":4,"Restricted":"true","HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Adds [SE][SE] to Perception or Vigilance checks made to locate a concealed shooter firing a silenced slugthrower."}},"Thumbnail":"img\/no_image.png"},{"Key":"MOTTRACK","Name":"Motion Tracker","Description":"\n      [H3]Motion Tracker[h3]\nThe sophisticated device incorporates a full suite of onboard sensors and computers to track and predict the motion of a target, then feed that data back to the user through a variety of means, including a helmet HUD, a hardwirded feed  jacked directly into the brain, or other methods. The system might involve motive-actuators within the weapon to subtly adjust aim, or it might interface with motorized gloves. This attachement can be applied to any Ranged (Heavy) weapon.\n[BR][B]Models Include:[b] CryonCorp Xv3 \"Surefire\" Motion Predictor, Industrial Automaton A-3 Tracking Computer.","Source":"Savage Spirits","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":"RANGHVY"},"Price":1000,"Rarity":6,"HP":2,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Remove [SE] due to target movement or use of Guarded Stance."}},"AddedMods":{"Mod":{"Key":"PRECAIM","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"VARPCRYST","Name":"Varpeline Crystal","Description":"\n      [H3]Varpeline Crystal[h3]\nVarpeline crystals are hard, super dense minerals found on the Outer Rim worlds of Mearalis II. Ranging in color from white to a rich gold, they are scattered througout Mearalis II's extensive mountain ranges. When properly worked, varpeline crystals can be used to slice through nearly any substance known in the galaxy. While they are typically used in industrial cutting machinery or precision fabrication instruments, these stones are occasionally used to great effect as lightsaber crystals.\n[P]When installed in a lightsaber, this crystal produces a blade that emits a short, sharp ringing tone when it strikes an object. A lightsaber equpped with a varpeline  crystal can often cut through the thickest armor or toughest materials, and have a disturbing tendency to dismember living targets.","Source":"Savage Spirits","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":14000,"Rarity":9,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":8},{"Key":"CRITSET","Count":3},{"Key":"BREACH","Count":1},{"Key":"VICIOUS","Count":1},{"Key":"SUNDER"},{"Count":1,"MiscDesc":"When spending [TR] to inflict Critical Injury, may spend additional [TR] to automatically inflict Maimed Critical Injury."}]},"AddedMods":{"Mod":[{"Key":"VICIOUS","Count":2},{"Key":"DAMADD","Count":1}]},"IsCrystal":"true","Thumbnail":"img\/no_image.png"},{"Key":"NISHSTONE","Name":"Nishalorite Stone","Description":"\n      [H3]Nishalorite Stone[h3]\nNishalorite stones are found on worlds with particularly strong magnetic fields. Usually dark gray or blue-black in color, and possessing powerful magnetic properties, these stones are often used in electronics and magnetic navigation equipment. once properly cleaned and refined, they also make for excellent lightsaber crystals, as discovered generations ago by a wandering Jedi Seeker.\n[P]While installed in a lightsaber, this stone creates a dense crackling blade with a subdued color that intensifies in the direction of a planet's magnetic north. It can detect natural and artificially generated magnetic fields such as those produced by generators of powerful electronic systems.","Source":"Savage Spirits","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Lightsaber"},"Price":12500,"Rarity":8,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"DAMSET","Count":7},{"Key":"CRITSET","Count":3},{"Key":"BREACH","Count":1},{"Key":"SUNDER"},{"Count":1,"MiscDesc":"Add automatic [AD] to checks made to location position, navigate terrain, or find power sources or active technology."}]},"AddedMods":{"Mod":[{"Key":"PLANMAP","Count":1},{"Key":"DISORIENT","Count":2},{"Key":"VICIOUS","Count":1}]},"IsCrystal":"true","Thumbnail":"img\/no_image.png"},{"Key":"WATERRECLSUIT","Name":"Water Reclamation Suit","Description":"\n      [H3]Water Reclamation Suit[h3]\nWater reclaimation systems are popular with scouts and hermits, especially those living or working on arid worlds. Produced by a variety of wilderness outfitters, like Survival Equipment Inc. and Gandorthral Atmospherics, these systems collect a body's waste moisture and distill it for drinking. Typically, the consist of a tight bodysuit worn under a suit of armor, that covers a wearer to the neck, wrists, and ankles, along with a matching pair of gloves and a filtermask that covers the mouth and nose.\n[P]Made from layers of synthetic fibermesh, the suit wicks sweat away from the skin and purifies it by means of integrated filtration media. It also collects waste moisture from the mouth and nose by means of the filtermask. The water is then collected in pouches spread across the suit and can either be decanted into a larger container or drunk straight from the suit by means of a long, flexible tube connected to the suit's back. Adding a Water Reclamation System to a suit of armor allows an individual to operate much longer in desolate environments without fear of running out of water. This attachment can be applied to any armor that could logically integrate the necessary pouches and tubing.","Source":"Savage Spirits","Custom":"DescOnly","Type":"Armor","Price":500,"Rarity":4,"HP":2,"BaseMods":{"Mod":{"MiscDesc":"Upgrades ability of Resiliance and Survival checks made in dry or hot environments due to scarcity of water twice."}},"Thumbnail":"img\/no_image.png"},{"Key":"SADDLEBAGS","Name":"Saddlebags","Description":"\n      [H3]Saddlebags[h3]\nMade by purveyors of animal-handling gear such as VeTech and Piccatech, saddlebags are indispensable pieces of equipment for those wh make their livings riding or working with beasts. Constructed from hides or reinforced synthetic textiles, saddlebags typically compromise a pair of large containers with sealed flap covers, connected by a broad belt or  a number of cables. Saddlebags are designed to be portable. They can be thrown quickly over a beast's haunches and, if necessary, removed just as quickly to be carried over the shoulder by the beast's rider. Saddlebags fit countless riding animals, and can be customized functionally and cosmetically to meet an individual's particular tastes and needs.\n[P]Saddlebags can only be worn by riding animals. They increase an animal's encumbrance threshold by 4.","Source":"Savage Spirits","Custom":"DescOnly","Type":"Mount","TypeLimit":{"Type":"Riding Mount"},"Price":25,"Rarity":4,"BaseMods":{"Mod":{"Key":"ENCTADD","Count":4}},"Thumbnail":"img\/no_image.png"},{"Key":"PASSFOLSUIT","Name":"Passive Foliage Suit","Description":"\n      [H3]Passive Foliage Suit[h3]\nFor those operating in the wilds, sometimes the simplest camoflage methods are the best. Given this, it's not surprising that hunters and other individuals who spend a lot of time in the wilderness often use passive foliage suits. These suits have patches of synthetic greenery designed to mimic natural flora. Clusters of opern tie-lines also allow wearers to easiliy attach local foliage to the suit, allowing them to alter their camouflage when the surroundings change. This attachment can be applied to any armor that could logically integrate the necessary patches and tie-lines.\n[P][B]Models Include:[b] Various types.","Source":"Savage Spirits","Custom":"DescOnly","Type":"Armor","Price":75,"Rarity":2,"HP":1,"BaseMods":{"Mod":{"MiscDesc":"Add [SE] to Perception or Vigilance checks made to detect a character wearing this armor in appropriate environment."}},"Thumbnail":"img\/no_image.png"},{"Key":"AD1SHYPER4","Name":"(AD-1S) Hyperdrive Class 4 Module","Description":"[H3]Hyperdrive Class 4 Module for AD-1S[h3]\nInstalling a hyperdrive, even\na relatively low-grade one, in an AD-IS takes up a\ngood deal of space inside of the craft, but also allows\nit to operate independently. For many mercenaries,\nbounty hunters, and other frequent travelers, such an\nupgrade is well worth the cost.\n","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD1SMOD"},"Price":5000,"Rarity":9,"HP":4,"BaseMods":{"Mod":[{"Key":"HYPERDRIVEADD4"},{"Count":1,"MiscDesc":"Add astromech droid socket."}]},"AddedMods":{"Mod":{"Key":"HYPERDRIVESUB5","Count":4}},"Thumbnail":"img\/no_image.png"},{"Key":"PODENGINEBOOST","Name":"Engine Boost System","Description":"\n      [H3]Engine Boost System[h3]\nThere are as many ways of boosting the output of a Podracer's engine as there are engines themselves. Afterburners, volatile chemical injectors, overpressure feeders, electro-magnetic wave-pusle generators, even arcane mixtures of highly reactive and dangerous fuels are all used to provide extra thrust from an engine. While these add-on systems do increase an engine's output, often dramatically so, they have a tendency to shorten its operational life and require extra maintenance to keep the engine operational and at peak performance.\n[BR][B]Models Include:[b] Bespin Motors LK Model Afterburner Array, Slayn & Korpil Surgine-Series Fuel Accelerant System, SoroSuub RR-51 Chem-Injector Suite.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Podracer"},"Price":1100,"Rarity":5,"HP":2,"BaseMods":{"Mod":[{"Key":"SPEEDADD","Count":1},{"Key":"SSTRAINSUB","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"ENVADAPTKIT","Name":"Environmental Adaption Kit","Description":"\n      [H3]Environmental Adaption Kit[h3]\n      The varied and often hazardour environments found throughout the galaxy have a tendency to hinder and harm even the sturdiest, most well-built pieves of equipment. Ranged weapons, especially energy weapons like blasters, are particularly susceptible to environmental damage. Dirt, dust and sand can scratch fog lenses, reducing a blaster beam's cohesion and therefore its range and damage potential. Moisture can collect in barrels and recievers, corroding galven circuitry or rusting bolts and strikers. More exotic environments can wear away at weapons with heat, caustic gases, or damaging ionization.\n[P]To combat these dangers, most weapon and wepaon accessory manufacturers produce Environmental adaption kits. Primarly just collections of seals and protective covers, these kits grant a ewapon an added layer of protection against the wear and tear of regular use in hotile environments. While some are for general use, most of these kits are designed for specific environments: dusty, cold, caustic, etc. Environmental adaptation kits can be attached to any ranged weapon.\n[P][B]Models Include:[b] Various models and manufacturers.\n[P][I]Note: If this kit is for a specific environment, rename the kit to specify the environment.[i]\n    ","Source":"Savage Spirits","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Ranged"},"Price":100,"Rarity":2,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Prevents a weapon from breaking down as a result of a specific type of environment."}},"Thumbnail":"img\/no_image.png"},{"Key":"ENXCITER","Name":"Enhanced XCiter","Description":"[H3]Enhanced XCiter[h3]\nOutlaw Techs have long known how to modify the gas\nconversion enabler in a blaster to yield a more highly\nenergetic—and correspondingly more destructive—payload. Such modified XCiter modules are highly\nunstable, however, and are sometimes disparaged as\nbeing just as dangerous to the wielder and anyone\nelse nearby as to the enemy. Despite the risk and the\nillegality of the modification, many outlaws seek out\nsuch customizations to gain an edge in a firefight. This\nattachment can be applied to any blaster.","Source":"Special Modifications","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Blaster"},"Price":1500,"Rarity":6,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Key":"CRITSUB","Count":1},{"Count":1,"MiscDesc":"GM may spend [DE][DE] to cause blaster to explode, destroying blaster and inflicting automatic Critical Injury on wielder."}]},"AddedMods":{"Mod":{"Key":"PIERCE","Count":3}},"Thumbnail":"img\/no_image.png"},{"Key":"AD1SBOOSTTHRUST","Name":"(AD-1S) Sublight Boost Thrusters","Description":"[H3]Sublight Boost Thrusters for AD-1S[h3]\nThe craft’s engines can\nbe equipped with sublight boosters, which considerably increase their output. Flying at higher speeds\nalso makes the vehicle harder to handle in rough conditions such as asteroid fields, but when outrunning a\npatrol boat or pirate vessel, it can be the difference\nbetween life and death.","Source":"Special Modifications","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"AD1SMOD"},"Price":9000,"Rarity":7,"HP":2,"BaseMods":{"Mod":[{"Key":"SPEEDADD","Count":1},{"Key":"HANDLINGSUB","Count":1}]},"AddedMods":{"Mod":{"Key":"SPEEDADD","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"DAMPEMIT","Name":"Damping Emitter","Description":"\n      [H3]Damping Emitter[h3]\nCareful modifications to the power cells and blade emitter allow the owner of a lightsaber to add a stun setting of sorts, drawing on the power of a normal lightsaber crystal, but with less intensity than is normally used. A damped lightsaber can still inflict serious injuries, however, as the emitter can only limit the power of a heavily modified crystal so much.\n[BR][B]Models Include:[b] Nonr; users must custom make each lightsaber attachment.","Source":"Endless Vigil","Custom":"DescOnly","Type":"Weapon","TypeLimit":{"Type":"Lightsaber"},"Price":2000,"Rarity":7,"HP":1,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"As a maneuver, my adjust lightsaber to deal Stun damage.  Decrease damage by 2, increase critical rating by 1, lose Breach quality."}},"AddedMods":{"Mod":{"Count":2,"MiscDesc":"Stun Damage +1"}},"Thumbnail":"img\/no_image.png"},{"Key":"MODBKACCPOUCH3","Name":"Mk. III Modular Backpack Accessory Pouch","Description":"\n      [H3]Mk. III Modular Backpack Accessory Pouch[h3]\nCreshaldyne Industries' Mk. III Modular Backpack is a civilian version of its popular Mk. IV military reconnaissance pack. Like the Mk. IV, the Mk. III MB is a large, sturdy, internally supported backpack constructed of hard-wearing, weatherproof textiles. It has a single large interior space and two smaller external pockets that are sealed against the environment with a silent, tear away textile sealing system.. The Mk. III is also equipped with a system of hooks and fasteners that allows up to six smaller pouches to be attached to better tailor the backpack to the wearer's needs.","Source":"Savage Spirits","Custom":"DescOnly","Type":"Gear","ItemLimit":{"Key":"MODPACK3"},"Price":15,"Rarity":1,"ModPrice":15,"UseModPrice":"true","BaseMods":{"Mod":{"Key":"ENCTADD","Count":1}},"AddedMods":{"Mod":{"Key":"ENCTADD","Count":3}},"Thumbnail":"img\/no_image.png"},{"Key":"MODCARGOCONT","Name":"Pannier Modular Cargo Handling System","Description":"\n      [H3]Pannier Modular Cargo Handling System[h3]\nDesigned by Piccatech Ltd., the Pennier system is designed to fit as much cargo on a beast as it can carry in an efficient and secure manner. Its base is a specially designed load-bearing harness equipped with quick-release hardwar. From this harness, a beast handler or teamster can hang a variety of secure, hard sided cargo containers. Made from either plasteel or reinforced fiberweave, the cargo containers are buit in a variety of shapes and sizes to suit individual users' needs. The containers are equipped wotj am environmentally sealed locking lid that secures cargp and protects it from dirt, water and other contaminants.\n[P]The Pannier Modular Cargo Handling system comes with two cargo containers and can only be worn by riding or working animals of silhouette 2 or larger. It increases the creature's encumbrance threshold by 6, plus an additional 3 points of encumbrance threshold for each additonal cargo containers added to the system (to a maximum increase of 12).","Source":"Savage Spirits","Custom":"DescOnly","Type":"Mount","TypeLimit":{"Type":"Riding Mount"},"Price":500,"Rarity":4,"ModPrice":350,"UseModPrice":"true","BaseMods":{"Mod":{"Key":"ENCTADD3","Count":2}},"AddedMods":{"Mod":{"Key":"ENCTADD3","Count":10}},"MinSize":2,"Thumbnail":"img\/no_image.png"},{"Key":"HUNTBARREL","Name":"Hunting Barrel","Description":"\n      [H3]Hunting Barrel[h3]\nDesigned to increase range and accuracy, a hunting barrel can turn any blaster rifle into a dedicated hunting weapon. This two-meter-long replacement barrel is constructed of lightweight materiels and packed with upgraded pulse adaptors and denser, more aggressive galven ciruitry. The increased accuracy and range come at the cost of the base weapon's weight and size, however. The extra-long barrel makes the weapon awkward to handle and fire without proper support, as well as making it almost impossible to conceal. A hunting barrel can only be used on a blaster rifle.\n[BR][B]Models Include:[b] Czerka Model 2 \"Huntsman\" Precision Barrel, SoroSuub WQ60 \"Sure-shot\" Barrel, Arakyd 3100 \"Deadeye\" Barrel.","Source":"Savage Spirits","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Blaster Rifle"},"Price":1200,"Rarity":4,"Restricted":"true","HP":3,"BaseMods":{"Mod":[{"Key":"RANGEADD","Count":1},{"Key":"CUMBERSOME","Count":2},{"Key":"ENCADD","Count":1}]},"AddedMods":{"Mod":[{"Key":"ACCURATE","Count":2},{"Key":"LETHALBL","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"MINELAYER","Name":"Minelayer","Description":"\n      [H3]Minelayer[h3]\nMinelayers, and their accompanying ordance, are anti-ship weapons sold by numerous mahor galactic arms manufacturers. Mines are typically deployed in defensive positions, used to deny areas to vehicle traffic or to create fire lanes for weapon emplacements, but they can also be used offensively in a manner similar to missile or torpedo launchers. They come in a variety of styles—from simple concussion mines to sophisticated gravity mines—and grant a small vessel such as a starfighter or patrol boat, a damage capacity well out of proportion to its size. This attachment can be installed on any starship.\n[BR][B]Models Include:[b] GSI M-L4 Seeker. Czerka Arms Mk. IX Proton Mine.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Vehicle","Price":4000,"Rarity":6,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Allows vehicle to carry a number of space mines equal to its silhouette."},{"Count":1,"MiscDesc":"Pilot or gunner may make an [B]Average ([DI][DI]) Mechanics check[b] to deploy a mine anywhere within close range."}]},"AddedMods":{"Mod":[{"Count":1,"MiscDesc":"Increase deployable range to medium"},{"Count":3,"MiscDesc":"Increase mine capacity by 1"}]},"MustBeStarship":"true","Thumbnail":"img\/no_image.png"},{"Key":"CONTFIELD","Name":"Containment Field","Description":"\n      [H3]Containment Field[h3]\nDesigned for permanent installation, a containment field generator consists of two flat, cylindrical generators—one bolted to the floor, the other to the ceiling— that hold a single individual captive in a powerful stasis field. Individuals held in a containment field. Individuals held in a containment field wear megnetic binders and are suspended in mid-air, completley isolated from the world around them. When held in  a containment field, individuals are usually fitted with bio-signs monitors due to the field's distressing habit of causing heart attacks, brain damage, or death if it is not tuned correctly. This attachment can be installed on any vessel of silhoette 4 or higher.\n[BR][B]Models Include:[b] Gordarl Weaponsmiths A1 Containment Field.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Vehicle","Price":7500,"Rarity":9,"Restricted":"true","HP":2,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Can hold one Silhouette 1 creature.  Creature can see, hear, and speak, but cannot move."},{"Count":1,"MiscDesc":"Operator can attack prisoner.  Prisoner must make a [B]Hard ([DI][DI][DI]) Resilience check[b] and suffers 1 damage per [FA] and one [TH] may be used to inflict 1 strain."}]},"MinSize":4,"Thumbnail":"img\/no_image.png"},{"Key":"ENPRISONLOCK","Name":"Enhanced Prison Lockup","Description":"\n      [H3]Enhanced Prison Lockup[h3]\nA prisoner lockup is an aftermarket modification that provides a ship with a comprehenisve prisoner handling and transporting system. It includes two cells that hold one human-sized individual each, with sufficient life support and basic necessities. The kit also includes numerous security systems for the lockup itself an the ship at large. Cameras and motion sensors are installed and powerful electronic locks are fitted to hatches and doors throughout the ship. This attachment can be installed on any vessel capable of carrying prisoners.\n[BR][B]Models Include:[b] Various models.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Vehicle","Price":3500,"Rarity":7,"HP":3,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Full incarceration and security suite for 2 prisoners."}},"AddedMods":{"Mod":{"Count":4,"MiscDesc":"Support for one additional prisoner."}},"Thumbnail":"img\/no_image.png"},{"Key":"MICROROCKARMMOUNT","Name":"Micro-Rocket Armor Mounting","Description":"\n      [H3]Micro-Rocket Armor Mounting[h3]\nMicro-rockets are flexible (if dangerous) weapons favored as secondary arms by many bounty hunters (see [B]Micro-Rockets[b] on page 46), and generally fired from a mount installed in the wielder's armor. This attachment can be intalled on any amor.\n[BR][B]Models Include:[b] BlasTech Mag-Clip Micro-Rocket Mounting, Goseia HIC \"Last Word\" Launch\/Targeter System, countless custom variants.\n    ","Source":"No Disintegrations","Custom":"DescOnly","Type":"Armor","Price":800,"Rarity":6,"Restricted":"true","HP":2,"Encumbrance":3,"BaseMods":{"Mod":{"Count":1,"MiscDesc":"Enables armor to fire loaded micro-rockets."}},"AddedMods":{"Mod":[{"Key":"LIMITEDAMMO","Count":5,"WeaponModifierIndex":0},{"Key":"SETBACKSUB","Count":2,"WeaponModifierIndex":0}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Micro-Rocket Launcher","SkillKey":"RANGHVY","NoMelee":"true","Qualities":{"Quality":{"Key":"LIMITEDAMMO","Count":1}},"RangeValue":"wrShort","Range":"Short"}},"Thumbnail":"img\/no_image.png"},{"Key":"VAKSAI","Name":"Vaksai Modification Package","Description":"\n      [H3]Vaksai Modification Package[h3]\nA pre-fabricated kit of starship modifications sold by TransGalMeg for their Kihraxz modular light starfighter, this package includes upgraded engines and flight control systems, a heavier weapons loadout, and a higher-out-put shield generator. While expensive, those Kihraxz pilots who can afford it swear by the added surivability and firepower it provides, allowing the fighter to engage heavier targets and emerge victorious.\n[P][B]Models Include:[b] Vaksai Modification Package.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Vehicle","ItemLimit":{"Key":"KIHRAXZLTSTAR"},"Price":45000,"Rarity":7,"HP":2,"BaseMods":{"Mod":[{"Key":"SETARMOR","Count":3},{"Key":"SETHAND","Count":1},{"Key":"SETDEFAFT","Count":1}]},"AddedMods":{"Mod":[{"Key":"VAKSAI"},{"Key":"ADDDEFFORE","Count":1},{"Key":"SSTRAINADD","Count":3}]},"Thumbnail":"img\/no_image.png"},{"Key":"MICROROCKRACK","Name":"Under-Barrel Micro-Rocket Rack","Description":"\n      [H3]Under-Barrel Micro-Rocket Rack[h3]\nMicro-rockets can be fired in a plethora of ways, and some hunters mount them on their other weapons, giving these arms a deadly secondary fire mode (see [B]Micro-Rockets[b] on page 46). This attachment can be installed on any ranged weapon.\n[P][B]Models Include:[b] Blastech \"Finisher\" Rocket Rack, TaggeCo Under-Barrel Rocket Battery.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Ranged"},"Price":1200,"Rarity":6,"Restricted":"true","HP":3,"Encumbrance":3,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"Enables weapon to fire loaded micro-rockets."},{"Key":"CUMBERSOME","Count":1}]},"AddedMods":{"Mod":[{"Key":"LIMITEDAMMO","Count":2,"WeaponModifierIndex":0},{"Key":"SETBACKSUB","Count":2,"WeaponModifierIndex":0}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Micro-Rocket Rack","SkillKey":"RANGHVY","NoMelee":"true","Qualities":{"Quality":{"Key":"LIMITEDAMMO","Count":1}},"RangeValue":"wrShort","Range":"Short"}},"Thumbnail":"img\/no_image.png"},{"Key":"MKTARGLOCK","Name":"Marked-Target Firing Lock","Description":"\n      [H3]Marked-Target Firing Lock[h3]\nIn the chaos of a firefight, shots can go astray, damaging property or bystanders. While some hunters do not care about the carnage they cause, this kind of haphazard damage is a liability, courting attention from the law or revenge from those who sugger in the crossfire. To mitigate this risk, some bounty hunters invest in firing locks on their blasters, allowing them to designate specific targets for the weapons. Once the systems' sensors have recognized a target, the weapons refuse to fire without a clear shot, minimizing the chance of collateral damage. This attachment can be installed on any ranged weapon that does not posess the Blast or Auto-fire quality.\n[P][B]Models Include:[b] BlasTech \"Surefire\" Safety Sensor, Cadregg Armory Model-87 Weapon Sensor.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Ranged"},"Price":900,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Key":"THRCANCEL","Count":1}},"AddedMods":{"Mod":{"Key":"THRCANCEL","Count":1}},"Thumbnail":"img\/no_image.png"},{"Key":"SHOCKPULSEMIT","Name":"Shock Pulse Emitter","Description":"\n      [H3]Shock Pulse Emitter[h3]\nShock pulse emitters operate along principles simlar to a blaster's stun setting, but at much shorter effective range—a range short enough to be of little use as weapons in themselves. However, when shock pulse emitters are integrated into weapons intended for close combat to begin with, they become effective combat tools to debilitate opponents and make a finishing blow easier to land. This attachment can be installed on any Melee or Brawl weapon.\n[P][B]Models Include:[b] Corellian Personal Defense Stun Pad.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Weapon","SkillLimit":{"Key":["BRAWL","MELEE"]},"Price":1500,"Rarity":5,"HP":2,"BaseMods":{"Mod":{"Key":"STUN","Count":2}},"AddedMods":{"Mod":[{"Key":"STUN","Count":2},{"Key":"DISORIENT","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"REPASSLIFT","Name":"Replusor-Assisted Lifting","Description":"\n      [H3]Replusor-Assisted Lifting[h3]\nAlthough more common among factory or warehouse labor crews than in battle, repulsor-assist systems have gained some popularity among bounty hunters who need to haul in heavy catches. The systems operate through a series of miniaturized repulsorlift generators placed at key joints throughout the amor, easing the weight of attached suits, as well as any loads they might support. Of course, the repulsorlift generators are tuned to reduce weight and pressure rather than exert force on their own, so some hunters prefer powered armor suits with lesser lifting capabilities but more general applications for their servos. This attachment can only be used with laminate armor and other full-body hard armor suits.\n[P][B]Models Include:[b] Guldak Heavy Industries Personal Repulsor Fitting.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Armor","CategoryLimit":{"Category":"Hard Full Body"},"Price":1000,"Rarity":3,"HP":2,"BaseMods":{"Mod":{"Key":"ENCTBRADD","Count":5}},"AddedMods":{"Mod":[{"Key":"ENCTBRADD","Count":2},{"Key":"ATHL","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"MICROROCKGUIDE","Name":"Rocket Guidance System","Description":"\n      [H3]Rocket Guidance System[h3]\nMost micro-rockets are fired directly at their target, relying on the firer's aim and the rocket's acceleration to ensure a direct hit. For those who prefer more insurance that their rockets land precisely where intended, packages of sensors, limited fuel cell expansions, and adjustable maneuvering fins allow for rockets to be modifed into maneuvering fins allow for rockets to be modified into \"smart\" weapons that continue to seek their designated target in the event of an initial miss or misfire. These systems enable users to get more reliable performance out of their rockets while at the same time minimizing the collateral damage. This attachment can be installed on any micro-rocket.\n[P][B]Models Include:[b] Phar Co. \"Vornskr\" Guidance Package, Merr-Sonn \"Outreach\" Target Sensor.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Micro-Rocket"},"Price":50,"Rarity":4,"HP":1,"BaseMods":{"Mod":{"Key":"GUIDED","Count":2,"QualSet":"true"}},"AddedMods":{"Mod":[{"Key":"GUIDED","Count":3},{"Key":"ACCURATE","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"MICROROCKBOOST","Name":"Staged Rocket Booster","Description":"\n      [H3]Staged Rocket Booster[h3]\nThe limitations of size mean that most micro-rockets lack the fuel capacity to reach distant targets. However, high-yield fuel cells, advanced filtration systems, or staged boosters added to the rockets can all increase a rocket's effective range substantially. Of course, the term \"effective range\" becomes something of a misnomer with rockets modifed in this way, as the additional fuel risks unbalancing the rocket's flight path, and the increased range comes with an increased chance of misjudgement on the part of the user. However, the chance to deliver a hefty payload beyond the reach of equivalent retribution is worth the risk to many. This attachment can be installed on any micro-rocket.\n[P][B]Models Include:[b] SoroSuub HV-33 Fuel Filter.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Weapon","CategoryLimit":{"Category":"Micro-Rocket"},"Price":25,"Rarity":2,"HP":1,"BaseMods":{"Mod":[{"Key":"RANGEADD","Count":1},{"Key":"INACCURATE","Count":2}]},"AddedMods":{"Mod":[{"Key":"RANGEADD","Count":1},{"Key":"SUBQUALINACCURATE","Count":2}]},"Thumbnail":"img\/no_image.png"},{"Key":"TRACKSYS","Name":"Tracking System","Description":"\n      [H3]Tracking System[h3]\nThrough a series of specialized computer systems and sensors, this attachment collects and processes data from the wearer's surroundings to follow and predict the movements of designated targets. A heads-up display integrated into a helmet or visor feeds the wearer this information onto an overly of their surroundings. The systems are not limited to local targets, either, but can follow signals from distant communicators or tags and process optimal routes towards them. Tracking systems in armor are typically designed to operate alongside similar equipment, and are often able to integrate with other systems to a greater effect than the sum of their parts. This attachment can be installed on any armor.\n[P][B]Models Include:[b] Galkor Solutions W-7 Locator Array.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Armor","Price":1000,"Rarity":7,"HP":1,"BaseMods":{"Mod":[{"Count":1,"MiscDesc":"As a maneuver, may designate a target for tracking.  Only one target may be designated at a time."},{"Count":1,"MiscDesc":"Upgrade the ability of checks to track a designated target once."}]},"AddedMods":{"Mod":[{"Key":"VIGIL","Count":1},{"Key":"SURV","Count":1}]},"Thumbnail":"img\/no_image.png"},{"Key":"INTHOLST","Name":"Integrated Holsters","Description":"\n      [H3]Integrated Holsters[h3]\nBy mounting their holsters into the framework of their armor, combatants can ensure no one can catch them unarmed. Not only does the wearer have easy access to these weapons at all times, but powered servos an other systems can be set up to assist the wearer in drawing or stowing these weapons more repidly. A character with  a fully tooled set of integrated holsters has access to a hidden arsenal that can overwhelm most foes.\n[BR][B]Models Include:[b] BlasTech \"Personal Armory\" Gear.","Source":"No Disintegrations","Custom":"DescOnly","Type":"Armor","Price":300,"Rarity":4,"HP":2,"Encumbrance":4,"BaseMods":{"Mod":{"Key":"HOLSTER3","Count":2}},"AddedMods":{"Mod":[{"Count":2,"MiscDesc":"Add [SE] to Perception checks to find stored weapons"},{"Key":"HOLSTER3","Count":3},{"Key":"QUICKDR"}]},"Thumbnail":"img\/no_image.png"},{"Key":"PARALAND","Name":"Paramilitary Landspeeder","Description":"\n      [H3]Paramilitary Landspeeder[h3]\n      Converts a landspeeder to a paramilitary vehicle.\n    ","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Landspeeder"},"BaseMods":{"Mod":[{"Key":"HANDLINGSUB","Count":1},{"Key":"ARMORADD","Count":3},{"Key":"HULLADD","Count":2},{"Key":"SSTRAINSUB","Count":1},{"Count":1,"MiscDesc":"Adds a medium laser turret"}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Medium Laser Cannon","SkillKey":"GUNN","Damage":6,"Crit":3,"VehicleWeaponProperties":{"Turret":"true","FiringArcs":{"Fore":"true","Aft":"true","Port":"true","Starboard":"true"}},"VehicleWeaponCount":1,"RangeValue":"wrClose","Range":"Close"}},"Thumbnail":"img\/no_image.png"},{"Key":"PARAWALK","Name":"Paramilitary Walker","Description":"\n      [H3]Paramilitary Walker[h3]\n      Converts a walker to a paramilitary vehicle. \n    ","Source":"Dangerous Covenants","Custom":"DescOnly","Type":"Vehicle","TypeLimit":{"Type":"Walker"},"BaseMods":{"Mod":[{"Key":"HANDLINGSUB","Count":1},{"Key":"ARMORADD","Count":2},{"Key":"SSTRAINSUB","Count":2},{"Count":1,"MiscDesc":"Adds a forward medium laser cannon"}]},"WeaponModifiers":{"WeaponModifier":{"UnarmedName":"Medium Laser Cannon","SkillKey":"GUNN","Damage":6,"Crit":3,"VehicleWeaponProperties":{"Location":"Forward","FiringArcs":{"Fore":"true"}},"VehicleWeaponCount":1,"RangeValue":"wrClose","Range":"Close"}},"Thumbnail":"img\/no_image.png"}]}